{"title":"The Health Wyze Report - Episode 13","uid":6982563,"size":60441791,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:003a447cb8babf05c637b3fd7ae1d233e462cdf6&amp;dn=The+Health+Wyze+Report+-+Episode+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1327449291,"description":"We were joined by David from the International Wellness Directory. David is the co-author of the book, 'Bypassing Bypass', and the author of 'Safe Rapid Weight Loss'. His International Wellness Directory puts people in contact with local naturopathic doctors, and other alternative medical practitioners.\n\nWe discussed the current flaws of the medical establishment relating to heart health, including the dangers of stress tests, and how aspirin therapy is dangerous. David explains how people really can help their heart, and provides a simple, but unusual test for blood pressure that can truly determine the risk of a heart attack. We also discuss the importance of vitamin C for the heart and other major diseases, and the relationship between the amino acid L-taurine and monosodium glutamate. We explain how chlorine is one of the greatest killers of modern times, and how chlorine dioxide in the water supply causes heart disease and cancers. David then provides some quick and easy tips for weight loss too.\n\nTime: 64 Minutes, 16 Seconds. Size: 58 Mb\n\nLearn more about The Health Wyze Report at http://healthwyze.org/. The Health Wyze Report releases this media presentation to the public, and encourages the sharing of it, so long as it is not remade into a form that maligns our work, and so long as conspicuous credit is given for its authorship, as specified in our Liberal Copyright Policy.","torrent":{"xt":"urn:btih:003a447cb8babf05c637b3fd7ae1d233e462cdf6","amp;dn":"The+Health+Wyze+Report+-+Episode+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"003a447cb8babf05c637b3fd7ae1d233e462cdf6","infoHashBuffer":{"type":"Buffer","data":[0,58,68,124,184,186,191,5,198,55,179,253,122,225,210,51,228,98,205,246]},"announce":[],"urlList":[]}}