{"title":"BENEATH A STEEL SKY - Go Underworld and expose sinister secrets","uid":6905743,"size":93306032,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:033a24c91a4b1a861488813f225b434b67507874&amp;dn=BENEATH+A+STEEL+SKY+-+Go+Underworld+and+expose+sinister+secrets+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Aubrey.B","files":-1,"time":1324577023,"description":"BENEATH A STEEL SKY\n\t\tGo Underworld and expose sinister secrets inside the city\n\n\n    genre: adventure / point-and-click / sci-fi\n    download size: 71 MB\n    release date: April 11, 1994\n    compatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit)\n    languages: English\n    developer / publisher: Revolution Software / Revolution Software\n    game modes: single-player\n\n\nBonus content included for FREE with the game:\n\n- manual (15 pages)\n- 2 HD wallpapers\n- 8 avatars\n- comic book\n\n\nWhat's cool about it:\n\n- A claustrophobic, paranoid and psychotic atmosphere\n- Over 100 locations designed by an English comic book artist and writer Dave Gibbons\n- Many interesting characters that move about freely and live out their own lives, thanks to the Virtual Theatre system\n\n\nOverview:\n\nRobert Foster is an innocent outsider stranded in a vast city where oppressed civilians live and work in soaring tower blocks... while the corrupt, covetous and rich lie underground, shielded from all pollution. Alone, save for a robot circuit board, Foster must fight for survival... and discover the sinister truth behind his abduction...\n\nParanoid population. Psychotic criminals. Power hungry corporation. Big Brother government. Haves and have nots.\n\nIn the not so impossible future. In the melting pot of Union City. All man's social problems are coming to a boil. Under the claustrophobic lid of a steel sky.\n\nFrom the pit of the industrial level to the belly of commercial sector, to the spheres where the rich and powerful play. It's Man against Man. Man against Machine. Man against Time. In an urban hell only you can liberate... Maybe.\n\nFeaturing Revolution's Software innovative Virtual Theatre system, Beneath a Steel Sky is a gripping science fiction point and click adventure game in the cyberpunk genre. Over 100 locations designed and art directed by award-winning comic book author Dave Gibbons (Watchmen fame). His comic book, inspired by the game itself, is included to complete the content.\n\n\nAge requirements:\n\nESRB Rating: TEEN with Suggestive Themes, Animated Violence.\n\n\nMinimum system requirements:\n\nWindows XP or Windows Vista, 1 GHz Processor (1.4 GHz recommended), 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), Mouse, Keyboard.","torrent":{"xt":"urn:btih:033a24c91a4b1a861488813f225b434b67507874","amp;dn":"BENEATH+A+STEEL+SKY+-+Go+Underworld+and+expose+sinister+secrets+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"033a24c91a4b1a861488813f225b434b67507874","infoHashBuffer":{"type":"Buffer","data":[3,58,36,201,26,75,26,134,20,136,129,63,34,91,67,75,103,80,120,116]},"announce":[],"urlList":[]}}