{"title":"BBC-HD Jerusalem_ The Making of a Holy City 3 of 3 x264 AC3 720p","uid":6911100,"size":1538934545,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:05cad6cdcaa45b6c073375d966f7956100ba3862&amp;dn=BBC-HD+Jerusalem_+The+Making+of+a+Holy+City+3+of+3+x264+AC3+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pharos01","files":1,"time":1324773734,"description":"59:01\n\nJudgement Day\n\nEpisode 3 of 3\n\nJerusalem is one of the oldest cities in the world. For the Jewish faith, it is the site of the western wall, the last remnant of the second Jewish temple. For Christians, the Church of the Holy Sepulchre is the site of the death and resurrection of Jesus Christ. For Muslims, the Al-Aqsa mosque is the third holiest sanctuary of Islam.\n\nIn episode three, Simon explores how this unique city rose from a crumbling ruin after the crusades to be rebuilt as a world centre of Islamic pilgrimage. He explains how Jerusalem became the object of rivalry between the Christian nations of Europe, the focus of the longing of Jews from all over the world and, ultimately, the site of one of the world's most intractable conflicts.\n\nStarting in the Middle Ages, Simon goes on a chronological journey to trace the revival of the city under the Mamluks and its conquest by the biggest of all the Islamic empires - the Ottomans. He examines how the distinctive national identity of the Arab population evolved under centuries of Turkish Ottoman rule and how the city came to be prized by the great powers of 19th- century Europe. The programme explores the emergence of Zionism and the growing Jewish population of the city and traces the origins of today's nationalist struggle.\n\n\nSource: BBC-HD\n\n\nA/R (WxH): 1:1.78 (1280*720)\nVCodec: x264 from AVC in TS\nAudio: AC3 2ch 192Kbps in TS\n\nHD downsized/resized: 1920*1080i to 1280*720p\n\nFlawless encoding\n\nPls help seed to keep torrent alive!","torrent":{"xt":"urn:btih:05cad6cdcaa45b6c073375d966f7956100ba3862","amp;dn":"BBC-HD+Jerusalem_+The+Making+of+a+Holy+City+3+of+3+x264+AC3+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05cad6cdcaa45b6c073375d966f7956100ba3862","infoHashBuffer":{"type":"Buffer","data":[5,202,214,205,202,164,91,108,7,51,117,217,102,247,149,97,0,186,56,98]},"announce":[],"urlList":[]}}