{"title":"turtle-0.9.4-live.iso","uid":6893569,"size":310798336,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:05eb5eb94314bba79cbda93d09f85112cf11370c&amp;dn=turtle-0.9.4-live.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cestpasgagne.org","files":1,"time":1324110175,"description":"Kevux\n\nKevux is an operating system based mainly on GNU operating programs and a Linux kernel, all compiled with uclibc instead of the more common glibc. It is not FHS or LSB compatible. Compared to other Linux distributions, Kevux is space efficient (making it suitable for USB disk operation) and difficult to hack into. &lt;a href=&quot;\nhttp://freecode.com/projects/kevux&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freecode.com/projects/kevux&lt;/a&gt;\n\nTurtle Kevux - 0.9.4\nFixes of Turtle 0.9.3 Problems\n    * Fix major networking problem in 0.9.3 where devices are improperly started\n    * Once again attempt to solve the autologin relogin problem with qingy (this time completely strip out the code that does a timestamp check, if the file exists then do not re-login, period\n    * When shutting down or rebooting, make sure to tell all sshd connections to close and turn off network devices\n    * Network scripts did not stop dhcpclient, wpa_supplicant, and hostap if it was running when the network script was stopped\n    * /etc/hosts was being used instead of /etc/network/hosts\n    * Fixed initrd boot process problems\n    * Removed floating_root parameter from squish and squash boot options, making floating_root unconditional for squash and squash booting\n\nNew Software\n    * Added joy2key\n    * Added vala\n    * Added gstreamer (which doesn't really work anyway..)\n    * Added webkit\n    * Added midori (replacing seamonkey)\n    * Added libvpx\n    * Added tunctl\n    * Added bind (replacing maradns)\n    * Added celt\n    * Added links back now that it appears to be actively maintained once again\n    * Added strace to the toolchain\n    * Added libpki\n    * Added openca-ocspd\n    * Added libotr and pidgin-otr for encrypted chat support\n\nRemoved Software\n    * Removed seamonkey\n    * Removed maradns (does not support dnssec, so it was replaced with bind)\n    * Removed ps3-utils\n    * Removed tcl/tk\n    * Removed pidgin-encryption in favor of pidgin-otr\n\nNetwork Changes\n    * Removed support for /etc/network/proc_settings\n    * Added network device setting file auto-generation and auto-degeneration support\n    * Prevent already started or stopped network devices from being re-started or re-stopped\n    * Add extension support to dns resolver\n    * Add non-standard port support for ipv4 dns resolver\n\nOther Changes\n    * Shortened udev settle time to 4 seconds\n    * Added support for /etc/sysctl.conf (this also replaces /etc/network/proc_settings)\n    * Desktop build now adds fewer xorg video drivers\n    * Now supports custom xorg.conf.d directories at /etc/X11/ (This helps enable KMS) &lt;a href=&quot;\nhttp://kevux.org/turtle/changelog.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kevux.org/turtle/changelog.html&lt;/a&gt;\n\n2011 / 12 / 16\nTurtle Kevux 0.9.4 Released.\n\nThe highlights of this release are:\n...\nDNS Extension Support\n\n/etc/resolv.conf (which on kevux is /etc/network/resolution) defines how to talk to domain name authorities in order to resolve a domain name such as www.google.com to its appropriate ip address.\nThe standard way in which this happens is via the nameserver settings, such as: nameserver 8.8.8.8.\nDNS extension support provides a way to specify a nameserver based on the extension being looked up.\nThat is to say, one could provide their own private dns server with their own extension, such as 'computer', and only the private dns server will be used for all domain names that end in '.computer'.\nIf the private dns server was 192.168.0.1, then the extension line for this would be: extension computer 192.168.0.1.\nA complete /etc/network/resolution file using the mentioned extension and nameserver would be:\nextension computer 192.168.0.1\nnameserver 8.8.8.8\n\nDNS Private Ports\nJust like with DNS Extension Support, DNS private ports alters how the dns resolution process works.\nTraditionally port 53 is used for dns and no other port is supported.\nDNS private ports alters this behavior such that any port may be used, thus allowing a single server to host dozens of separate dns servers.\nTo utilize this, one need only add ':port_number&quot; where 'port_number' is replaced with the desired port number.\nLets use the example /etc/network/resolution example file specified in DNS Extension Support.\nThe '.computer' domain name server at 192.168.0.1 for whatever reason wants to run its dns on port 80, the resulting /etc/network/resolution file would look like:\nextension computer 192.168.0.1:80\nnameserver 8.8.8.8\nAt this time only ipv4 addresses are supported.\n\nKevux Undernet\nThe first stage of the kevux undernet utilizes the DNS Extension Support and DNS Private Ports to provide the kevux domain name authority.\nTo utilize the kevux undernet domain name server, simply add: extension kevux 76.76.104.234:1 to the top of your /etc/network/resolution file.\nThe standard kevux /etc/network/resolution file looks like:\nextension kevux 76.76.104.234:1\nnameserver 8.8.8.8\noptions timeout:2 attempts:2\n\nThe kevux undernet provides the following services:\n    * .kevux domain names\n    * Kevux SSL certificate authority\n    * Kevux undernet primary website (HTTPS only)\n    * Kevux package manager server (HTTPS only)\n\nAt this time the SSL authority and certificates are experimental and will be changed once a better understanding of the process is achieved.\nDNS Security is also available, but it is even more experimental and less tested.\n\nKit, the Kevux (Git) Package Manager\nThe package manage is planned to be developed through-out the next few releases such that it turtle kevux can be slowly converted to using it.\nTherefore, it is being released in stages of functionality.\nThis first release does practically nothing at all and currently only provides source based installation for whatever packages might that might be available.\nThe only package available as of the release date for turtle kevux 0.9.4 is the linux kernel.\nThe Turtle Kevux Installation Scripts have been promoted to version 1.0.0 as they are being replaced by Kit.\n\nPlanned Package Manager Functionality:\n    * Source Based Package Installation\n    * Binary Based Package Installation\n    * Pick and Choose Between Binary and Source Based Packages\n    * Source and Binary Based Dependency Handling\n    * Package Rollback/Revert Support\n    * Custom/Private Repository Support\n    * Compile/Build System from Scratch via Package Manager\n    * Completel Log of All Operations Performed\n    * Built Using Bash, Git, and a Handfull of Other Common/Standard Linux Utilities\n\nHTTPS is now the default protocol, for better and worse\nIn an attempt to push for using encrypted websites by default for security purposes, the HTTPS protocol is now used by default.\nThis means that typing www.google.com will get you https://www.google.com/ instead of http://www.google.com/.\nThe downside of this is that a large number of websites either do not listen on HTTPS or provide a completely different website on HTTPS.\nFor those cases, you will have to manually prepend http:// to the problematic url.\n\nNew Problems\nThis really isn't a good thing, but users should be aware of both good and bad things about a release.\nThis highlights the major problems that were introduced and have been unable to be fixed by the time of the release for one reason or another.\n\nA handfull of applications decided they did not want to work with no obvious reasons as to why.\nThese applications are:\n    * Gstreamer\n    * Qemu\n    * Lbreakout2\n    * Claws-mail\n    * Freedroid RPG\n\nGstreamer\nI have only had bad experience with gstreamer and have never liked it (not to mention the bloat it adds to the system).\nHowever, a lot of the newer functionality, such as HTML5 support in webkit and video conferencing in pidgin, depend on it and do not provide an alternative.\nFor this reason gstreamer was added, but as far as I can tell, gstreamer does not work in the slightest way.\nIt fails to detect that sound support exists (while every single other application and library on the system can).\nIt fails to report that it is capable of playing video and as such midori won't play any HTML5 video and pidgin video conferencing cannot be supported.\n\nQemu\nQemu recently stopped starting up.\nIt appears to startup and then deadlocks or gets caught an infite loop doing no apparent task but waisting cpu time.\nI have no idea what or why this is happening.\nThis has prevented me from doing some much needed work in non-x86 architectures.\n\nLbreakout2\nThe latest version of lbreakout2 appears to have the same problem as qemu.\nFortunately, downgrading from 2.6.3 to 2.6.2 seems to get lbreakout2 working again.\nFixing this may lead to solving the qemu problem.\n\nClaws-mail\nThe latest version of claws-mail at the time of this release is 3.7.10.\nWhen claws-mail tries to read IMAP mail, it segfaults.\nI have consistently had problems with claws-mail, IMAP, and uClibc in the past, so this may be caused by some uClibc bug as well.\n\nFreedroid RPG\nLike claws-mail, Freedroid RPG decided it wants to segfault.\nThere is no clear reason as to why and as such I can only assume its a uClibc given that freedroid rpg has not been changed since the previous release of turtle kevux (and it worked in the previous release).\n\nThere a couple of problems with cdroms:\n    * Burning CD-Roms\n    * Booting 64-bit Live CD-Roms\n\nBurning CD-Roms\nWhen a non-root user tries to burn a cdrom, the cdrom? symbolic links disappears.\nThe only way to I have been able to burn to /dev/cdrom? is to do so as the root user.\nThis is either a bug in the kernel, udev, or both.\n\nBooting 64-bit Live CD-Roms\nThe 64-bit live cdroms do not properly load grub for some reason.\nThis can be worked around if you have booted to the live cd and ar sitting at a grub prompt.\nAt the said grub prompt, type in the command: configfile /boot/grub/menu.lst.\nThis could be related to how I am using the 32-bit grub on the 64-bit live cdroms. &lt;a href=&quot;\nhttp://kevux.org/news.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kevux.org/news.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://kevux.org/turtle/download.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kevux.org/turtle/download.html&lt;/a&gt; (_64,DVD,...) &lt;a href=&quot;\nhttp://kevux.org/turtle/documentation.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kevux.org/turtle/documentation.html&lt;/a&gt; &lt;a href=&quot;\nhttp://kevux.org/mailman/listinfo/turtlesupport_kevux.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://kevux.org/mailman/listinfo/turtlesupport_kevux.org&lt;/a&gt;\n\nsha256sum : 3814c9fd94d9723a51fd9adeb5b4b6a8455c1c9ba450c3a84910a13dcf42e08e  turtle-0.9.4-live.iso","torrent":{"xt":"urn:btih:05eb5eb94314bba79cbda93d09f85112cf11370c","amp;dn":"turtle-0.9.4-live.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05eb5eb94314bba79cbda93d09f85112cf11370c","infoHashBuffer":{"type":"Buffer","data":[5,235,94,185,67,20,187,167,156,189,169,61,9,248,81,18,207,17,55,12]},"announce":[],"urlList":[]}}