{"title":"THE DESCENDANTS XVID GLOBE","uid":6962530,"size":1128499787,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07e70add4bb31eb2b51e4a8a20bddef0a0ee7264&amp;dn=THE+DESCENDANTS+XVID+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1326811392,"description":"* XVID     * 01H55M31S    * ~ 1200 Bitrate    * Worked with the Dub plugins\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Intro :\n\nThe Descendants is a 2011 American comedy-drama film directed by Alexander Payne. The screenplay by Payne, Nat Faxon and Jim Rash is based on the novel by Kaui Hart Hemmings. The film stars George Clooney, Shailene Woodley, Judy Greer, Matthew Lillard and Beau Bridges, and was released in the United States on November 18, 2011 after being screened at the 2011 Toronto International Film Festival .\n\n\n* Plot :\n\nMatt King (George Clooney) is a Honolulu-based lawyer and the sole trustee of a family trust that controls 25,000 acres of pristine land on the island of Kaua'i. The trust will expire in seven years because of the rule against perpetuities, so the King family has decided to sell the land to Kaua'i native Don Holitzer for development. Just before family members are ready to formally endorse the deal, which Matt favors, a boating accident near Waikiki renders Matt's wife, Elizabeth, comatose.\n\nMatt and Elizabeth have two daughters, 10-year-old Scottie (Amara Miller) and 17-year-old Alex (Shailene Woodley). Matt is not very close to his daughters and refers to himself as the &quot;back-up parent.&quot; With Elizabeth in a coma at Queen's Hospital, he is forced to confront Scottie's inappropriate behavior with other children and Alex's drinking.\n\nMatt learns that Elizabeth will never awaken from her coma, which means that under the terms of her living will she must be disconnected shortly from life support. He tells Alex, but not Scottie, that Elizabeth will not recover and must be allowed to die. Alex tells her father that Elizabeth was having an affair at the time of the accident. Matt confronts two family friends, Kai and Mark, and learns that Elizabeth's lover is Brian Speer (Matthew Lillard).\n\nMatt decides to tell Brian that Elizabeth will soon be dead to give him a chance to visit her while she's still alive. He discovers that Brian is a real estate agent currently vacationing on Kaua'i. After telling the family of Elizabeth's terminal prognosis, Matt, along with the girls and Sid (Alex's slacker friend), travels to Kaua'i to find Brian.\n\nMatt goes jogging on the beach and passes a man that he recognizes as Brian. He trails him and sees him enter a cottage, owned by Matt's cousin, Hugh (Beau Bridges). Hugh tells him that Brian is Don Holitzer's brother-in-law, and if Matt and his family sell the land to Holitzer, Brian stands to gain a lot of money from commissions when the land is developed.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *","torrent":{"xt":"urn:btih:07e70add4bb31eb2b51e4a8a20bddef0a0ee7264","amp;dn":"THE+DESCENDANTS+XVID+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e70add4bb31eb2b51e4a8a20bddef0a0ee7264","infoHashBuffer":{"type":"Buffer","data":[7,231,10,221,75,179,30,178,181,30,74,138,32,189,222,240,160,238,114,100]},"announce":[],"urlList":[]}}