{"title":"ftvgirls.com.2011-12.Sensi.XXX.[GoldenPirates]","uid":6998263,"size":2887627645,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:09b9838c3257823a9c4f64d97bb0920c8590433d&amp;dn=ftvgirls.com.2011-12.Sensi.XXX.%5BGoldenPirates%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"GoldenPirates","files":-1,"time":1327964740,"description":"Another torrent from goldenpirates.org\n\nno viruses, no shit, no Bullshit, just pure PORN!\n\nSite:         &lt;a href=&quot;\nhttp://www.ftvgirls.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ftvgirls.com&lt;/a&gt;\n\nTeam:          &lt;a href=&quot;\nhttp://goldenpirates.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://goldenpirates.org&lt;/a&gt;\n\nUploader/Ripper: goldenPirates\n\n\nMore Golden releases here:         &lt;a href=&quot;\nhttp://thepiratebay.se/user/Goldenpirates&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Goldenpirates&lt;/a&gt;\nand here:         &lt;a href=&quot;\nhttp://blog.goldenpirates.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blog.goldenpirates.org/&lt;/a&gt;\n\nEnjoy! \n\nThis torrent contains one video, (split into several files), and three photosets.  \n\nPreviews and screenshots:\n &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?z3qo93gyr7nludpq5els90g40j2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?z3qo93gyr7nludpq5els90g40j2&lt;/a&gt;   cover &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?t0uyh9ohw1mjkakdppl64qvgw1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?t0uyh9ohw1mjkakdppl64qvgw1&lt;/a&gt;    face &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?7aiyepwr7jdas5f20w9z2hsj2nln&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?7aiyepwr7jdas5f20w9z2hsj2nln&lt;/a&gt;  breasts &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?f3cyuffaax6e3kmbyaplz32z2i0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?f3cyuffaax6e3kmbyaplz32z2i0&lt;/a&gt;   vagina &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?98aoanm522ebykq15bc2l1nlzpny&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?98aoanm522ebykq15bc2l1nlzpny&lt;/a&gt;  standing &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?597bio0xd6ojo1tf69ge5pd766p8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?597bio0xd6ojo1tf69ge5pd766p8&lt;/a&gt;  ass &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?aoz62uhlzdpk5w17qt5zmfq2dlok&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?aoz62uhlzdpk5w17qt5zmfq2dlok&lt;/a&gt;  vid 1 screens &lt;a href=&quot;\nhttp://media.goldenpirates.org/go.php?og0bgd8ra6fkbqw1twdfq8q97v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.goldenpirates.org/go.php?og0bgd8ra6fkbqw1twdfq8q97v&lt;/a&gt;    vid 1 storyboard\n\nThe video screenshots and storyboards are for only one file of each video.  Screenshots and storyboards for all video files are in the torrent.\n\nVideo descriptions from website:\n\nModel Comments: HEY FTV~ I'm Sensi and I just gotta say that FTV is by FAR the most fun I have EVER had on a photoshoot. First of all you guys have the best site and the photography is just gorgeous so I was so excited to be picked to be an FTV Girl but I didn't know the shoot was going to be soooo fun! First thing we did was get me all naked in public which is the first time I have ever done anything like that in my life and I can't believe how thrilling that was and also it made me HORNY too! Like, I can't believe I get paid for this - thats how fun shooting for FTV is, I love my life haha. OK so you guys have to check out my dressing room video where I take the video camera into a department store and show my pussy on camera while I try on cute dresses - this sure aint your normal porn video, I was nervous and excited when I got naked in front of the mirror I was so worried someone was gunna walk in :) Then I got to masturbate in a car which I LOVE - his whole shoot was just super fun and I even got to squirt on camera and I had like 6 orgasms all day long and oh yea and you get to see me doing my morning stretches fully nude which has gotta be hot and I slid some weird objects inside myself which made me incredibly wet just doing something like that on camera - this is the best job EVER! Love you FTV!\n\nContributing Photographer's Comments:  This girl was just a joy to work with she is very athletic and has been doing ballet for 13 years, she's just incredibly  flexible. We started out doing a 7AM photo shoot with great morning light and she proceeded to really impress me with her ballet and stretch positions. This girl has a serious ballet career if she chose to pursue that route, thats how good she is. But the best thing about Sensi is her fun personality and how professional and together she is. She calls and responds to texts and emails promptly, and she shows up on time. This is a model that seriously has her shit together and prides herself on taking the business of modeling like a real job. How refreshing that is in a business where so many girls are half-ass in their approach. Sensi shows up ready to work and she's got all her clothes neatly packed and her make-up tight, and her pussy is shaved and ready to go. And on the shoot this girl is a dream to work with, first of all she is genuinely horny as hell from early in the morning till after sunset, she loves to play with her pussy and was eager to explore different places to masturbate. I have rarely shot a model who can continuously have multiple orgasms on video with no problem whatsoever. Sensi can insert her fingers inside herself and bring herself to a massive g-spot orgasm in a matter of about 2 minutes or less. We went hiking in the hills but we weren't 100 yards and she was ready to have an orgasm...it only took her a minute or two and she was soaking the ground with her pussy juice and making a mud puddle! Then she did a great self-video in a dressing room, she came out of the store all excited and couldn't wait to watch the tape, this girl really loves her job haha...Sensi is just an all out horn-dog and as we drove around town looking for places to shoot she was masturbating non-stop, even when no cameras were rolling she fingered herself continuously. I can't believe the sex drive on this girl, I would say she was just born to fuck, except that she is also incredibly intelligent and athletic. She was a great conversationalist too, the girl really has a head on her shoulders. I would really enjoy just hanging out with Sensi even if she wasn't constantly playing with her cute little pussy, she's actually a very bright girl. Sensi could do just about anything if she chose to, and yet we are lucky enough to watch this hot little spinner fingering herself, stuffing large objects, and having massive squirting orgasms on video.. what can I say... the girl is a sexual super-freak.","torrent":{"xt":"urn:btih:09b9838c3257823a9c4f64d97bb0920c8590433d","amp;dn":"ftvgirls.com.2011-12.Sensi.XXX.%5BGoldenPirates%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09b9838c3257823a9c4f64d97bb0920c8590433d","infoHashBuffer":{"type":"Buffer","data":[9,185,131,140,50,87,130,58,156,79,100,217,123,176,146,12,133,144,67,61]},"announce":[],"urlList":[]}}