{"title":"Video Nasties - The Definitive Guide Documentary","uid":6937710,"size":1043173710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a37f34bb04750e0b6c66c0ba2783354fe0c1ae6&amp;dn=Video+Nasties+-+The+Definitive+Guide+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kat190191","files":-1,"time":1325885915,"description":"Prepare to be corrupted and depraved once more as Nucleus Films releases the definitive guide to the Video Nasties phenomenon - one of the most extraordinary and scandalous eras in the history of British film. For the first time ever on DVD, TRAILERS to all 72 films that fell foul of the Director of Public Prosecutions are featured with specially filmed intros for each title in a lavish three-disc collector s edition box-set, alongside a brand new documentary - VIDEO NASTIES: MORAL PANIC, CENSORSHIP AND VIDEOTAPE. Disc One presents the 39 titles which were successfully prosecuted in UK courts and deemed liable to deprave and corrupt. Disc Two presents the 33 titles that were initially banned, but then subsequently acquitted and removed from the DPP's list. Disc Three This era-defining documentary features interviews with filmmakers Ruggero Deodato ( Cannibal Holocaust ) Neil Marshall ( The Descent , Doomsday ), Christopher Smith ( Severance , Black Death ) and MP Graham Bright as well as rare archive footage featuring James Ferman (director of the BBFC 1975-1999) &amp; Mary Whitehouse. Taking in the explosion of home video, the erosion of civil liberties, the introduction of draconian censorship measures, hysterical press campaigns and the birth of many careers born in blood and videotape, West s documentary also reflects on the influence this peculiar era still exerts on us today.\n\nVideo Nasties - The Definitive Guide, I uploaded the synopsis from Amazon but if you've looked for this torrent then I'm guessing you already know what it's about. I uploaded this as I noticed it's nowhere to be found on torrents.\n\nPlease note that I haven't yet uploaded the 2 other discs from this set with the 72DPP original trailers and intro's, these will be uploaded very soon. \n\nEnjoy and Seed :)","torrent":{"xt":"urn:btih:0a37f34bb04750e0b6c66c0ba2783354fe0c1ae6","amp;dn":"Video+Nasties+-+The+Definitive+Guide+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a37f34bb04750e0b6c66c0ba2783354fe0c1ae6","infoHashBuffer":{"type":"Buffer","data":[10,55,243,75,176,71,80,224,182,198,108,11,162,120,51,84,254,12,26,230]},"announce":[],"urlList":[]}}