{"title":"Ellis Paul...The Day After Everything Changed(2010)[FLAC]","uid":6925925,"size":410212571,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0defa06d497aaf8a9119a32f163e405ab2611926&amp;dn=Ellis+Paul...The+Day+After+Everything+Changed%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":18,"time":1325498499,"description":"[img]http://image.allmusic.com/00/amg/cov200/drn300/n329/n32940k1n4t.jpg[/img]\n[color=Green]The Day After Everything Changed(2010) Black Wolfe RecordsBW0010[/color]\n\n[img][img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img][/img]\n\t1\t\tAnnalee\t-Paul\t4:10\n2\t\tRose Tattoo\t-Paul\t4:34\n\t3\t\tRiver Road\t-Bush, Paul\t3:39\n4\t\tThe Day After Everything Changed\t-Bush, Paul\t4:30\n\t5\t\tThe Lights of Vegas\t-Bush, Paul\t4:38\n\t6\t\tHurricane Angel\t-Paul\t4:38\n7\t\tHeaven's Wherever You Are\t-Paul\t3:00\n8\t\tDragonfly\t-Baker, Paul\t3:00\n9\t\tSometime, Someplace\t-Paul\t3:26\n10\t\tOnce Upon a Summertime\t-Bush, Paul\t4:05\n11\t\tWaking Up to Me\t-Paul\t4:52\n12\t\tWalking After Midnight/Change\t-Baker, Block, Hecht\t4:09\n13\t\tThe Cotton's Burning\t-Paul\t4:46\n14\t\tPaper Dolls\t-Bush, Paul\t4:25\n15\t\tNothing Left to Take\t-Paul\t4:07\n\nThe theme of Ellis Paul's album The Day After Everything Changed is contained in its title. In song after song, and from one song to another, his concern is about drastic changes that have taken place in the lives of his first-person characters, and those changes are always bad. The circumstances, and even the centuries, may vary: &quot;Hurricane Angel&quot; is about a victim of Hurricane Katrina, while &quot;The Cotton's Burning&quot; is sung by a Confederate officer at the close of the Civil War. But things always take a major turn for the worse. Sometimes that turn occurs during the silence between songs. The infatuated narrator of the lead-off track, &quot;Annalee,&quot; experiencing young love, seems to give way to the laid-off married man with babies to feed in the next song, &quot;Rose Tattoo,&quot; as if to say, these can be the consequences of desire. But if Paul has a big point to make, he isn't particularly original about the way he does so. In &quot;Rose Tattoo,&quot; he name-checks Van Morrison, and in &quot;River Road&quot; (one of five songs co-written with Sugarland's Kristian Bush), he paraphrases Bruce Springsteen's &quot;Thunder Road&quot;: &quot;Would you like to know how it feels?/To trade your wings in on some wheels.&quot; It's no crime to borrow from your influences; Springsteen himself does it occasionally. But if you do, it's probably not a good idea to put the purloined words in the chorus and repeat them, as Paul does. And although he doesn't otherwise steal chunks of material, his imagery (when it's not confined to the sun, the moon, angels, and heaven) suggests that he spends a lot of time listening to classic rock, as familiar terms like &quot;buckets of rain&quot; (Bob Dylan), &quot;flatbed Ford&quot; (Eagles), and &quot;long winding road&quot; (the Beatles) litter his lyrics. All this radio listening may take place in the car: ten of the album's 15 songs contain references to driving, highways, etc. The only specifically autobiographical tune may be &quot;Sometime, Someplace,&quot; with its barroom setting in which the narrator is addressed as &quot;Mr. Paul,&quot; but the singer/songwriter's peripatetic lifestyle seems to come out in all those mentions of the road. One, however, cannot be blamed on him as a songwriter. There is a medley of the old Patsy Cline hit &quot;Walking After Midnight&quot; (&quot;I walk for miles out on the highway&quot;) with Sam Baker's &quot;Change,&quot; the latter another statement about newly reduced circumstances. Unlike Paul, Baker is specific, his lines filled with original imagery and specific detail before the story concludes with a cutting irony. It's not a good sign when the best song on a singer/songwriter's album is one he didn't write himself, but &quot;Change&quot; gives Paul another articulation of the world view he espouses throughout this collection, that things are getting worse, much worse, and fast.\n\ncd ripped by EAC\n\n[img]http://www.hotimg.com/direct/CAWuxEb.gif[/img]\n[url] &lt;a href=&quot;\nhttp://dickthespic.org/2011/09/19/ellis-paul/[/url]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/09/19/ellis-paul/[/url]&lt;/a&gt;","torrent":{"xt":"urn:btih:0defa06d497aaf8a9119a32f163e405ab2611926","amp;dn":"Ellis+Paul...The+Day+After+Everything+Changed%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0defa06d497aaf8a9119a32f163e405ab2611926","infoHashBuffer":{"type":"Buffer","data":[13,239,160,109,73,122,175,138,145,25,163,47,22,62,64,90,178,97,25,38]},"announce":[],"urlList":[]}}