{"title":"DBZ_BT3[Wii][Multi5][Scrubbed]by_Manzon_4_PAATDL","uid":6993602,"size":6938347660,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:1075b666f97b06698ddbbccaa1b182efdd2aec22&amp;dn=DBZ_BT3%5BWii%5D%5BMulti5%5D%5BScrubbed%5Dby_Manzon_4_PAATDL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"paatdl","files":14,"time":1327786848,"description":"Dragon Ball Z: Budokai Tenkaichi 3\n\nBudokai Tenkaichi 3 cuenta con 100 personajes (161 con transformaciones), la mayor lista de personajes en cualquier juego de Dragon Ball Z, asÃƒÂ­ como una de las mÃƒÂ¡s grandes en cualquier juego de lucha. Ryo Mito afirmÃƒÂ³ una vez que el juego iba a presentar personajes nunca antes vistos exclusivamente para el juego, resultando al final personajes tan dispares como Neo Shenron y Hatchan. Gamestop ofrece una versiÃƒÂ³n exclusiva con un DVD bonus con las 10 mejores batallas de la series de televisiÃƒÂ³n votado por los aficionados en la fecha de publicaciÃƒÂ³n.\n\nVarios de los nuevos rasgos notables incluyen: repeticiÃƒÂ³n de batallas, escenarios de noche y dÃƒÂ­a, la capacidad en lÃƒÂ­nea de Wii y los discos de fusiÃƒÂ³n de PS2. La repeticiÃƒÂ³n de batalla permite a los jugadores captar sus peleas favoritas y guardarlas en el disco duro para verlas mÃƒÂ¡s adelante. Los escenarios de noche y dÃƒÂ­a permiten batallas mÃƒÂ¡s precisas en la historia de Dragon Ball, asÃƒÂ­ como la capacidad de transformarse, en Ã…Å’zaru mediante el uso de la Luna. TambiÃƒÂ©n hay varias diferencias de tiempo, como el amanecer y la tarde, no todos los escenarios proporcionan diferentes etapas del dÃƒÂ­a. La versiÃƒÂ³n de Wii tiene capacidad para jugar en online, el primer juego de la serie de tener tal caracterÃƒÂ­stica. Los jugadores pueden luchar contra cualquier persona de todo el mundo con un sistema de ranking que muestra la posiciÃƒÂ³n actual del jugador en comparaciÃƒÂ³n con cualquier otra persona. Como compensaciÃƒÂ³n por la falta de esta caracterÃƒÂ­stica, Spike ha aÃƒÂ±adido un nuevo &quot;Sistema de Disco FusiÃƒÂ³n&quot; a la versiÃƒÂ³n de PlayStation 2, insertando una copia de Budokai Tenkaichi o Budokai Tenkaichi 2, lo cual desbloquea Batalla definitiva y Batalla definitiva Z,1 modos que aparecen en los respectivos juegos necesarios para desbloquear.","torrent":{"xt":"urn:btih:1075b666f97b06698ddbbccaa1b182efdd2aec22","amp;dn":"DBZ_BT3%5BWii%5D%5BMulti5%5D%5BScrubbed%5Dby_Manzon_4_PAATDL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1075b666f97b06698ddbbccaa1b182efdd2aec22","infoHashBuffer":{"type":"Buffer","data":[16,117,182,102,249,123,6,105,141,219,188,202,161,177,130,239,221,42,236,34]},"announce":[],"urlList":[]}}