{"title":"Counting on Democracy [2004] Danny Schechter","uid":6962443,"size":292671085,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:111738dc81e1354b8039ebcdefc63b09806d5ddd&amp;dn=Counting+on+Democracy+%5B2004%5D+Danny+Schechter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1326807804,"description":" &lt;a href=&quot;http://bayimg.com/lalGBaaDp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lalGBaaDp&lt;/a&gt;\n\nCounting on Democracy [2004]\n\nThe 2000 United States presidential election in Florida took place on November 7, 2000 as part of the greater 2000 United States presidential election.\n\nFlorida, a swing state, had a major recount dispute that took center stage in the election. Thus, the outcome of the 2000 United States presidential election was not known for more than a month after balloting, because of the extended process of counting and then recounting of Florida presidential ballots. State results tallied on election night gave 246 electoral votes to Republican candidate George W. Bush and 255 to Democratic nominee Al Gore,\n\nEventually Bush was court appointed President of the United States, the fraud was never investigated, and placed the nation on the divisive path it has occupied since.\n\nThe story of what happened in Florida during the 2000 Bush-Gore presidential race plays like a drama in many acts. From election night, when the three networks erroneously called the state before the polls closed, to 36 days later when the Supreme Court made the highly controversial decision to halt the recount and call the election for George W. Bush, Americans were stunned by what they saw. \n\nBefore the fiasco in Florida, most Americans assumed that the votes they cast would be counted in accordance with one of the fundamental principles of American democracy, yet 175,000 votes cast in that state, largely by the working poor and people of color, were uncounted. \n\nCOUNTING ON DEMOCRACY asserts that a systematic pattern of behavior on the part of the state's various election boards, overseen by a compromised elections department, resulted in a myriad of lost votes. What emerges is a shocking but very clear picture of political interests cynically ignoring and overriding the will of voters.\n\nAs 1960s Civil Rights Leader Rep. John Lewis says in the film, &quot;People struggled, people died for the right to vote. And there are people saying we should forget about it, we shouldn't make too much of it. How can you sweep it under the rug like it didn't happen? It did happen.&quot; \n\nDirected by Danny Schechter\nProduced by Globalvision\nProduced by Faye M. Anderson and Danny Schechter\nWritten and reported by Faye M. Anderson\nNarrated by Ossie Davis and Ruby Dee\n","torrent":{"xt":"urn:btih:111738dc81e1354b8039ebcdefc63b09806d5ddd","amp;dn":"Counting+on+Democracy+%5B2004%5D+Danny+Schechter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111738dc81e1354b8039ebcdefc63b09806d5ddd","infoHashBuffer":{"type":"Buffer","data":[17,23,56,220,129,225,53,75,128,57,235,205,239,198,59,9,128,109,93,221]},"announce":[],"urlList":[]}}