{"title":"Stanley Kubrick and Me: Thirty Years at His Side","uid":16024684,"size":12400761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1197b364b53510c1d28b784a3d260b0fb3e91c4e&amp;dn=Stanley+Kubrick+and+Me%3A+Thirty+Years+at+His+Side&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476370511,"description":"Stanley Kubrick and Me: Thirty Years at His Side - Emilio D'Alessandro [epub]\r\n\r\nThis intimate portrait by his former personal assistant and confidante reveals the man behind the legendary filmmaker—for the first time.\r\n\r\nStanley Kubrick, the director of a string of timeless movies from Lolita and Dr. Strangelove to A Clockwork Orange, 2001: A Space Odyssey, Full Metal Jacket, and others, has always been depicted by the media as the Howard Hughes of filmmakers, a weird artist obsessed with his work and privacy to the point of madness. But who was he really? Emilio D'Alessandro lets us see. A former Formula Ford driver who was a minicab chauffeur in London during the Swinging Sixties, he took a job driving a giant phallus through the city that became his introduction to the director. Honest, reliable, and ready to take on any task, Emilio found his way into Kubrick's neurotic, obsessive heart. He became his personal assistant, his right-hand man and confidant, working for him from A Clockwork Orange until Kubrick's death in 1999.\r\n\r\nEmilio was the silent guy in the room when the script for The Shining was discussed. He still has the coat Jack Nicholson used in the movie. He was an extra on the set of Eyes Wide Shut, Kubrick's last movie. He knew all the actors and producers Kubrick worked with; he observed firsthand Kubrick's working methods down to the smallest detail. Making no claim of expertise in cinematography but with plenty of anecdotes, he offers a completely fresh perspective on the artist and a warm, affecting portrait of a generous, kind, caring man who was a perfectionist in work and life","torrent":{"xt":"urn:btih:1197b364b53510c1d28b784a3d260b0fb3e91c4e","amp;dn":"Stanley+Kubrick+and+Me%3A+Thirty+Years+at+His+Side","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1197b364b53510c1d28b784a3d260b0fb3e91c4e","infoHashBuffer":{"type":"Buffer","data":[17,151,179,100,181,53,16,193,210,139,120,74,61,38,11,15,179,233,28,78]},"announce":[],"urlList":[]}}