{"title":"The Column of Marcus Aurelius","uid":16024691,"size":12512028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12837b2127790609e51013aad625da2b72cf5e0c&amp;dn=The+Column+of+Marcus+Aurelius&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476370625,"description":"The Column of Marcus Aurelius: The Genesis and Meaning of a Roman Imperial Monument - Martin Beckmann [pdf]\r\n\r\nOne of the most important monuments of Imperial Rome and at the same time one of the most poorly understood, the Column of Marcus Aurelius has long stood in the shadow of the Column of Trajan. In The Column of Marcus Aurelius, Martin Beckmann makes a thorough study of the form, content, and meaning of this infrequently studied monument.\r\n\r\nBeckmann employs a new approach to the column, one that focuses on the process of its creation and construction, to uncover the cultural significance of the column to the Romans of the late second century A.D. Using clues from ancient sources and from the monument itself, this book traces the creative process step by step from the first decision to build the monument through the processes of planning and construction to the final carving of the column's relief decoration.\r\n\r\nThe conclusions challenge many of the widely held assumptions about the value of the column's 700-foot-long frieze as a historical source. By reconstructing the creative process of the column's sculpture, Beckmann opens up numerous new paths of analysis not only to the Column of Marcus Aurelius but also to Roman imperial art and architecture in general","torrent":{"xt":"urn:btih:12837b2127790609e51013aad625da2b72cf5e0c","amp;dn":"The+Column+of+Marcus+Aurelius","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12837b2127790609e51013aad625da2b72cf5e0c","infoHashBuffer":{"type":"Buffer","data":[18,131,123,33,39,121,6,9,229,16,19,170,214,37,218,43,114,207,94,12]},"announce":[],"urlList":[]}}