{"title":"New Zealand's Worst Disasters: True Stories that Rocked a Nation","uid":16024663,"size":25768029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14012d8f84c74d174857c83a38679a8c5e0ed2a2&amp;dn=New+Zealand%27s+Worst+Disasters%3A+True+Stories+that+Rocked+a+Nation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476369982,"description":"New Zealand's Worst Disasters: True stories that rocked a nation - Graham Hutchins, Russell Young [epub]\r\n\r\nA full train plunges into a raging river at Tangiwai; the Wahine is tossed onto rocks at the entrance to Wellington Harbour; an Air New Zealand DC-10 plunges into Mount Erebus on Antarctica; an earthquake destroys Christchurch … disasters like these are known to all New Zealanders: they are part of our history. But New Zealand has experienced many less well-known disasters, some of them shocking and brutal.\r\n\r\nGraham Hutchins and Russell Young describe some of the most extraordinary events in New Zealand history. Who knew that a fire killed 39 people at Seacliff Mental Hospital in 1942? That 10 people died in a lahar on White Island in 1914? That a yacht race between Lyttelton and Wellington in 1951 resulted in 10 fatalities? That a tornado ripped through 150 houses in Hamilton in 1948? A fire raging through Raetihi in 1918 was so fierce it destroyed houses, shops and 11 timber mills. Drownings were so common here in the 19th century that they were called ‘the New Zealand death’.\r\n\r\nThese and many other remarkable stories are told in this eye-opening book. While it describes accidents and tragedies, it also reveals acts of heroism. For when human beings make mistakes, others often achieve daring feats of rescue. Some of the stories show that we underestimate Mother Nature at our peril, but many also testify to the courage of the human spirit. Few books are genuine page-turners; this one is","torrent":{"xt":"urn:btih:14012d8f84c74d174857c83a38679a8c5e0ed2a2","amp;dn":"New+Zealand%27s+Worst+Disasters%3A+True+Stories+that+Rocked+a+Nation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14012d8f84c74d174857c83a38679a8c5e0ed2a2","infoHashBuffer":{"type":"Buffer","data":[20,1,45,143,132,199,77,23,72,87,200,58,56,103,154,140,94,14,210,162]},"announce":[],"urlList":[]}}