{"title":"Alex Jones Show - 2011 Dec 16 FR [sebaygo1]","uid":6893227,"size":65763930,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:14b94c911b1596c852404bcf6700cd9d0ffd7119&amp;dn=Alex+Jones+Show+-+2011+Dec+16+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":10,"time":1324093167,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nFriday, 16 December 2011\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn the Friday, December 16 edition the Alex Jones Show, Alex talks with James Lane and Chris Emery, the director and producer respectively of A Noble Lie: Oklahoma City 1995, a documentary that takes a fresh and in-depth look at the circumstances surrounding the 1995 Oklahoma City bombing and the government\\'s deeply-flawed investigation. \n\nNOTE :: Director/producer James Lane has requested that we wait at least until after April 19 to distribute via BitTorrent. He is trying to recoup costs for this film, and continue work on the next project.\n\nThe movie itself is outstanding, and you can order a copy at http://FreeMindFilms.com. The case it makes for prior knowledge is a slam dunk. It also has a lot of material not covered in other documentaries. \n\nFrom: James Lane, Wednesday, December 14, 2011 --\nWe think that this movie has the potential to\nreach main stream audiences. We are planning a national ad\ncampaign to run at that time. In addition this will give us\ntime to recoup our costs, which was 80% out of our own\npockets, and hopefully have enough for our next production.\nIf we can fund these movies ourselves then no one has any\ncontrol over our content.\n\nAlex also covers the latest news, including a run-down on last night\\'s Republican debate in Iowa, the increasing public (and U.S. armed forces) support of candidate Ron Paul as the Iowa caucus approaches, and other breaking news stories on the economy and the prospect of war.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent\\'s description, so I have included \nthe blog\\'s web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the \\&quot;big \n picture.\\&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you\\'ve researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter \\&quot;Nighted\\&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:14b94c911b1596c852404bcf6700cd9d0ffd7119","amp;dn":"Alex+Jones+Show+-+2011+Dec+16+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14b94c911b1596c852404bcf6700cd9d0ffd7119","infoHashBuffer":{"type":"Buffer","data":[20,185,76,145,27,21,150,200,82,64,75,207,103,0,205,157,15,253,113,25]},"announce":[],"urlList":[]}}