{"title":"Hidden Secrets - Part 173 - Revelation - Angels - Daniel - Heav","uid":15827946,"size":4085236850,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:150bcb679c199127b114f6a0396c07ac59464853&amp;dn=Hidden+Secrets+-+Part+173+-+Revelation+-+Angels+-+Daniel+-+Heav&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"POtHS11","files":108,"time":1473879413,"description":"Mission and Vision\r\nTurning Point Ministries was founded in 1982 as the broadcast ministry of Dr. David Jeremiah to deliver the unchanging Word of God to an ever-changing world. Three decades later, with a multimedia network featuring radio, television, and online programming, magazines, and books, Turning Point reaches tens of millions of people around the globe with the saving knowledge of Jesus Christ. With the potential reach of 480 million listeners, Dr. Jeremiah's radio messages air thousands of times each day, inspiring and equipping the body of Christ around the globe. And Momento Decisivo, the ministry's Spanish-language outreach, is aired more than 800 times a day on nearly 600 radio stations in every Spanish-speaking country in Central and South America. With its largest audience to date, Turning Point Television reaches a potential 2.5 billion households worldwide.\r\n\r\nTurning Point is a 501(c)3 nonprofit organization wholly supported by its patrons and not underwritten by any church or organization.\r\n\r\nTurning Point Radio\r\nTurning Point releases 37,381 airings of Dr. Jeremiah's daily radio program each week domestically and internationally. This is a staggering 1,943,812 programs broadcast through the airwaves each year. Turning Point is broadcast on more than 2,000 radio stations in the United States and throughout the world, including: Africa, Canada, the Far East, India, Mexico, the Philippines, Spain, the United Kingdom, and every Spanish speaking country in Central and South America.\r\n\r\nThe David Jeremiah Difference is reflected in Dr. Jeremiah's radio program as it is unique in Christian broadcasting for a variety of reasons: \r\n\r\n    Dr. Jeremiah sits behind the microphone and opens and closes each broadcast with personal insights and ministry updates","torrent":{"xt":"urn:btih:150bcb679c199127b114f6a0396c07ac59464853","amp;dn":"Hidden+Secrets+-+Part+173+-+Revelation+-+Angels+-+Daniel+-+Heav","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"150bcb679c199127b114f6a0396c07ac59464853","infoHashBuffer":{"type":"Buffer","data":[21,11,203,103,156,25,145,39,177,20,246,160,57,108,7,172,89,70,72,83]},"announce":[],"urlList":[]}}