{"title":"Victory in the Pacific (TV) [2005] PBS","uid":6960265,"size":1468613570,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:151e36ba4af4fca4473f69c676bd782a04695e1c&amp;dn=Victory+in+the+Pacific+%28TV%29+%5B2005%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ThorntonWilde","files":-1,"time":1326736540,"description":" &lt;a href=&quot;http://bayimg.com/MaLmMAADN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/MaLmMAADN&lt;/a&gt;\n\nThe American Experience  \n\nVictory in the Pacific\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0789800/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0789800/&lt;/a&gt;\n\nOriginal Air Date:May 2005 \n\nCommemorating the 60th anniversary of the end of World War II, American Experience presents Victory in the Pacific, a powerful documentary from producer Austin Hoyt (Reagan, MacArthur, Chicago: City of the Century). The two-hour program examines the final year of World War II in the Pacific, including the rationale for using the atomic bomb, and features the first-hand recollections of both American and Japanese civilians and soldiers -- even a kamikaze pilot who survived his failed mission. &quot;In the annals of warfare, the final year of the war in the Pacific stands alone,&quot; says Hoyt. &quot;It would be as brutal as war gets.&quot; Victory in the Pacific traces that fateful year, from the American capture of the Mariana Islands in the Central Pacific in July 1944 to the surrender broadcast of Emperor Hirohito in August 1945.\n\nThe Mariana Islands put Tokyo within range of the B-29 Superfortress, America's sophisticated new long-range bomber. After the firebombing of Tokyo on March 10, 1945, sixteen square miles of Tokyo lay in ruins, about one quarter of the city. &quot;When you kill 100,000 civilians, you cross some sort of moral divide,&quot; comments war historian Edward Drea. Conrad Crane, another war historian, adds, &quot;It's a lot easier to drop an atomic bomb that's going to kill fewer than that on Hiroshima.&quot;\n\nEven after the devastating firebombing, Japanese leaders did not yield. &quot;These men are watching Tokyo burn down around them, and it's having no effect on their position,&quot; says Richard Frank, author of Downfall, The End of the Imperial Japanese Empire. As Emperor Hirohito toured the destruction in Tokyo, the largest fleet ever assembled -- more than 40 carriers, 18 battleships, and 200 destroyers -- approached the Japanese island of Okinawa. Just 350 miles away from Japan's main islands, Okinawa would serve as a staging area for an invasion.\n\nThe battle of Okinawa is remembered as one of the most terrible in the history of warfare. The Japanese decimated American forces from hundreds of well-fortified and concealed caves in defensive lines that ran the width of the island. Wave after wave of kamikazes attacked the U.S. Navy that supported the siege, inflicting the worst Navy casualties of the war: 30 ships sunk and almost 10,000 troops killed or wounded. After 82 days U.S. Army and Marines had destroyed the last line of Japanese resistance on Okinawa, cave by cave. Victory in the Pacific looks at the terrible cost of the battle.\n\nMore than 70,000 Japanese soldiers and their Okinawan conscripts died trying to defend the island. More than 12,000 Americans died trying to capture it. President Harry S. Truman and his advisors realized that Okinawa was a glimpse of what an invasion of Japan would be like. A month after the battle, estimates of Japanese troops deployed to counter an invasion grew at an alarming rate. Says historian Edward Drea, &quot;It was very clear that the Japanese intended to fight to the bitter end.&quot;\n\nVictory in the Pacific sees the authorization to use the atomic bombs that devastated Hiroshima and Nagasaki in this context of fierce Japanese resistance to an invasion. It wasn't so much a &quot;decision,&quot; notes historian Barton Bernstein, an expert on the bomb, as &quot;the implementation of an assumption&quot; inherited from the Roosevelt administration. &quot;It was not a weighty matter,&quot; he adds. &quot;In the framework of mid-1945 no one around Truman had any sustained and serious doubts about using the bomb.&quot; &quot;There's no way that any American president, faced with the expenditures that had been put into the project, faced with the casualties in the Pacific, could not have used that bomb,&quot; states historian Conrad Crane.\n\nThe Potsdam Declaration, issued July 26, 1945, called on Japan to surrender unconditionally and without delay, or risk &quot;prompt and utter destruction.&quot; When the ultimatum arrived in Tokyo, Japan's prime minister, Admiral Kantaro Suzuki, said the government intended to ignore it. Japan's war cabinet only began to discuss the Potsdam Declaration after the Soviet Union entered the war on August 8, two days after an atomic bomb destroyed Hiroshima. The cabinet never considered &quot;unconditional surrender&quot; but debated whether there would be one of four conditions. &quot;They really lacked reality picture,&quot; comments Japanese historian Haruo Iguchi.\n\nVictory in the Pacific provides a rare glimpse of Japanese decision-making in the waning months of the war. Emperor Hirohito had to intervene twice to break deadlocks in his war cabinet. On August 14, President Truman received a message from the Japanese government that he deemed an unconditional surrender. In explaining his defeat, Hirohito wrote to his son, &quot;Our military placed too much weight on spirit and forgot about the science.&quot;\n\n&quot;Television often looks at the last year of the war as a series of separate stories - Okinawa, the kamikazes, the B-29s, the bomb,&quot; says American Experience executive producer Mark Samels. &quot;We wanted to tell a broader story that embraces them all -- how both sides tried to bring this terrible war to an end.&quot;\n\n","torrent":{"xt":"urn:btih:151e36ba4af4fca4473f69c676bd782a04695e1c","amp;dn":"Victory+in+the+Pacific+%28TV%29+%5B2005%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151e36ba4af4fca4473f69c676bd782a04695e1c","infoHashBuffer":{"type":"Buffer","data":[21,30,54,186,74,244,252,164,71,63,105,198,118,189,120,42,4,105,94,28]},"announce":[],"urlList":[]}}