{"title":"RED TAILS XVID cam GLOBE","uid":7006854,"size":1209219421,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15b568948ecb819551ed72eaa1476bca6b3aedfd&amp;dn=RED+TAILS+XVID+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1328296860,"description":"\n* XVID     * 01H57M51S    * + 1200 Bitrate    * Worked with the Dub plugins\n\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Intro :\n\nRed Tails is a 2012 war film directed by Anthony Hemingway from a screenplay by John Ridley and Aaron McGruder, with George Lucas serving as the executive producer. The film is inspired by the Tuskegee Airmen, a group of African American United States Army Air Force (USAAF) servicemen during World War II. Red Tails is the first Lucasfilm production since Radioland Murders (1994) not associated with the Indiana Jones or Star Wars franchises. The film stars Cuba Gooding, Jr. (who previously starred in The Tuskegee Airmen, an HBO made-for-television film about the same group of pilots) in his first theatrical film in five years,and Terrence Howard (who portrayed a Tuskegee pilot in Hart's War .\n\n\n\n* PLOT :\n\n\nIn 1944, after enduring racism throughout their recruitment and training in the Tuskegee training program, the 332nd Fighter Group of young African American USAAF fighter pilots are finally sent into combat in Italy, although flying worn-out Curtiss P-40 Warhawk aircraft. Chafing at their ground attack missions against trains and enemy ground transport, the Tuskegee Airmen recognize that they may never take on fighter-to-fighter action against the Luftwaffe. The tight-knit group of Joe &quot;Lightning&quot; Little (David Oyelowo), Martin &quot;Easy&quot; Julian (Nate Parker), Ray &quot;Ray Gun&quot; or &quot;Junior&quot; Gannon (Tristan Wilds), and Samuel &quot;Joker&quot; George (Elijah Kelley) under the guidance of Major Emanuel Stance (Cuba Gooding, Jr. ) and Col. A.J. Bullard (Terrence Howard), face a military bureaucracy still resistant to accepting black flyers as equals.\n\nA constant strife erupts between roommates and best friends, Easy and Lightning, who are battling their inner demons; Lightning is a hotheaded and reckless pilot who takes too many risks, while Easy is an alcoholic prone to self doubt. After returning to base from a mission, Lightning spies a pretty Italian girl named Sofia (Daniela Ruah), becomes instantly infatuated with her, and starts a relationship.\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *","torrent":{"xt":"urn:btih:15b568948ecb819551ed72eaa1476bca6b3aedfd","amp;dn":"RED+TAILS+XVID+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b568948ecb819551ed72eaa1476bca6b3aedfd","infoHashBuffer":{"type":"Buffer","data":[21,181,104,148,142,203,129,149,81,237,114,234,161,71,107,202,107,58,237,253]},"announce":[],"urlList":[]}}