{"title":"LOST_Season1_DVD5_(Retail)(MultiSub)(DVD9)","uid":6924470,"size":7305479680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:16631135f38f76424bd957083a30b224740acea1&amp;dn=LOST_Season1_DVD5_%28Retail%29%28MultiSub%29%28DVD9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pharaootje","files":-1,"time":1325377054,"description":"Lost Season 1 (DVD 5):\n\nCategorie: Beeld\nFormaat: DVD9\nBron: Retail\nStandaard: PAL\nAudio: English, German, French\nOndertiteling: English, French, German, Dutch, Norwegian, Danish, Swedish, Finnish.\nMenu: yes\nExtra's: Yes\nCover: Yes\n\n\nNederlands:\n\nDoor een vliegtuigcrash stranden de overlevenden van vlucht 815 van luchtvaartmaatschappij Oceanic op een \nschijnbaar verlaten tropisch eiland. De passagiers worden gedwongen samen te werken om te overleven op het \nmysterieuze eiland waar een monster in de jungle schijnt te leven, een metalen luik iets onbekend afsluit \nin de ondergrond en waar de zogenaamde &quot;anderen&quot; (de &quot;Others&quot;) schijnen te leven. Iedere aflevering vertelt \nmeer over de achtergrond van ÃƒÂ©ÃƒÂ©n van de mensen op het eiland aan de hand van flashbacks en toont waarom de \nverschillende personages zich op een bepaalde manier gedragen en hoe relaties zich ontwikkelen op het eiland, \nmet deze mysterieuze verschijnselen op de achtergrond.\n\n\n\nProductie: J.J. Abrams Ã‚Â· Jeffrey Lieber Ã‚Â· Damon Lindelof Ã‚Â· Carlton Cuse \nHoofdpersonages: Sayid Jarrah Ã‚Â· Claire Littleton Ã‚Â· Jack Shephard Ã‚Â· Hugo &quot;Hurley&quot; Reyes\n\t\t James &quot;Sawyer&quot; Ford Ã‚Â· Kwon Jin-soo Ã‚Â· Paik Sun-hwa Ã‚Â· Kate Austen Ã‚Â· John Locke\n\t\t Juliet Burke Ã‚Â· Benjamin Linus Ã‚Â· Danielle Rouseau Ã‚Â· Desmond Hume Ã‚Â· Charlotte Lewis\n\t\t Daniel Faraday Ã‚Â· Miles Straume Ã‚Â· Boone Carlyle Ã‚Â· Shannon Rutherford Ã‚Â· Mr. Eko Ã‚Â· Libby\n\t\t Ana LucÃƒÂ­a Cortez Ã‚Â· Charlie Pace Ã‚Â· Walt Lloyd Ã‚Â· Michael Dawson \nNevenpersonages: Tom Ã‚Â· Cindy Chandler Ã‚Â· Danny Pickett Ã‚Â· Rose Ã‚Â· Bernard Ã‚Â· Alex Ã‚Â· Ethan Rom\n\t\t Nikki Fernandez Ã‚Â· Paulo \nHoofdrollen: \t Naveen Andrews Ã‚Â· Nestor Carbonell Ã‚Â· Henry Ian Cusick Ã‚Â· Emilie de Ravin Ã‚Â· Michael Emerson\n\t\t Matthew Fox Ã‚Â· Jorge Garcia Ã‚Â· Josh Holloway Ã‚Â· Malcolm David Kelley Ã‚Â· Daniel Dae Kim\n\t\t Yunjin Kim Ã‚Â· Evangeline Lilly Ã‚Â· Elizabeth Mitchell Ã‚Â· Dominic Monaghan Ã‚Â· Terry O'Quinn\n\t\t Harold Perrineau Ã‚Â· Jeremy Davies Ã‚Â· Rebecca Mader Ã‚Â· Ken Leung \n\n\nDisk 5 (Seizoen 1)\n\n1-17 (17) &quot;... In Translation&quot; Jin Tucker Gates Javier Grillo-Marxuach &amp; Leonard Dick  23 februari 2005 \nOp een avond vat het vlot van Michael vlam. Ondanks de bluspogingen is het vlot te zwaar beschadigd. Iedereen verdenkt Jin ervan de brand te hebben aangestoken, en Sawyer en Michael vallen hem aan. Sun komt tussenbeide en onthult zo dat ze Engels spreekt. Jin weigert haar nog langer aan te kijken, omdat ze hem in het openbaar heeft vernederd. Hij wil niet langer bij Sun blijven, en helpt Michael met de bouw van een nieuw vlot om zo snel mogelijk te kunnen vertrekken.  \n\n1-18 (18) &quot;Numbers&quot; Hurley Dan Attias Brent Fletcher &amp; David Fury  2 maart 2005 \nHurley heeft vroeger de loterij gewonnen met de nummers 4, 8, 15, 16, 23 en 42, maar eigenlijk zijn het eerder ongeluksnummers voor de mensen om hem heen. Hij ontdekt dat de nummers ook in de papieren van Rousseau voorkomen. Hij confronteert haar hiermee, en vraagt hoe zij aan de nummers komt. Aan het einde van de aflevering blijkt dat diezelfde reeks nummers ook op het luik dat Boone en Locke hebben gevonden staan.  \n\n1-19 (19) &quot;Deus Ex Machina&quot; Locke Robert Mandel Carlton Cuse &amp; Damon Lindelof  30 maart 2005 \nBoone verliest de hoop het luik ooit nog open te krijgen, maar John wacht en krijgt een teken van het eiland. Hij droomt van een vliegtuig dat neerstort, en wanneer ze dat de volgende dag op de rand van een klif vinden klimt Boone aan boord. Het vliegtuig zit volgeladen met heroÃƒÂ¯ne, maar Boone vindt wel een werkende radio. Hij krijgt heel even contact, maar door zijn gewicht stort het vliegtuig van de klif af. Boone raakt zwaargewond. John draagt Boone naar het kamp, maar verdwijnt daarna in de jungle.  \n\n1-20 (20) &quot;Do No Harm&quot; Jack Stephen Williams Janet Tamaro  6 april 2005 \nJack probeert Boones leven te redden, en stuurt Kate naar Sawyer om alcohol te halen voor het ontsmetten van de wonden. Onderweg komt Kate Claire tegen, die op het punt staat om te bevallen. Jack, die inmiddels met een bloedtransfusie voor Boone bezig is, zegt Kate dat zij de baby ter wereld moet brengen. Met de nodige moeite weet ze Claires zoontje ter wereld te brengen. Jack maakt ondertussen aanstalten om Boones been te amputeren, maar Boone vraagt Jack om hem rustig te laten sterven. Vlak voor zijn dood onthult hij nog dat Locke en hij een luik hebben gevonden.  \n","torrent":{"xt":"urn:btih:16631135f38f76424bd957083a30b224740acea1","amp;dn":"LOST_Season1_DVD5_%28Retail%29%28MultiSub%29%28DVD9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16631135f38f76424bd957083a30b224740acea1","infoHashBuffer":{"type":"Buffer","data":[22,99,17,53,243,143,118,66,75,217,87,8,58,48,178,36,116,10,206,161]},"announce":[],"urlList":[]}}