{"title":"Oswald's Ghost (TV) [2008] Robert Stone","uid":6961319,"size":726763526,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:17d487f51920a70a96b33eb2936f93b5214dc3d0&amp;dn=Oswald%5C%27s+Ghost+%28TV%29+%5B2008%5D+Robert+Stone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1326767748,"description":" &lt;a href=&quot;http://bayimg.com/GaLcAaADn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GaLcAaADn&lt;/a&gt;\n\nThe American Experience\n  \nOswald's Ghost  \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1333676/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1333676/&lt;/a&gt;\n\nOriginal Air Date:14 January 2008 \n\nIn Oswald's Ghost, acclaimed director Robert Stone (Guerrilla: The Taking of Patty Hearst, Radio Bikini) offers an unprecedented deconstruction of the assassination of President John F. Kennedy, uncovering how this single event forever changed the face of American culture and why it continues to plague the nation's psyche.\n\nThe 90-minute film features interviews with authors Norman Mailer and Edward J. Epstein, politician Gary Hart, news anchor Dan Rather, activist Tom Hayden, attorney Mark Lane, and others. Using a wealth of archival material, much of it never before publicly seen or heard, Stone chronicles America's forty-year obsession with the pivotal event of a generation. Quietly implicit throughout the film is a haunting parallel to 9/11 and its aftermath.\n\n&quot;The Kennedy assassination was a kind of tectonic shift, and we knew it at the time,&quot; says Josiah Thompson in the film. Former student activist Tom Hayden adds, &quot;We thought that we could change the world. This is the key thing that I think ended, for me certainly, with the murder of Kennedy.&quot;\n\nMore than forty years after Kennedy's death, seventy percent of Americans continue to believe that the 46-year-old president's murder was the result of a conspiracy. Did Lee Harvey Oswald, a twenty-four-year-old former Marine and communist sympathizer, act alone? Was he influenced by Cuban dictator Fidel Castro or a rogue element of the CIA? Did the KGB or the Russian government order the killing? &quot;How could someone as inconsequential as Lee Harvey Oswald have killed someone as consequential as John F. Kennedy?&quot; asks historian Robert Dallek in the film. It is that seemingly unanswerable question that continues to haunt us.\n\nIn the mid-1960s and beyond, the Vietnam War and the Kennedy assassination merged in some Americans' minds, becoming a vast wellspring of mistrust and disillusionment. Following the assassinations of civil rights leader Martin Luther King, Jr. and Senator and presidential candidate Robert Kennedy in 1968 and the revelations of President Richard Nixon's constitutional subversion in the Watergate crisis in the early 1970s, American idealism was weakened further. A decade after Kennedy's death, America's political culture was changed almost beyond recognition.\n\n&quot;This is a film about how we absorbed and responded to the trauma and shock of being inexplicably -- and repeatedly -- robbed of our senses of idealism, optimism and security,&quot; says Stone. &quot;In the past six years, we've watched a new generation of Americans experience that same trauma.&quot; While there may never be a last word on the Kennedy assassination, Oswald's Ghost is as close to a definitive account as has ever been made of what the assassination did to America.\n\n","torrent":{"xt":"urn:btih:17d487f51920a70a96b33eb2936f93b5214dc3d0","amp;dn":"Oswald%5C%27s+Ghost+%28TV%29+%5B2008%5D+Robert+Stone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d487f51920a70a96b33eb2936f93b5214dc3d0","infoHashBuffer":{"type":"Buffer","data":[23,212,135,245,25,32,167,10,150,179,62,178,147,111,147,181,33,77,195,208]},"announce":[],"urlList":[]}}