{"title":"Aida 10x07 DVB Spanish by tony","uid":6883073,"size":676526324,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:18ef2bbef785fc13b7be04646a0c49b0fe536355&amp;dn=Aida+10x07+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carambolas","files":3,"time":1323716478,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n                                                    &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nDespuÃƒÂ©s de un par de aÃƒÂ±os La actriz Carmen Machi volverÃƒÂ¡ a Telecinco para participar en varios capÃƒÂ­tulos de la prÃƒÂ³xima temporada de la serie. En las nuevas tramas, la matriarca del clan de los GarcÃƒÂ­a obtendrÃƒÂ¡ la libertad condicional y regresarÃƒÂ¡ a casa con ganas de recuperar el tiempo perdido.\nYa han pasado dos aÃƒÂ±os desde que AÃƒÂ­da matara accidentalmente a su yerno tras descubrir que maltrataba a su hija Soraya. Esposada y en coche patrulla, AÃƒÂ­da abandonÃƒÂ³ Esperanza Sur para cumplir condena por homicidio el 13 de enero de 2009, fecha de emisiÃƒÂ³n del ÃƒÂºltimo episodio en el que participÃƒÂ³ Carmen Machi.\nCasi 70 capÃƒÂ­tulos despuÃƒÂ©s, la actriz volverÃƒÂ¡ a ponerse en la piel del personaje que da tÃƒÂ­tulo a la serie y participarÃƒÂ¡ en varios episodios de la prÃƒÂ³xima temporada. La colaboraciÃƒÂ³n de Carmen Machi en 'AÃƒÂ­da', que empezarÃƒÂ¡ a grabarse a partir del prÃƒÂ³ximo lunes 11 de abril, supondrÃƒÂ¡ el regreso a la televisiÃƒÂ³n de una de las actrices mÃƒÂ¡s queridas de la televisiÃƒÂ³n y un regalo para los fans de la comedia que Telecinco produce en colaboraciÃƒÂ³n con Globomedia.\nQue tiemble Esperanza Sur: vuelve AÃƒÂ­da\nUna noticia puede cambiar la vida de una persona, de una familia y hasta incluso de un barrio entero. Esto es lo que le sucede a la familia de AÃƒÂ­da y a sus amigos de Esperanza Sur cuando la matriarca de los GarcÃƒÂ­a anuncia que vuelve a casa despuÃƒÂ©s de que le hayan concedido la libertad condicional.\nÃ‚Â¿CÃƒÂ³mo afectarÃƒÂ¡ al barrio este inesperado regreso? La vida de sus amigos y familiares ha cambiado mucho desde que ella se fue: Chema, con el que en su dÃƒÂ­a mantuvo un romance, ahora es su yerno; su amiga Paz ya no es una perdedora, sino una mujer felizmente casada con un atractivo piloto; a Luisma le ha dado tiempo a reconciliarse con Paz, estar a punto de casarse con ella y hasta a volverse a enamorar; Lore ha saboreado las mieles del ÃƒÂ©xito y del fracaso a partes iguales...\nÃ‚Â¿CÃƒÂ³mo afrontarÃƒÂ¡ todos estos cambios AÃƒÂ­da? Ã‚Â¿ConseguirÃƒÂ¡ ablandar el agrio carÃƒÂ¡cter de Eugenia? Ã‚Â¿CambiarÃƒÂ¡ su relaciÃƒÂ³n con Chema, ahora que es el novio de su hija? Todas estas cuestiones y alguna mÃƒÂ¡s encontrarÃƒÂ¡n respuesta en los nuevos capÃƒÂ­tulos de la serie.","torrent":{"xt":"urn:btih:18ef2bbef785fc13b7be04646a0c49b0fe536355","amp;dn":"Aida+10x07+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18ef2bbef785fc13b7be04646a0c49b0fe536355","infoHashBuffer":{"type":"Buffer","data":[24,239,43,190,247,133,252,19,183,190,4,100,106,12,73,176,254,83,99,85]},"announce":[],"urlList":[]}}