{"title":"LOST_Season2_DVD3_(Retail)(MultiSub)(DVD9)","uid":6928047,"size":7041223421,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:191d680a077aea363fed108b80c63195025724f9&amp;dn=LOST_Season2_DVD3_%28Retail%29%28MultiSub%29%28DVD9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pharaootje","files":-1,"time":1325582578,"description":"Lost Season 2 (DVD 3):\n\nCategorie: Beeld\nFormaat: DVD9\nBron: Retail\nStandaard: PAL\nAudio: English, Spanish, French\nOndertiteling: English, Spanish, French, Dutch, Norwegian, Danish, Swedish, Finnish, Icelandic\nMenu: yes\nExtra's: Yes\nCovers: Yes\n\n\nNederlands:\n\nVerscheidene nieuwe personages, zoals Ana-Lucia Cortez, Libby en de Afrikaanse Mr. Eko doen hun intrede wanneer blijkt dat er op een andere plaats op het eiland eveneens overlevenden zijn uit het staartgedeelte van het vliegtuig. Ook het Dharma-initiatief (The Dharma Initiative) en de financierder The Hanso Foundation doen hun intrede. Zij zouden verantwoordelijk kunnen zijn voor de mysterieuze gebeurtenissen op het eiland. In ÃƒÂ©ÃƒÂ©n van de bunkers van 'The Dharma Initiative' vinden zij een film waarin uitleg wordt gegeven wat ze moeten doen om 'de wereld te redden'. Mr.Eko vindt nog een stukje film dat ertussenuit is geknipt waarin de losties zien dat ze met de computer niet mogen communiceren met de buitenwereld. John Locke begint te twijfelen over de knop waar ze om de 108 minuten op moesten drukken na het intikken van een code. Aan het einde van het seizoen drukt hij de knop niet in en ontstaat er een magnetisch veld door de overbelaste elektromagneet, die om de 108 minuten ontladen moet worden. De bunker implodeert waarbij de lucht paars wordt en de hele bunker wordt vernield.\n\n\n\nProductie: J.J. Abrams Ã‚Â· Jeffrey Lieber Ã‚Â· Damon Lindelof Ã‚Â· Carlton Cuse \nHoofdpersonages: Sayid Jarrah Ã‚Â· Claire Littleton Ã‚Â· Jack Shephard Ã‚Â· Hugo &quot;Hurley&quot; Reyes\n\t\t James &quot;Sawyer&quot; Ford Ã‚Â· Kwon Jin-soo Ã‚Â· Paik Sun-hwa Ã‚Â· Kate Austen Ã‚Â· John Locke\n\t\t Juliet Burke Ã‚Â· Benjamin Linus Ã‚Â· Danielle Rouseau Ã‚Â· Desmond Hume Ã‚Â· Charlotte Lewis\n\t\t Daniel Faraday Ã‚Â· Miles Straume Ã‚Â· Boone Carlyle Ã‚Â· Shannon Rutherford Ã‚Â· Mr. Eko Ã‚Â· Libby\n\t\t Ana LucÃƒÂ­a Cortez Ã‚Â· Charlie Pace Ã‚Â· Walt Lloyd Ã‚Â· Michael Dawson \nNevenpersonages: Tom Ã‚Â· Cindy Chandler Ã‚Â· Danny Pickett Ã‚Â· Rose Ã‚Â· Bernard Ã‚Â· Alex Ã‚Â· Ethan Rom\n\t\t Nikki Fernandez Ã‚Â· Paulo \nHoofdrollen: \t Naveen Andrews Ã‚Â· Nestor Carbonell Ã‚Â· Henry Ian Cusick Ã‚Â· Emilie de Ravin Ã‚Â· Michael Emerson\n\t\t Matthew Fox Ã‚Â· Jorge Garcia Ã‚Â· Josh Holloway Ã‚Â· Malcolm David Kelley Ã‚Â· Daniel Dae Kim\n\t\t Yunjin Kim Ã‚Â· Evangeline Lilly Ã‚Â· Elizabeth Mitchell Ã‚Â· Dominic Monaghan Ã‚Â· Terry O'Quinn\n\t\t Harold Perrineau Ã‚Â· Jeremy Davies Ã‚Â· Rebecca Mader Ã‚Â· Ken Leung \n\n\nDisk 3 (Seizoen 2)\n\n2-09 (34) &quot;What Kate Did&quot; Kate Paul Edwards Steven Maeda &amp; Craig Wright  30 november 2005 \nHier weten we eindelijk wat Kate gedaan heeft. Ze heeft haar vader Wayne vermoord, door zijn huis op te blazen. Op het eiland is Sawyer nog altijd zwaargewond. Kate zorgt 24 uur voor hem en wanneer ze even weg is, vertelt Sawyer Jack dat hij van Kate houdt. Jack reageert hier ontgoocheld op. Wanneer Kate terugkeert en dicht bij Sawyer kruipt, springt Sawyer opeens op en vraagt haar, waarom hij haar heeft vermoord. Daarna grijpt hij naar haar keel. Kate kan uit de wurggreep ontsnappen en ze verlaat de bunker. Wanneer Jack en John terugkomen van de begrafenis van Shannon vindt Jack Sawyer op de grond. Hij besluit Kate te gaan zoeken en wanneer hij de verwarde Kate terugvindt in de jungle, confronteert hij haar met haar verleden. Nadat Kate uithuilt bij Jack, kust ze hem en vlucht weg. Later gaat ze weer op ziekenbezoek bij Sawyer en zoekt ze een verklaring voor die wurggreep. Ze praat tegen de bewusteloze Sawyer net alsof hij Wayne is. Nadat ze haar verhaal heeft gedaan, ontwaakt Sawyer. In deze aflevering staat Kate centraal.  \n\n2-10 (35) &quot;The 23rd Psalm&quot; Mr. Eko Matt Earl Beesley Carlton Cuse &amp; Damon Lindelof  11 januari 2006 \nIn deze aflevering wordt het achtergrondverhaal van Mr. Eko verteld. De Afrikaanse Mr. Eko bleek zich als kindsoldaat aangesloten te hebben bij een rebellenleger en groeide later op tot een geducht crimineel. Het blijkt dat Mr. Eko samen met zijn handlangers drugs wilde smokkelen in Mariabeeldjes (net zulke beeldjes als Locke en Boone in het eerste seizoen vonden). Wanneer een drugsvlucht van Nigeria naar Amerika fout afloopt en hierbij zijn broer (een priester), die hem wilde redden, op het vliegtuig belandt dat nooit meer teruggezien wordt, komt hij tot inkeer en wordt gelovig. \nOok komt Claire achter het feit, dat Charlie wist van de heroÃƒÂ¯ne in de Mariabeeldjes en Michael wordt weer gecontacteerd door Walt via de computer in de ondergrondse ruimte achter het luik.\n\nWanneer Charlie Mr. Eko naar het Nigeriaans vliegtuigje brengt en terwijl Charlie in een boom klimt, komt Mr. Eko oog in oog te staan met het mysterieuze monster. Deze scÃƒÂ¨ne levert het eerste duidelijke beeld van het monster: het is een zwarte rook die ook reeds gedeeltelijk getoond werd in Exodus (de laatste afleveringen van seizoen 1).  \n\n2-11 (36) &quot;The Hunting Party&quot; Jack Stephen Williams Elizabeth Sarnoff &amp; Christina M. Kim  18 januari 2006 \nMichael heeft besloten achter zijn zoon Walt aan te gaan nadat hij contact met hem gemaakt heeft via de computer in de ondergrondse bunker. Jack, John en Sawyer besluiten achter hem aan te gaan. Ook Kate wil meegaan, maar Jack verbiedt haar mee te gaan. Na een lange, zware tocht waar Jack, John en Sawyer verschillende conflicten hebben, ontmoeten ze de &quot;Others&quot;. Sawyer herkent de man die hem geschoten heeft. De &quot;Others&quot; vragen aan Jack, John en Sawyer om rustig terug te keren, maar Jack weigert. Hij wil het conflict aangaan, maar hij moet van gedachten veranderen, wanneer de &quot;Others&quot; Jack tot een voorstel dwingen. Blijkbaar had Kate Jack, John en Sawyer toch gevolgd en viel ze in de handen van de &quot;Others&quot;. Jack kan niet anders dan terugkeren, om zo het leven van Kate te redden. Toch is hij boos op haar en dat laat hij ook merken. Kate voelt zich schuldig en probeert het uit te leggen aan Jack, maar hij negeert haar. Waarschijnlijk neemt hij het haar kwalijk dat ze hem heeft gekust en daarna niet meer met hem heeft gepraat en dan flirt met Sawyer. Op het einde van de aflevering vraagt Jack aan Ana-Lucia, hoe lang het zou duren om een leger te trainen. We zien flashbacks van Jack. We weten nu eindelijk waarom hij gescheiden is. Zijn vrouw Sarah had een ander, maar ook Jack had een andere vrouw gekust.  \n\n2-12 (37) &quot;Fire+Water&quot; Charlie Jack Bender Edward Kitsis &amp; Adam Horowitz  25 januari 2006 \nCharlie heeft het moeilijk met het feit, dat hij niet meer bij Claire of Aaron kan zijn. Hij droomt dat Aaron in gevaar is en wil alles doen om hem te beschermen. Toch verklaart iedereen hem gek, tot hij praat met Eko. Die vertelt hem dat Aaron gedoopt moet worden. Charlie krijgt het ook weer moeilijk, wanneer hij de Mariabeeldjes binnen handbereik ziet. Hij blikt terug op het drugsgebruik van zijn broer en hoe dit Driveshaft heeft beÃƒÂ¯nvloed. Hurley doet een toenaderingspoging tot Libby.  \n  ","torrent":{"xt":"urn:btih:191d680a077aea363fed108b80c63195025724f9","amp;dn":"LOST_Season2_DVD3_%28Retail%29%28MultiSub%29%28DVD9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"191d680a077aea363fed108b80c63195025724f9","infoHashBuffer":{"type":"Buffer","data":[25,29,104,10,7,122,234,54,63,237,16,139,128,198,49,149,2,87,36,249]},"announce":[],"urlList":[]}}