{"title":"Saints &amp; Angles (2008)","uid":6992199,"size":370624200,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1bb48c8d1c5d51bf0769231ac1c13dbdc001fa8c&amp;dn=Saints+%26amp%3B+Angles+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kingx","files":1,"time":1327748796,"description":"Florida filmmaker focuses on individuals who take direct action to save animals.\n\n&quot;Saints and Angels&quot; is a compelling fictional account of an Animal Liberation cell that has been organized for one evening in order to free animals from the daily tortures of experimentation and other forms of cruelty. Actual interviews and animal liberation footage make this a great introduction to the ALF and the entire movement in general.\n\nLabeled as the &quot;#1 domestic terrorist threat&quot; by the F.B.I. --- and freedom fighters by the animal rights community --- the Animal Liberation Front's aim is to free as many animals as possible from places of abuse.\n\nAnimal rights activist and filmmaker, Scott Cardinal, takes a look at the methods used by a clandestine ALF cell in the U.S.A. to carry out anonymous raids on university laboratories, factory farms, and puppy mills in order to place animals in safe homes where they can live free from unnecessary suffering.\n\n&quot;I wanted to make a film that showed animal rights activists as the non-violent action heroes that they truly are,&quot; stated Scott Cardinal, the film's producer, director and editor. &quot;Just because they wear Army fatigues and Ski-Masks doesn't mean they're not the good guys.&quot;\n\nThrough the extensive use of monologues and dialogue, Writer / Director Scott Cardinal reveals the hearts and souls and motivations of men and women who courageously choose to break man made laws in order to\nsave animals' lives and expose cruelty and abuse.\n\nCampfire Flix was founded in 2007 and is dedicated to bringing animal abuse and liberation issues to mainstream media.","torrent":{"xt":"urn:btih:1bb48c8d1c5d51bf0769231ac1c13dbdc001fa8c","amp;dn":"Saints+%26amp%3B+Angles+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bb48c8d1c5d51bf0769231ac1c13dbdc001fa8c","infoHashBuffer":{"type":"Buffer","data":[27,180,140,141,28,93,81,191,7,105,35,26,193,193,61,189,192,1,250,140]},"announce":[],"urlList":[]}}