{"title":"Herman Finkers EHBO is mijn lust en mijn leven (avi)","uid":6929330,"size":3571142312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c7d87603dba6d54f130c4e9c412b7ce1fc4c050&amp;dn=Herman+Finkers+EHBO+is+mijn+lust+en+mijn+leven+%28avi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bolsward1","files":1,"time":1325605506,"description":"EHBO, is mij lust en mijn leven' Een stoplicht springt op rood, een ander weer op groen: in Almelo is altijd wat te doen'. een van de meest bekende uitspraken van Herman Finkers. Herman Finkers houdt zich sinds 1979 bezig met het bedenken en uitvoeren van theaterprogramma's. Zijn programma's laten zich moeilijk omschrijven. Het best werd hij waarschijnlijk omschreven in het Utrechts Nieuwsblad: 'meester van de dubbele clou''geestige overdaad die niet schaadt', 'subliem slap gelul' EHBO is mijn lust en mijn leven is het vierde programma van Herman Finkers, opgenomen in de Leidse Schouwburg. (1985 )\n\nIk ben mij er eentje - Het kindercircus - Het EHBO-lied - Een ratelapparaat en een lotusmedewerker - Geluk - Columbus en MacJansen - Te veel vertering - De pianist - De slijmbal ( niemand kan zo teder zingen ) - De Canadezen - Sexualiteit - Live en playback - De elfstedentocht - De dichter ( toefje voor de kop) - Achter het ijzeren gordijn - Daar krijgt het A.N.P. moeilijkheden mee - Minimal painting - Ik ga te gek op je groeiproces - Oud en Nieuw\n\nDe file is avi!\n\nveel plezier er mee! Vergeet niet te seeden!\n\n\nMvg,\n\nBolsward1.","torrent":{"xt":"urn:btih:1c7d87603dba6d54f130c4e9c412b7ce1fc4c050","amp;dn":"Herman+Finkers+EHBO+is+mijn+lust+en+mijn+leven+%28avi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c7d87603dba6d54f130c4e9c412b7ce1fc4c050","infoHashBuffer":{"type":"Buffer","data":[28,125,135,96,61,186,109,84,241,48,196,233,196,18,183,206,31,196,192,80]},"announce":[],"urlList":[]}}