{"title":"Childhood Leukemia: A Guide {BBS}","uid":6926258,"size":5228506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cf1c238ee22de91a14dcbb8dc14ce84b5a9b63d&amp;dn=Childhood+Leukemia%3A+A+Guide+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1325513282,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ /                                                          \n\n***************************************************************************\n\nThis most complete parent guide covers not only detailed and precise medical information about leukemia and the various treatment options, but also day-to-day practical advice on how to cope with procedures, hospitalization, family and friends, school, social and financial issues, communication, feelings, and, if therapy is not successful, the difficult issues of death and bereavement. Woven among the medical details and the practical advice are the voices of parents and children who have lived with leukemia and its treatments. As many parents have already found, advice from &quot;veteran&quot; parents can be a lifeline.\n\nObtaining a basic understanding of topics such as medical terminology, how drugs work, common side effects of chemotherapy, and how to work more effectively with medical personnel can only improve the quality of life for the whole family suffering along with their leukemic child. Having parents describe their own emotional ups and downs, how they coped, and how they molded their family life around hospitalizations can be a tremendous comfort. Just knowing that there are other kids on chemotherapy who refuse to eat anything but tacos or who have frequent rages can make one feel less alone.\n\nParents who read this book will encounter medical facts simply explained, advice to ease their daily life, and tools to be a strong advocate for their child. This third edition contains significant updates to the information on treatments, chemotherapy drugs, bone marrow transplants, coping with side effects, and resources. It also contains a personal treatment summary and long-term follow-up guide for your child to keep as a permanent record.\n\n\n# Paperback: 505 pages\n# Publisher: Patient Centered Guides; Third Edition edition (May 15, 2002)\n# Language: English\n# ISBN-10: 0596500157\n# ISBN-13: 978-0596500153","torrent":{"xt":"urn:btih:1cf1c238ee22de91a14dcbb8dc14ce84b5a9b63d","amp;dn":"Childhood+Leukemia%3A+A+Guide+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf1c238ee22de91a14dcbb8dc14ce84b5a9b63d","infoHashBuffer":{"type":"Buffer","data":[28,241,194,56,238,34,222,145,161,77,203,184,220,20,206,132,181,169,182,61]},"announce":[],"urlList":[]}}