{"title":"The Bible Series - Bob Hoekstra - Counseling Gods Way","uid":15992624,"size":4605499894,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e258bf4a7faa4a38a4c28fd6795b44b683f7978&amp;dn=The+Bible+Series+-+Bob+Hoekstra+-+Counseling+Gods+Way&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":17,"time":1476033356,"description":"The Bible Series - Bob Hoekstra - Counseling Gods Way\r\n\r\n\r\n &quot;Counseling God's way is more than a catchy phrase. It's a commitment to take the Scriptures seriously and to help God's people apply His truth to their personal lives in practical ways.&quot;\r\n\r\n\r\nCounseling God's Way is as different from psychological counseling as light is from darkness. You see, genuine Biblical counseling doesn't merely sprinkle a few Bible verses here and there to make the counseling appear Bible-centered. In contrast to psychologically-integrated systems, Biblical counseling seeks to carefully discover those areas in which a Christian may be disobedient to the principles and commands of Scripture and to help him learn how to lovingly submit to God's will.\r\n \r\nIn contrast to the false stereotypes of Biblical counseling, effective Biblical counselors do not automatically diagnose a counselee's problems as flagrant and willful rebellion and prescribe a couple of verses with the promise of instant healing. On the other hand, a genuine Biblical counselor does not assume that every problem is biologically caused, requiring years of intensive psychotherapy and psychotropic drugs.\r\n\r\nWhile recognizing that many problems of thinking and behavior are physically caused, Biblical counselors recognize that many physical symptoms are generated by wrong patterns of thinking and action.\r\n\r\nBiblical counselors take Colossians 1:28 seriously, presenting Christ without shame, lovingly confronting sin, and teaching Biblical principles in order to produce maturity in the life of the counselee.\r\n\r\nPsychological counseling, on the other hand, is based on &quot;hollow and deceptive philosophy, which depends on human tradition and the basic principles of this world rather than on Christ,&quot; (Colossians 2:8). That's why Paul warns, &quot;See to it that no one takes you captive&quot; through such empty concepts","torrent":{"xt":"urn:btih:1e258bf4a7faa4a38a4c28fd6795b44b683f7978","amp;dn":"The+Bible+Series+-+Bob+Hoekstra+-+Counseling+Gods+Way","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e258bf4a7faa4a38a4c28fd6795b44b683f7978","infoHashBuffer":{"type":"Buffer","data":[30,37,139,244,167,250,164,163,138,76,40,253,103,149,180,75,104,63,121,120]},"announce":[],"urlList":[]}}