{"title":"Reeds Ocean Handbook (gnv64)","uid":15899677,"size":20328880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f7b9a13324f6c08af9414a86b0cf12a259ddb5d&amp;dn=Reeds+Ocean+Handbook+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gnv65","files":5,"time":1474994931,"description":"Reeds Ocean Handbook\r\nby Bill Johnson\r\nAdlard Coles | December 2015 | ISBN-10: 147291306X | ePUB | 18.8 mb\r\n\r\nIn the bestselling style of the Reeds Handbook series, Reeds Ocean Handbook builds on Reeds Skipper's Handbook with advice for skippers or crew planning to venture further afield. Complimenting the RYA Ocean Yachtmaster course, this handy pocketbook provides all the essential navigation, weather, and route planning theory, as well as practical guidance and advice on long-distance radio communications, ocean passage-making, and risk/emergency preparations.\r\nColor coded sections, for user-friendly accessibility, cover:\r\n- World climate and route planning (including world wind systems, ocean currents, tropical revolving storms)\r\n- Navigation (charts, great circle vs. Mercator routes, time zones, satellite navigation systems, advice on on-passage navigation routines)\r\n- Astro navigation (basic theory refresher, practical astro navigation, plus using and adjusting the sextant)\r\n- Passage making (route planning, preparing the yacht, power needs, supplies of water, food, gas, and diesel, watch-keeping routines, crew care)\r\n- Communications (features and advantages of VHF, MF, SSB, and satellite phones, weather fax, email, and access to the internet)\r\n- Risks and emergencies (preparing for them, equipment checklist, grab bags, emergency procedures)\r\nInternationally relevant with color diagrams throughout, this handy pocket-sized handbook is an ideal revision aid on shore and the perfect quick reference guide on the boat.\r\n\r\nAbout the Author\r\nA Cambridge-educated engineer, Bill Johnson swapped his career for long-distance sailing. He stopped logging miles somewhere around 50,000. A sailing instructor for ten years, focusing on the RYA courses from beginner to Yachtmaster level, Bill's strength is in explaining tricky subjects in a clear and engaging way. He is the author of Reeds Crew Handbook and Manoeuvring, both published by Adlard Coles Nautical. \r\n\r\nCONTENTS\r\nInroduction\r\nWorld climate\r\nRoute planning\r\nOcean navigation\r\nAstro navigation\r\nYacht preparation\r\nHeavy weather sailing &amp; storm tactics\r\nCommunication \r\nRisks &amp; emergencies\r\nGlossary\r\nPicture credits\r\nAcknowledgements\r\n \nhttp://s17.postimg.org/wc9vgnhr3/Reeds_Ocean_Handbook.jpg","torrent":{"xt":"urn:btih:1f7b9a13324f6c08af9414a86b0cf12a259ddb5d","amp;dn":"Reeds+Ocean+Handbook+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7b9a13324f6c08af9414a86b0cf12a259ddb5d","infoHashBuffer":{"type":"Buffer","data":[31,123,154,19,50,79,108,8,175,148,20,168,107,12,241,42,37,157,219,93]},"announce":[],"urlList":[]}}