{"title":"J. Lee Thompson - Cape Fear (1962)","uid":6962184,"size":1840554685,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20c0cb06298bda46a48193ef28861c95e1e4cb15&amp;dn=J.+Lee+Thompson+-+Cape+Fear+%281962%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1326798550,"description":"J. Lee Thompson - Cape Fear (1962)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0055824&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0055824&lt;/a&gt;\n &lt;a href=&quot;\nhttp://daw.dyndns.org/images/movies/remakes/capefear%2062.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://daw.dyndns.org/images/movies/remakes/capefear%2062.jpg&lt;/a&gt;\n\nFilmed in black and white, director J.Lee Thompson uses shadows and light, and the art of suggestion(the censors were pretty tough back in the 60's), to bring us this bone-chilling and suspenseful classic that over fourty years later, still, has not lost it's draw.\n\nIt's good vs. evil, as Greogory Peck and Robert Mitchum, put their immense talents together for this spine tingler. Max Cady(Mitchum) has just been released from 8 long years in prison. From the moment we meet him, we KNOW this is one bad hombre. He is bent on revenge, and Sam Bowden(Peck) is the man who must pay.\n\nMitchum is simply powerful in his performance of this menacing threat, and Peck as always is perfect in his portrayal of the family man whose life has just turned into one big nightmare!\n\nThe film is also helped by the wonderful talents of Telly Savalas and Martin Balsam. Polly Bergen and Lori Martin are magnificent as the terrified wife and daughter.The talent doesn't end there though, the haunting music was scored by Bernard Hermann(who worked with Hitch on several films), and Sam Leavitt does a fabulous job with the black and white cinematography.\n\n\nAfter an eight-year prison term for rape and assault, Max Cady (Robert Mitchum) is set free. Immediately making a beeline to Sam Bowden (Gregory Peck), the former prosecutor responsible for Cady's conviction, Cady laconically informs Sam that he intends to &quot;pay back&quot; the attorney for his years behind bars. Conducting a meticulous campaign of terror, Cady is careful to stay within the law. Sam, realizing that Cady intends to wreak vengeance by raping the attorney's wife (Polly Bergen) and daughter (Lori Martin), tries to put the ex-criminal behind bars, but has no grounds to do so. Chief Dutton (Martin Balsam) tries to help Sam with a few strong-arm tactics, but succeeds only in having the courts take Cady's side in the matter. Things come to a head when Sam moves his family to the &quot;safety&quot; of a remote houseboat on Cape Fear river. Cady shows up unannounced and is about to ravage Bowden's wife and daughter and when Sam turns the tables.\n &lt;a href=&quot;\nhttp://img223.imageshack.us/img223/8386/koederfuerdiebestieein3qb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img223.imageshack.us/img223/8386/koederfuerdiebestieein3qb.jpg&lt;/a&gt;\n\n\n------not my rip----------\n\nFile Size (in bytes) ............................: 1,422,282,752 bytes\nRuntime ............................................: 1:45:54\n\nVideo Codec ...................................: XviD ISO MPEG-4\nFrame Size ......................................: 720x384 (AR: 1.875)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1653 kb/s\nBits per Pixel ...................................: 0.249 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x0055 MPEG-1 Layer 3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 128 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1 \n\n*************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    \\'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE       \n      ","torrent":{"xt":"urn:btih:20c0cb06298bda46a48193ef28861c95e1e4cb15","amp;dn":"J.+Lee+Thompson+-+Cape+Fear+%281962%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20c0cb06298bda46a48193ef28861c95e1e4cb15","infoHashBuffer":{"type":"Buffer","data":[32,192,203,6,41,139,218,70,164,129,147,239,40,134,28,149,225,228,203,21]},"announce":[],"urlList":[]}}