{"title":"Revenge 1x01 HDTV Spanish by tony","uid":6950745,"size":367536328,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:21d725486bd719d80988821893eb88cb2b893645&amp;dn=Revenge+1x01+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"carambolas","files":3,"time":1326392901,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n                                 &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\n'Revenge' tiene todos los ingredientes propios de los grandes relatos por entregas del pasado, actualizado al siglo XXI por ciertos comportamientos de sus personajes y por un escenario central, los Hamptons, enclave de la Costa Este norteamericana convertido en paraÃƒÂ­so de millonarios y celebridades de las ÃƒÂºltimas dÃƒÂ©cadas. Hasta los Hamptons llega Emily Thorne, identidad falsa de la joven protagonista de la serie, que en realidad responde a otro nombre y que justifica su apariciÃƒÂ³n para ejecutar un calculado plan de venganza, destinado a ajustar las cuentas a la comunidad que un par de dÃƒÂ©cadas antes, cuando ella era una niÃƒÂ±a, defenestrÃƒÂ³ a su padre hasta el punto de acarrearle la ruina y, a la postre y como consecuencia indirecta, la muerte.\nCreada por Michael Kelley, responsable de series como 'Jerico', 'The O.C.' o 'Providence', 'Revenge' no esconde las influencias de clÃƒÂ¡sicos de la literatura del XIX como 'El conde de Montecristo', trasunto de Emily Thorne, quien, como el personaje de Dumas, recurre a todo tipo de ardides para lograr sus fines. AsÃƒÂ­, en la estructura dramÃƒÂ¡tica de la serie, veremos como en cada episodio la vengativa Emily logra expulsar de la comunidad a uno de sus miembros, aplazando en busca de un dardo aÃƒÂºn mÃƒÂ¡s certero, su guerra personal con Victoria Grayson, pilar de los Hamptons, antigua amante de su padre y por ende una de las principales culpables de su caÃƒÂ­da.","torrent":{"xt":"urn:btih:21d725486bd719d80988821893eb88cb2b893645","amp;dn":"Revenge+1x01+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21d725486bd719d80988821893eb88cb2b893645","infoHashBuffer":{"type":"Buffer","data":[33,215,37,72,107,215,25,216,9,136,130,24,147,235,136,203,43,137,54,69]},"announce":[],"urlList":[]}}