{"title":"Ass.Titans.6.XXX.DVDRip.XviD-Jiggly","uid":6925715,"size":1470925181,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:22ab2713798d7c2be19144d08c3e1ab7f8f2d731&amp;dn=Ass.Titans.6.XXX.DVDRip.XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":3,"time":1325488932,"description":"Ass.Titans.6.XXX.DVDRip.XviD-Jiggly\n\nScreens: &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=6n8drhy9hk6l0t840z0u.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=6n8drhy9hk6l0t840z0u.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=ukxzoef2xxoav3u2629n.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=ukxzoef2xxoav3u2629n.jpg&lt;/a&gt;\n\n\nStarring\tJulia Ann, Manuel Ferrara, Asa Akira, Erik Everhard, London Keys, John Strong, Lea Lexis, Alexandra Gold\n\n\nSix Blazing Anal Scenes!\n\nDirector Raul Cristian usually imposes rough, male-dominant sex on Europe's raunchiest sluts, but in 'Ass Titans 6' most of his subjects are lust-crazed American XXX superstars. Each beauty sports a magnificent ass - blonde MILF Julia Ann, racy Lea Lexis, naturally busty Asian-American London Keyes and another Asian-American stunner, Asa Akira. Julia enjoys anal thrills with Erik Everhard, who leashes her, bends her over a stairwell for a spanking fuck and repeats with his fat dork up her asshole. She squeals delightedly till he yanks his meat from her butthole and blows his wad into her mouth. Asa looks hot riding Manuel Ferrara's thick post as he pulls her silky hair and stuffs fingers up her ass. Manuel gives her a hard anal pounding, and the scene includes a foot job, Fleshlight fucking, Asa slurping jism from her fingers and a view of her intestinal innards.\n\nAfter a spit-inducing, deep-throat face fuck from John Strong, adorably stacked London bites her own nipple, fingers her rosebud and takes a serious rectal reaming. Her pretty butt cheeks clap picturesquely as she rides dick. Playful, naturally cute Lea Lexis warms up with dildoes, then provides Erik a titty fuck and an enthusiastic blow job/hand job/scrotum suck. He porks her pussy and creams her tongue. In a bonus scene, hot brunette Alexandra Gold takes a heavy sodomy session on a patio; David Perry leaves her semen-splashed. Are the real 'Ass Titans' the frisky, divinely curvy girls or the hard-fucking studs who service their shapely rears?","torrent":{"xt":"urn:btih:22ab2713798d7c2be19144d08c3e1ab7f8f2d731","amp;dn":"Ass.Titans.6.XXX.DVDRip.XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22ab2713798d7c2be19144d08c3e1ab7f8f2d731","infoHashBuffer":{"type":"Buffer","data":[34,171,39,19,121,141,124,43,225,145,68,208,140,62,26,183,248,242,215,49]},"announce":[],"urlList":[]}}