{"title":"Moguls, Monsters and Madmen: An Uncensored Life in Show Business","uid":16024657,"size":10091099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2337264b1c4ece7233e4d807aeb694d8898e2077&amp;dn=Moguls%2C+Monsters+and+Madmen%3A+An+Uncensored+Life+in+Show+Business&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476369843,"description":"Moguls, Monsters and Madmen: An Uncensored Life in Show Business - Barry Avrich [epub]\r\n\r\nBarry Avrich is a Montreal-born, self-made film producer/director, flamboyant advertising executive, and legendary biographer and connector of moguls and stars. For over three decades he has relentlessly produced films on some of the most notorious show-business titans and also found the time to market and promote feature films, concerts, and the biggest shows on Broadway.\r\n\r\nIn his memoir, Moguls, Monsters, and Madmen, Barry takes readers from his early days, shaping his brand as a creative adman with the infamous Garth Drabinsky and witnessing the genius of legendary Rolling Stones promoter Michael Cohl, to his acclaimed documentaries on Harvey Weinstein, Lew Wasserman, Bob Guccione, and many others. Go behind the scenes on his most provocative films — like The Last Mogul, Unauthorized, and Filthy Gorgeous — and follow Barry as he moves from the power rooms of Hollywood to the launches of incredible brands while hanging around with royalty, rogues, clients, and confidants.\r\n\r\nAn extraordinary raconteur, Barry spares no one, least of all himself, as he details his extraordinary relationships and encounters with everyone from Frank Sinatra, Quincy Jones, and Vanity Fair columnist Dominick Dunne to Mick Jagger and Keith Richards","torrent":{"xt":"urn:btih:2337264b1c4ece7233e4d807aeb694d8898e2077","amp;dn":"Moguls%2C+Monsters+and+Madmen%3A+An+Uncensored+Life+in+Show+Business","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2337264b1c4ece7233e4d807aeb694d8898e2077","infoHashBuffer":{"type":"Buffer","data":[35,55,38,75,28,78,206,114,51,228,216,7,174,182,148,216,137,142,32,119]},"announce":[],"urlList":[]}}