{"title":"Hunt For The Hidden Relic DVD NL(dvd5)(Nl subs)RETAIL TBS","uid":6943954,"size":4292876972,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:237471a33fe38c24e431838aa371efd674cd69b9&amp;dn=Hunt+For+The+Hidden+Relic+DVD+NL%28dvd5%29%28Nl+subs%29RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sammynet","files":20,"time":1326148635,"description":"Das Jesus Video (2002)\nAlternatieve titel: The Hunt for the Hidden Relic\n\nNederlands\nWanneer Steffen Vogt tijdens opgravingen in IsraÃƒÂ«l per ongeluk in een gat valt, ontdekt hij een skelet.\nNa onderzoek blijkt dat dit skelet 2000 jaar oud is.\nOp zich is dat niet bijzonder, maar wat wel heel bijzonder is, is dat dit skelet is voorzien van titanium schroeven afkomstig van een operatie, en vullingen in zijn tanden van amalgaam.\nSteffen oppert de optie dat dit skelet wel eens van een tijdreiziger zou kunnen zijn die terug in de tijd is gegaan,\ndeze stelling wordt met gelach ontvangen, maar zo gek is het eigenlijk niet.\nBij het skelet werd ook een handleiding ontdekt, een handleiding van een videocamera.\nDeze camera blijkt echter pas over 3 jaar op de markt te komen.\nAls zijn beste vriend Dan wordt vermoord, gaat Steffen, met hulp van Sharon en haar vriend Yehoshua op onderzoek uit.\nDe camera is duidelijk de schakel waar iedereen naar zoekt en ze komen steeds dichter bij de oplossing van het raadsel. \nDe spanning neemt toe richting de verrassende ontknoping.\n\nEnglish\nSTEFFEN VOGT, aged around 25, is helping out at a German archeological excavation in Israel when he finds a 2,000-year-old skeleton holding the instructions for a video camera dating from the year 2003.\nThe bones also show traces of the present day.\nHis theory of a time-traveler who made a video of Jesus is laughed at by everyone, however, including SHARON, an attractive Israeli woman he adores.\nAlthough no one appears to believe him, his find certainly seems to have generated interest: Steffen is attacked shortly afterwards in his hotel room by strange men;\nthen he discovers that the German embassy and the secret service are after him; and when his friend DAN is murdered, he goes into hiding. His only true ally is Sharon.\nSteffen's theory seems to be correct:\nfinancier and time-travel expert KAUN turns up at the excavations in person and carries out several elaborate subterranean measurements at the Wailing Wall #\nwhere he believes the camera has been hidden... \n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Duits\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Actie / Thriller\nTime          : 124 minuten","torrent":{"xt":"urn:btih:237471a33fe38c24e431838aa371efd674cd69b9","amp;dn":"Hunt+For+The+Hidden+Relic+DVD+NL%28dvd5%29%28Nl+subs%29RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"237471a33fe38c24e431838aa371efd674cd69b9","infoHashBuffer":{"type":"Buffer","data":[35,116,113,163,63,227,140,36,228,49,131,138,163,113,239,214,116,205,105,185]},"announce":[],"urlList":[]}}