{"title":"History Ch Ice Pilots 06of13 On the Move XviD AC3 ","uid":6989466,"size":670867456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:23ea9ddfafd2609130cffffbf5adb1b07ea34c99&amp;dn=History+Ch+Ice+Pilots+06of13+On+the+Move+XviD+AC3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"MVGroup","files":-1,"time":1327662055,"description":"Ice Pilots\n\nTravel Documentary hosted by Michael Daingerfield, published by History Channel in 2010 - English narration\n\n\nInformation\n------------------------------\n\nIce Pilots Series 1\nIt's the last frontier. And these are the last of the true Arctic aviators. Young pilots with a taste for adventure have come here to earn their wings, flying vintage steel built for war. But it's a different war now: a war against bitter cold and constant breakdowns, a war to get the job done, a war to stay alive flying in the toughest conditions on the planet. The job: to haul people and vital fuel and supplies to far flung outposts in the Canadian North. Piloting sturdy old war birds built for punishment, they're learning with every hard knock, pulling together even as they compete to rise up the ranks. It's an impossible job with antique equipment in a merciless place.\n\n\n1)  Buffalo Air \nRookie co-pilot Scott faces his worst nightmare when a faltering Curtiss C-46 Commando engine and low fog force a scary landing. Ambitious young flyer Alex must prove himself when Buffalo's chief pilot gives him control of the 20-ton Douglas DC-4 for the very first time. And boss' son Mikey gets in hot water when &quot;Buffalo&quot; Joe needs the backup Douglas DC-3 - and it's nowhere near ready.\n\n2)  Pre Christmas Rush \nChristmas is just around the corner, but Buffalo's crucial food and mail runs come to a halt. An engine seizure strands Scott, AJ and the C-46 plane, creating a chaotic chain reaction. Crusty mechanic Chuck must attempt a bare-handed engine swap in minus 30, and pressure from customers and co-workers pushes cargo manager Kelly to the breaking point.\n\n3)  Birthday from Hell \nA string of bad luck turns chief pilot Arnie's 66th birthday run into the flight from hell - and threatens to spoil his naughty birthday surprise. Ramp hand Jeremy is desperate to move up the ranks, but a female newbie could throw a wrench in his plans. And after the crew works all night to turn the DC-4 into a flying gas tanker, new co-pilot Alex flies a tricky fuel haul.\n\n4)  A Big Deal \nWhen a power failure leaves Rankin Inlet exposed to the brutal northern elements, captain Justin races to deliver an emergency generator. Ramp hand Jeremy tries to move ahead of co-worker Audrey by training a new hire from India to replace him. And when the recession nips at Joe's heels, he tries to broker a $7-million deal that could save Buffalo's hide.\n\n5)  40.40.40 \nThe friendship between Captain Devan and co-pilot Scott is put to the ultimate test when they come face-to-face with frightening wind shear down at Bear Rock. Mechanic Cory races against the clock to turn two short haul waterbombers into transatlantic aircraft ready for their grand voyage to Turkey. Engineer Adam is left trying to free the C-46 crew from a jam on a remote airstrip in bone-chilling temperatures of minus 40.\n\n6)  On the Move \nA charter flight falls through the cracks after the McBryans attend a wild family wedding, and an irate Joe pulls captain Justin from the Turkey test flights to do the job. Justin's task is to move an impatient Brit, his dog and all his worldly possessions to a remote northern outpost, but the weather isn't cooperating. Meanwhile, Devan ponders a job offer in Africa - leaving girlfriend Jynelle to ponder their future.\n\n7)  Suspension \nA furious Joe fights against a federal suspension that will prevent him from carrying passengers for the first time in 20 years. It's also a setback for Jeremy and the other rampies, which takes a turn for the worse with an unexpected injury. For the Turkey waterbomber team it's finally a go. Arnie, Justin and the crew set off on the first leg of their journey, a risky trip across Canada in the dead of winter, with no de-icing equipment.\n\n8)  Cause for Celebration \nAJ and Candace get married in the Ice Castle. A frustrated Chuck tries to get the Electra to pay her way. A flummoxed Mikey tries to bake a cake for Joe's birthday. And in Newfoundland, a fuel leak, a sobering survival course and a tragic crash rattle the Turkey crew. When raging winds provide the long-awaited weather window, will they chance on the treacherous North Atlantic crossing?\n\n9)  Transatlantic Crossing \nThe Turkey crew makes the critical jump over the North Atlantic. But en route to Portugal, one crew is forced to turn back. With no power on one engine and no way to maintain altitude, they must get back into Santa Maria, where the airport is on full emergency alert. And Mikey and Scott search for a new rampie, while Jeremy's hopes plummet even further.\n\n10)  Thin Ice \nC-46 and DC-4 crews race against the spring melt to fly mining equipment to an airstrip on a frozen lake. Jeremy tries to catch up to fellow rampies Audrey and Wilf. And on the final leg to Turkey, Arnie and Justin face some serious volcanoes and busy Mediterranean air traffic.\n\n11)  The Crash \nAfter thousands of hours of painstaking preparation and dangerous flying, a terrible accident devastates the waterbomber crew in Turkey - and everyone at Buffalo. Wilf's first run as flight attendant raises eyebrows among the staff. And a Scottish airplane buff fulfills the dream of a lifetime when Joe lets him ride in the captain's seat of his DC-3.\n\n12)  Change of Seasons \nWhen her husband quits after a blowout with Joe, Kelly is put in a terrible position. Will she stay at Buffalo - or will she go? Scott gets the news he must stand down from flying so another co-pilot can fast-track to captain. He pulls out all the stops to secure a new charter, but his rival also wants to fly the new job. And Jeremy has a chance to beat the other rampies to a job piloting the DC-3 - if he can pass the Joe test.\n\n13)  Up in the Air \nAfter her husband's acrimonious departure from Buffalo, Kelly has a confrontation that decides whether she, too, will quit. Jeremy makes a mistake that could end his Buffalo career. An aviation gas shortage brings a sobering dose of reality to the McBryans. And after a visit from his mom, fate throws Scott an unexpected curve ball. When the dust settles, someone will be leaving Buffalo Airways.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img843.imageshack.us/img843/9111/icepilotsscreen0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img843.imageshack.us/img843/9111/icepilotsscreen0.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img856.imageshack.us/img856/9230/icepilotsscreen1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img856.imageshack.us/img856/9230/icepilotsscreen1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img836.imageshack.us/img836/6565/icepilotsscreen2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img836.imageshack.us/img836/6565/icepilotsscreen2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img839.imageshack.us/img839/5717/icepilotsscreen3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img839.imageshack.us/img839/5717/icepilotsscreen3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img839.imageshack.us/img839/6942/icepilotsscreen4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img839.imageshack.us/img839/6942/icepilotsscreen4.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img37.imageshack.us/img37/4610/icepilotsscreen5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img37.imageshack.us/img37/4610/icepilotsscreen5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img854.imageshack.us/img854/4986/icepilotsscreen6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img854.imageshack.us/img854/4986/icepilotsscreen6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img576.imageshack.us/img576/7222/icepilotsscreen7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img576.imageshack.us/img576/7222/icepilotsscreen7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img513.imageshack.us/img513/4113/icepilotsscreen8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img513.imageshack.us/img513/4113/icepilotsscreen8.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: XviD ISO MPEG-4\n * Video Bitrate: 1760 kbps\n * Video Resolution: 832x480\n * Video Aspect Ratio: 1.733 (16.9)\n * Frames Per Second: 25\n * Audio Codec: 0x2000 (Dolby AC3)\n * Audio Bitrate: 192 kb/s AC3 48000 Hz\n * Audio Streams: 2\n * Audio Languages: English\n * RunTime Per Part: 45.Mins\n * Number Of Parts: 13\n * Part Size: 640 MB\n * Encoded by Harry65\n * Source: DVD\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ice_Pilots_NWT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ice_Pilots_NWT&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Air%20Crash%20Investigation%20-%20Season%201&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Air%20Crash%20Investigation%20-%20Season%201&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=The%20Magic%20of%20Flight&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=The%20Magic%20of%20Flight&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Warbirds%20of%20World%20War%20II&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Warbirds%20of%20World%20War%20II&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=Frontiers%20of%20Flight&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Frontiers%20of%20Flight&lt;/a&gt; &lt;a href=&quot;\nhttp://docuwiki.net/?title=From%20Sea%20to%20Sky%20-%20The%20flying%20boats%20in%20Australia&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=From%20Sea%20to%20Sky%20-%20The%20flying%20boats%20in%20Australia&lt;/a&gt;\n\n3)  ed2k Links \n\n\n\n\nAdded by &lt;a href=&quot;\nhttp://docuwiki.net/?title=User%3AHarry65&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=User%3AHarry65&lt;/a&gt;\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=Ice_Pilots&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=Ice_Pilots&lt;/a&gt;\n","torrent":{"xt":"urn:btih:23ea9ddfafd2609130cffffbf5adb1b07ea34c99","amp;dn":"History+Ch+Ice+Pilots+06of13+On+the+Move+XviD+AC3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ea9ddfafd2609130cffffbf5adb1b07ea34c99","infoHashBuffer":{"type":"Buffer","data":[35,234,157,223,175,210,96,145,48,207,255,251,245,173,177,176,126,163,76,153]},"announce":[],"urlList":[]}}