{"title":"Heroes of Newerth - LEGACY DVD -","uid":6933775,"size":1366633536,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:248a2aa436dddc75f2965f9738478f173986c683&amp;dn=Heroes+of+Newerth+-+LEGACY+DVD+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hclivess","files":3,"time":1325755185,"description":"Heroes of Newerth Legacy DVD is a rare collectible available only to users of Demonoid so far. I have personally created it to suit needs of everyone missing the retail version of this great, action-packed and competitive game based on Defense of the Antients Warcraft 3 TFT mod. It has its own engine, perfect 3D graphics and is free to play in its basic version. If you get this package instead, you will get your hands on the following exclusive features:\n\n(EXCLUSIVE!)-Heroes of Newerth Academy from IGN\nLet the game developers themselves let you teach how to start playing this amazing game! Dubbed personally by DivA and MsPudding, this instructional video series will guide you through the basics of the game and teach you some advanced tricks in case that you are already familiar with the basics. You cannot obtain this elsewhere!\n\n(EXCLUSIVE!)-Heroes of Newerth DVD Cover\n-Designed by the artists of S2 in combination with myself, the DVD cover has been created. Most o the player have never seen this artwork before and is guaranteed to decorate your shelf with this marvellous game you will never forget.\n\n(EXCLUSIVE!)-Heroes of Newerth Professionals Stream List\n-Hand-picked and regularly updated, you will get the access to my personal selection of the best of the best players streaming for free on Twitch.tv. Some of them even offer lessons for free to improve your gaming skill even more.\n\nExcept for the exclusive content, this package also includes HoN client in its latest version directly on the disc. However, do not forget to register from within the included index.htm to get the most out of this package.\n\nEnjoy!","torrent":{"xt":"urn:btih:248a2aa436dddc75f2965f9738478f173986c683","amp;dn":"Heroes+of+Newerth+-+LEGACY+DVD+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"248a2aa436dddc75f2965f9738478f173986c683","infoHashBuffer":{"type":"Buffer","data":[36,138,42,164,54,221,220,117,242,150,95,151,56,71,143,23,57,134,198,131]},"announce":[],"urlList":[]}}