{"title":"Outlast+ Whistleblower-.-alf","uid":15813640,"size":6204327936,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:259a1366588ff91ef78cbcb9d2a8f2fe141f9851&amp;dn=Outlast%2B+Whistleblower-.-alf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alfrg72","files":1,"time":1473651843,"description":"Outlast se juega desde una perspectiva en primera persona. El protagonista, Miles Upshur a diferencia de muchos protagonistas de juegos de suvirval horror, es incapaz de combatir, en su lugar el personaje es capaz de desplazarse, escalar u ocultarse en lugares de su entorno para eludir a los enemigos. Para desplazarse por el entorno, el personaje es capaz de escalar lugares altos, evitar obstáculos, arrastrarse, y deslizarse en espacios estrechos usando parkour. La resistencia del personaje es límitada y se puede recuperar progresivamente de las heridas si permanece un determinado tiempo sin ser atacado. Originalmente los realizadores del juego habían desarrollado a una asistente femenina para ayudar a Upshur en diferentes situaciones pero la idea fue desechada ya que los realizadores sentían que eso podría disminuir el estrés provocado por la incapacidad del personaje para defenderse. Además, el protagonista puede sobrevivir a situaciones de peligro escondiéndose en el interior de los casilleros, debajo de las camas o al cerrar las puertas de ciertas habitaciones.\r\n\r\nDado que la mayoría del manicomio es oscuro, se debe usar la cámara para ver en la oscuridad, todo esto gracias a la función de visión nocturna. Sin embargo, el uso excesivo de la visión nocturna consumirá casi toda la batería. Para ello se necesitará buscar baterías que se encontrarán en diferentes lugares del manicomio a fin de lograr pasar por diferentes escenarios.\r\n\r\nLa mayor parte de los enemigos en el juego son variantes o pacientes del manicomio que presentan comportamientos variados con algunos siendo agresivos y otros brindándole ayuda o consejos a Upshur. Esta cualidad fue agregada para hacer de los personajes más &quot;realistas&quot; dado a que no todos los pacientes de un psiquiátrico son de naturaleza violenta.                                                  http://www.3djuegos.com/juegos/analisis/18601/0/outlast-whistleblower/","torrent":{"xt":"urn:btih:259a1366588ff91ef78cbcb9d2a8f2fe141f9851","amp;dn":"Outlast%2B+Whistleblower-.-alf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"259a1366588ff91ef78cbcb9d2a8f2fe141f9851","infoHashBuffer":{"type":"Buffer","data":[37,154,19,102,88,143,249,30,247,140,188,185,210,168,242,254,20,31,152,81]},"announce":[],"urlList":[]}}