{"title":"The Big Bang Theory S05E02 - digitalorange -","uid":6948948,"size":181646119,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27b485500639d8865d46c1446d356b7db7c862b8&amp;dn=The+Big+Bang+Theory+S05E02+-+digitalorange+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"imnotok","files":1,"time":1326331775,"description":"The Big Bang Theory is an American sitcom created by Chuck Lorre and Bill Prady, both of whom serve as executive producers on the show, along with Lee Aronsohn and Steve Molaro, who are two of the head writers. It premiered on CBS on September 24, 2007.\n\nSet in Pasadena, California, the show is centered on five characters: two roommate Caltech geniuses, experimental physicist Leonard Hofstadter and theoretical physicist Sheldon Cooper; their neighbor across the hall Penny, an attractive blonde waitress and aspiring actress; and Leonard and Sheldon's equally geeky and socially awkward co-workers and friends Howard Wolowitz, an Aerospace engineer and a non-PhD from JPL, and Rajesh Koothrappali, a particle astrophysicist postdoc also working at Caltech.\n\t\n\nMain Cast:\nLeonard Hofstadter Ph.D., portrayed by Johnny Galecki, is an experimental physicist with an IQ of 173 who received his doctorate when he was 24 years old. He shares an apartment with colleague and friend Sheldon Cooper and is the straight man of the series. \n\nSheldon Cooper, Ph.D., portrayed by Jim Parsons, is a theoretical physicist. Originally from East Texas, he was a child prodigy, starting college at the age of 12, right after completing the fifth grade. He has an IQ of 187 and exhibits a strict adherence to routine; a lack of understanding of irony, sarcasm and humor; and a complete lack of humility. \n\nPenny, portrayed by Kaley Cuoco, is the attractive, blonde neighbor who lives across the hall from Sheldon and Leonard. She has aspirations of a career in show business, and has been to casting calls and auditions but has not been successful thus far. To pay the bills, she works as a waitress at The Cheesecake Factory. Her last name has never been revealed. \n\nHoward Wolowitz, M.Eng., portrayed by Simon Helberg, works as an aerospace engineer. He is Jewish, and lives with his mother. Unlike Sheldon, Leonard, and Raj, Howard lacks a Ph.D. He defends this by pointing out that he has a master's degree in Engineering from MIT and the apparatus he designs are actually built and launched into space, unlike the purely abstract work of his friends. He provides outrageous pick-up lines and fancies himself a ladies man with suitably unimpressed reactions from Penny; however, he has limited success with other women. \n\nRajesh Koothrappali, Ph.D., portrayed by Kunal Nayyar, originally comes from New Delhi, India. Known commnly as &quot;Raj&quot;, he works as a particle astrophysicist at Caltech. He is very shy around women and is physically unable to talk to them unless he drinks alcohol. However, he has much better luck with women as opposed to his overly confident best friend Howard","torrent":{"xt":"urn:btih:27b485500639d8865d46c1446d356b7db7c862b8","amp;dn":"The+Big+Bang+Theory+S05E02+-+digitalorange+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27b485500639d8865d46c1446d356b7db7c862b8","infoHashBuffer":{"type":"Buffer","data":[39,180,133,80,6,57,216,134,93,70,193,68,109,53,107,125,183,200,98,184]},"announce":[],"urlList":[]}}