{"title":"Total Uninstall Pro 5.10.2 Multilang","uid":6981525,"size":6484459,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2b0c4a61702beb8f9648d720d3d1fc5ab63448f1&amp;dn=Total+Uninstall+Pro+5.10.2+Multilang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nikita200","files":-1,"time":1327419856,"description":"The utility is intended primarily for users who often have to reinstall software. The first step in the Total Uninstall, is monitoring changes in the system during the installation of new software. A snapshot of the file system and registry prior to the installation of any of the programs and after. In the future, based on the collected at the time of installation of data (images before and after installation), a tool for quickly and help you remove unwanted program. It's quite simple. Total Uninstall interface is very simple and intuitive, all of the steps set through dialogues, and that the Russian language program simplifies working with her.\n\nInstalled Programs module analyze existing installations and create a log with installation changes. It can uninstall programs even without the help of the supplied Add Remove program.\nJust select from the list the program that you want to uninstall and in a few seconds Total Uninstall will analyze it and will show in a tree view detected files, folders, registry keys and values of that program. You can review the details and remove some of the detected items. Total Uninstall is ready to uninstall the analyzed program. It will use first the supplied Add Remove program and will continue removing remaining items using the log.\n\nMonitored Programs module helps to monitor any changes made to your system during the installation of a new program. It allows you to perform a complete uninstall without having to rely on the supplied Add Remove program, which can leave files or changes behind.\nTotal Uninstall creates a snapshot of your system prior to installing a new program. It then takes an additional snapshot after the installation has completed. It then compares the two snapshots and displays all changes in a graphical tree view, marking all registry values and/or files that have been added, changed or deleted. Total Uninstall saves these changes and, if you decide to uninstall the program, it will reverse the changes to the previous state.\n\nFeatures\nAccurate analyze existing installations and create a log with installation changes.\nMonitor changes from registry and file system for new installations.\nUninstall completely and thoroughly analyzed or monitored programs.\nList without delay installed or monitored programs and with appropriate icons.\nOrganize in groups installed or monitored programs.\nFind the program to uninstall by keyword quickly and easily.\nSummary and detailed information for each installed or monitored program.\nUser configurable views of the detected changes.\nIt shows a detailed uninstall log.\nPowerful search in detected changes.\nStandalone and low resource usage agent for notification of running installation programs\nExport registry changes for install or uninstall\nExport installed or monitored programs list to file\nExport to file or print detected changes\nView and apply pending file rename operations without restart.\n\nOS: Windows 2000/XP/Vista/7\nHome Page: www.martau.com","torrent":{"xt":"urn:btih:2b0c4a61702beb8f9648d720d3d1fc5ab63448f1","amp;dn":"Total+Uninstall+Pro+5.10.2+Multilang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0c4a61702beb8f9648d720d3d1fc5ab63448f1","infoHashBuffer":{"type":"Buffer","data":[43,12,74,97,112,43,235,143,150,72,215,32,211,209,252,90,182,52,72,241]},"announce":[],"urlList":[]}}