{"title":"SOL.Exodus-SKIDROW","uid":6985342,"size":2135796397,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2b4f80285da70094c0304653e68329ac540c854d&amp;dn=SOL.Exodus-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MScope40","files":-1,"time":1327545664,"description":"S K I D R O W\nthe leading force\n\nproudly presents\nSOL: Exodus (c) Seamless Entertainment\n\n25-01-2012........Release Date Protection...............Steam\nWing Commander.......Game Type Disk(s)..................1 DVD\n\nRELEASE NOTES\n\nBy the year 2500, Earth had become toxic and unsafe for human life\nPollution and overpopulation had ravaged the planet, forcing humanity\nto the stars. Colonies and settlements soon sprung up across the solar\nsystem, but man had not left its thirst for war behind. Then, they\nlearned their sun was dying, and everything changed. Only when faced\nwith threat greater than each other did the nations of man finally\ncome together. The United Colonies of SOL (UCS) was born, its first\nand only mission: to locate a new home for mankind, safely beyond the\ndoomed borders of our solar system\n\nSuit up and take on the role of the Lieutenant Commander, ace fighter\npilot and 2nd in command of the UCS Atlas, as you search for a new\nhome, battle a mysterious enemy, and rescue humanity from a fiery end\n\nFeatures:\n\nExperience an action space shooter like no other with Unreal-powered\nvisuals\n\nEight epic missions take you across breathtaking landmarks of our solar\nsystem, including Pluto, Neptune, Triton, Uranus, Saturn, and Titan\n\nUtilize the advanced weaponry of your UCS HADES space fighter\nincluding dual gatling guns, tracking missiles and MAG cannon\n\nEngage a variety of enemy fighters, bombers, drones and more as you\nprotect civilian transports and defend installations from attack\n\nTake down massive capital ships by hacking into them and revealing\ntheir weak points or turning their weapons on one another\n\nLearn the origins of your shadowy foes as the plot unfolds through full\nvoice-acted dialogue\n\nReplay missions to earn higher ranks and perform heroic actions to earn\nupgrade points which can be used to improve your fighter\n\nTop your friends on Steam leaderboards and compare your medals with\ndozens of achievements to unlock!\n\nFully remappable controls support USB gamepads, joysticks, and\nmouse/keyboard control schemes\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Play the game\n6. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:2b4f80285da70094c0304653e68329ac540c854d","amp;dn":"SOL.Exodus-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b4f80285da70094c0304653e68329ac540c854d","infoHashBuffer":{"type":"Buffer","data":[43,79,128,40,93,167,0,148,192,48,70,83,230,131,41,172,84,12,133,77]},"announce":[],"urlList":[]}}