{"title":"the amazing race canada season 1 seedthendelete 7october16","uid":15977172,"size":17569931140,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2be2d3d72a118536dbff6fd8bfdf92918bf65001&amp;dn=the+amazing+race+canada+season+1+seedthendelete+7october16&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AboveandBeyond7","files":17,"time":1475855456,"description":"http://www.imdb.com/title/tt3069720/  just seeding 2 be kind to those who dont have copy of this season, dont hit n run\r\n\r\nAt the very least please Say thanks it may motivate me to do more uploads.the less thanks I get per torrent the lower my upload speed will be from now on , I hate hit and runners.  Thanks to all who share tv shows and movies &amp; magazines etc. If you download a tv show &amp; cant get an episode in the usual quality ( eg only an x264 is available but you have all other episodes of a series in 720p) please use search engines etc to find it on other sites eg other torrent sites or release listing types of sites (rlslog etc) &amp; when youve got it share it on thepiratebay etc  , Thanks to all cappers and release groups making me happy. Also if an episode is missing please hunt for it online and provide it on thepiratebay etc  for us all to complete our collections. To save us all time please can people start uploading some radio shows in packs eg Armin Van Buuren A State of Trance weekly radio show would be awesome if say 10 or 20 shows at a time were in a pack rather than having to add them 1 at a time, same goes for magazines please package some together eg 6 issues of same magazine..save us time thanks . \r\n\r\nIf you torrent Don’t forget to use a VPN &amp; VPNcheck software, all VPN providers need to video some one installing their software eg openvpn &amp; showing everything all users would need to do to set up their vpn, video is better than screenshots , video should be unedited to prove nothing was skipped &amp; show how long it will really take to set up,( even if it needs say 4 or 5 different videos of say 25 minutes long to fully show everything) we need video for how to set up VPN on Windows 7 &amp; a separate video for how to set up a VPN on Windows 10, please verbally explain things in English as you talk through every click &amp; action. ( If you want us to pay to use your VPN you must explain exactly how to set it up before we start paying you ! im sick to death of rubbish instructions ) also explain your VPN logging policy obviously only use a VPN that keeps no logs","torrent":{"xt":"urn:btih:2be2d3d72a118536dbff6fd8bfdf92918bf65001","amp;dn":"the+amazing+race+canada+season+1+seedthendelete+7october16","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2be2d3d72a118536dbff6fd8bfdf92918bf65001","infoHashBuffer":{"type":"Buffer","data":[43,226,211,215,42,17,133,54,219,255,111,216,191,223,146,145,139,246,80,1]},"announce":[],"urlList":[]}}