{"title":"Sonny.Boy.2011.BDRip.XviD-BiG","uid":6998625,"size":1468020941,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f39de824d49231aff4007bb976563441b6ecbfe&amp;dn=Sonny.Boy.2011.BDRip.XviD-BiG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BiG-","files":-1,"time":1327975193,"description":"INFO:\n\n    Release..........: Sonny.Boy.2011.BDRip.XviD-BiG\n    Original Title...: Sonny Boy\n    A.k.a............: Sonny Boy\n    Genre............: Drama\n    IMDb.............:Ã‚Â http://www.imdb.com/title/tt1138481/\n    IMDB Rating .....: 6.7/10 (564 votes) \n    Theatre Date.....: 27 January 2011\n\n    Release Date.....: 29 September 2011\n    Filesize.........: 1400 mb\n    Runtime..........: 2h 20m 28s\n    Resolution.......: 624x336\n    Framerate........: 24 fps\n    Video Codec......: XviD\n    Video Quality....: 1066 kbps\n    Audio Codec......: AC3 5.1\n    Audio Bitrate....: 320 kbps\n    Audio Language...: Dutch\n    Subtitles........: English\n\nPLOT:\n\n  In the year 1920, a young man from Suriname named Waldemar Nods goes to the \n  Netherlands to study. His dark skin will watch and discrimination. He came  \n  to The Hague on lodgings at Rika, who went to live separately from her      \n  deeply religious husband William after she discovered him cheating with the \n  maid Jans. She has all four of their children (William, John, Bertha and Henk)\n  included.                                                             \n                                                                              \n  Waldemar and the 17 year older Rika start a relationship and she becomes    \n  pregnant. She says nothing and goes to Waldemar for a woman to an illegal   \n  abortion, but changes his mind. When she was four months pregnant she tells \n  that Waldemar. This is angry that she had been told nothing this time, and  \n  leaves. Wim and Jan walk away, to William. Waldemar comes back. William     \n  comes to Rika by to tell him a job in Indonesia is presented, and suggests  \n  her to go. He will accept the baby as his own child. He changes his mind and\n  that the father has dark skin. It also demands through the courts Bertha and\n  Hank, with success. He refuses a divorce so that Rika can not remarry with  \n  Waldemar. The child is a boy, they call him Waldy, nicknamed Sonny Boy.     \n  Because of Rika\\\\\\'s extramarital affair, and then also with a Surinamese, says\n  the landlord rent. Rika and Waldemar roam the streets with Waldy, but the   \n  older Jewish man meet Sam, she is home. With financial support from Sam and \n  Waldemar Rika start a guest house in Scheveningen. Netherlands is occupied  \n  by the Germans. Rika and Waldemar are forced to give shelter to German      \n  soldiers. Over time, however, have Rika and Waldemar Road because the area  \n  is cleared for the Atlantic.                                                \n                                                                              \n  Rika because she gives up five children gives them a big new house allotted.\n  At the request of a young resistance fighter Rika let people into hiding.   \n  Because the fee is higher than for Dutch Jews she chooses. Later there will \n  be a deserter from SS. First Waldy not informed, but later. Waldy get along \n  with the ex-SS man. Waldy sees that Sam is away on the street, and is       \n  shocked. It is discovered hiding, and Waldemar, Rika, Waldy and hiding are  \n  arrested. Waldy is released and goes to live with relatives. This is not    \n  safe, because the Germans want to Waldemar and Rika during interrogations   \n  put pressure Waldy re-arrest. He is therefore placed with a farmer. He asks \n  in the hunger winter of people who come precious jewelry in exchange for    \n  some food. Waldy approve that, but the farmer replies that everyone is\n  trying to ride a piece, Rika and Waldemar were also paid for hiding.        \n                                                                              \n  Rika dies in a concentration camp. Waldemar is also transferred to a        \n  concentration camp, but its language, he may work in the mailroom. Thus he  \n  sees opportunity to send letters to Waldy clandestinely. After Hitler\\\\\\'s     \n  death he is deported to the ship Cap Arcona. This is attacked by the Allies.\n  He jumps into the sea and swim to shore (he can swim well in Suriname he    \n  swam long distances in the river), then he is still slain by two German\n  child soldiers.\n\n\n\n","torrent":{"xt":"urn:btih:2f39de824d49231aff4007bb976563441b6ecbfe","amp;dn":"Sonny.Boy.2011.BDRip.XviD-BiG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f39de824d49231aff4007bb976563441b6ecbfe","infoHashBuffer":{"type":"Buffer","data":[47,57,222,130,77,73,35,26,255,64,7,187,151,101,99,68,27,110,203,254]},"announce":[],"urlList":[]}}