{"title":"Fear and Desire (1953)","uid":6936012,"size":934368201,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:306a17b1b9fae13e449d1698108fc2531c52a9d5&amp;dn=Fear+and+Desire+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"guidoanselmi","files":1,"time":1325830352,"description":"Stanley Kubrick's first feature film released in 1953 by Joseph Burstyn. Kubrick later did what he could to surpress the film, though few copies were struck and most of those had disappeared by the time he became a superstar director. Although he had previously worked as a professional photographer for Look magazine and had made three short films, he considered this an instructive but amateur effort, which it is, despite its having been directed, photographed and edited by Kubrick and written by Howard Sackler, a playwright who would win a Pulitzer Prize (for &quot;The Great White Hope&quot;) and would be the author of Kubrick's second film, &quot;Killer's Kiss.&quot; Although the film is about as pretentious as it is precocious, it shows us Kubrick's mind at work and lays out how he will frame, light and photograph some of his later work, especially &quot;Dr. Strangelove.&quot; War was an ever-present theme in most of Kubrick's films, and it's fascinating to see how he treats it here. It's very hard to belief that this little film is just one film and two years away from &quot;The Killing.&quot; The source of this copy is one of the two prints in the George Eastman collection. The image is better than in most copies that have made the rounds through the years. Note that the sound is sometimes out of synch - the movie was shot silent and the dialogue dubbed in post-production. This also accounts for the extraordinary number of interior monologues throughout the film. ","torrent":{"xt":"urn:btih:306a17b1b9fae13e449d1698108fc2531c52a9d5","amp;dn":"Fear+and+Desire+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306a17b1b9fae13e449d1698108fc2531c52a9d5","infoHashBuffer":{"type":"Buffer","data":[48,106,23,177,185,250,225,62,68,157,22,152,16,143,194,83,28,82,169,213]},"announce":[],"urlList":[]}}