{"title":"Persona 4 episode 5 english sub","uid":6897866,"size":101933036,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:30d83b0aa86da58ca3195bb9dea05b38dd59ea4d&amp;dn=Persona+4+episode+5+english+sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"codezero79","files":1,"time":1324275965,"description":"Persona 4 episode 5 Eng sub\n\nPlot Summary: Yu Narukami has moved from Tokyo to Inaba to stay with his uncle and cousin, while his parents are away on business. However, after a murder shakes up the sleepy town, things get even more crazy when he discovers the mysterious &quot;Midnight Channel&quot; and that he has the even more mysterious ability to enter TVs. Accompanied by his disbelieving friends, Yu discovers another world inside the TVs, that seems to be connected with the murder. They also discover the ability to summon Persona their other selves, whose power they can use to fight the shadows that inhabit the TV world. The murders, the Midnight Channel, the world inside the TV, and Persona. Yu and his friends fight to figure out how they're connected, and to solve the case before it's too late.\n\nSo here is episode 5\n\nThis episode more focuses on building relationships with all the people.\nSome people don't like this but I found this one to be pretty good and these kinds of episodes are really important in lots of anime series.\n\nAnd plz don't for get to comment and seed\n\nAnd one more thing I am going to be gone before the newest episode (12 i think) comes out so you are all going to have to wait till I get back sorry\n\n","torrent":{"xt":"urn:btih:30d83b0aa86da58ca3195bb9dea05b38dd59ea4d","amp;dn":"Persona+4+episode+5+english+sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30d83b0aa86da58ca3195bb9dea05b38dd59ea4d","infoHashBuffer":{"type":"Buffer","data":[48,216,59,10,168,109,165,140,163,25,91,185,222,160,91,56,221,89,234,77]},"announce":[],"urlList":[]}}