{"title":"King.Arthur.II.The.Roleplaying.Wargame-SKIDROW","uid":6991044,"size":15833317572,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:310c14c04594cc63b80b84e1a06c5d6adc836dd9&amp;dn=King.Arthur.II.The.Roleplaying.Wargame-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MsB1982","files":4,"time":1327704163,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nKing Arthur II: The Role-Playing Wargame (c) Paradox Interactive\n\n27-01-2012........Release Date - Protection.............Nothing\nStrategy/RPG.........Game Type - Disk(s)................BLU-RAY\n\nRELEASE NOTES\n\nCritically praised by reviewers and gamers alike, King Arthur was\nreceived one of the biggest surprises to emerge on the gaming scene in\n2010. Now the Fantasy/Roleplaying RTS returns in a sequel set to push\nthe boundaries of the genre even further.\n\nOur story begins long after young Arthur pulled the enchanted sword out\nof the stone, united the war-torn land of Britannia, gathered the\nKnights of the Round Table and secured peace in Camelot aided by the\nmight of the Holy Grail. Where legends normally end, King Arthur II\nbegins on its own gruesome tale.\n\nFeatures:\n\nDark fantasy setting. King Arthur is now the Maimed King, trying to\nmend a land torn asunder as he strives to heal himself.\n\nIntense boss fights, where the heros forces are pitted against unique\nand terrifying foes.\n\nLose yourself in a stunning story that unfolds over a huge 3D campaign\nmap featuring knightly quests and other special events\n\nWide range of camera control options, revised animations and an\nextensive tutorial creating a more accessible and visually stunning\nexperience\n\nExperience huge real-time battles featuring thousands of soldiers and\nflying fantasy monsters\n\nBattle enemies which employ unique war tactics and cast fantastic\nspells\n\nYour choices will unlock special content, spells and units with plenty\nof new and unique possibilities with every choice\n\nLead major heroes who possess extraordinary powers\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Play the game\n5. Support the companies, which software you actually enjoy\n\nADDITIONAL NOTES\n\nThis is not the same release, as some hoodlums released earlier today.\n\nWhat these hoodlums released today, is the free standalone DLC, that\nhave been out for quite some time, for those that preordered the game.\n\nThis release is the &quot;real&quot; true game, as the size of the release proves\n(yes, we did use a proper rar compression)","torrent":{"xt":"urn:btih:310c14c04594cc63b80b84e1a06c5d6adc836dd9","amp;dn":"King.Arthur.II.The.Roleplaying.Wargame-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"310c14c04594cc63b80b84e1a06c5d6adc836dd9","infoHashBuffer":{"type":"Buffer","data":[49,12,20,192,69,148,204,99,184,11,132,225,160,108,93,106,220,131,109,217]},"announce":[],"urlList":[]}}