{"title":"LOST_Season2_DVD4_(Retail)(MultiSub)(DVD9)","uid":6929337,"size":8132791037,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:312747cb47a16d4abcd60a8a37dbba6c2c362721&amp;dn=LOST_Season2_DVD4_%28Retail%29%28MultiSub%29%28DVD9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pharaootje","files":-1,"time":1325605794,"description":"Lost Season 2 (DVD 4):\n\nCategorie: Beeld\nFormaat: DVD9\nBron: Retail\nStandaard: PAL\nAudio: English, Spanish, French\nOndertiteling: English, Spanish, French, Dutch, Norwegian, Danish, Swedish, Finnish, Icelandic\nMenu: yes\nExtra's: Yes\nCovers: Yes\n\n\nNederlands:\n\nVerscheidene nieuwe personages, zoals Ana-Lucia Cortez, Libby en de Afrikaanse Mr. Eko doen hun intrede wanneer blijkt dat er op een andere plaats op het eiland eveneens overlevenden zijn uit het staartgedeelte van het vliegtuig. Ook het Dharma-initiatief (The Dharma Initiative) en de financierder The Hanso Foundation doen hun intrede. Zij zouden verantwoordelijk kunnen zijn voor de mysterieuze gebeurtenissen op het eiland. In ÃƒÂ©ÃƒÂ©n van de bunkers van 'The Dharma Initiative' vinden zij een film waarin uitleg wordt gegeven wat ze moeten doen om 'de wereld te redden'. Mr.Eko vindt nog een stukje film dat ertussenuit is geknipt waarin de losties zien dat ze met de computer niet mogen communiceren met de buitenwereld. John Locke begint te twijfelen over de knop waar ze om de 108 minuten op moesten drukken na het intikken van een code. Aan het einde van het seizoen drukt hij de knop niet in en ontstaat er een magnetisch veld door de overbelaste elektromagneet, die om de 108 minuten ontladen moet worden. De bunker implodeert waarbij de lucht paars wordt en de hele bunker wordt vernield.\n\n\nProductie: J.J. Abrams Ã‚Â· Jeffrey Lieber Ã‚Â· Damon Lindelof Ã‚Â· Carlton Cuse \nHoofdpersonages: Sayid Jarrah Ã‚Â· Claire Littleton Ã‚Â· Jack Shephard Ã‚Â· Hugo &quot;Hurley&quot; Reyes\n\t\t James &quot;Sawyer&quot; Ford Ã‚Â· Kwon Jin-soo Ã‚Â· Paik Sun-hwa Ã‚Â· Kate Austen Ã‚Â· John Locke\n\t\t Juliet Burke Ã‚Â· Benjamin Linus Ã‚Â· Danielle Rouseau Ã‚Â· Desmond Hume Ã‚Â· Charlotte Lewis\n\t\t Daniel Faraday Ã‚Â· Miles Straume Ã‚Â· Boone Carlyle Ã‚Â· Shannon Rutherford Ã‚Â· Mr. Eko Ã‚Â· Libby\n\t\t Ana LucÃƒÂ­a Cortez Ã‚Â· Charlie Pace Ã‚Â· Walt Lloyd Ã‚Â· Michael Dawson \nNevenpersonages: Tom Ã‚Â· Cindy Chandler Ã‚Â· Danny Pickett Ã‚Â· Rose Ã‚Â· Bernard Ã‚Â· Alex Ã‚Â· Ethan Rom\n\t\t Nikki Fernandez Ã‚Â· Paulo \nHoofdrollen: \t Naveen Andrews Ã‚Â· Nestor Carbonell Ã‚Â· Henry Ian Cusick Ã‚Â· Emilie de Ravin Ã‚Â· Michael Emerson\n\t\t Matthew Fox Ã‚Â· Jorge Garcia Ã‚Â· Josh Holloway Ã‚Â· Malcolm David Kelley Ã‚Â· Daniel Dae Kim\n\t\t Yunjin Kim Ã‚Â· Evangeline Lilly Ã‚Â· Elizabeth Mitchell Ã‚Â· Dominic Monaghan Ã‚Â· Terry O'Quinn\n\t\t Harold Perrineau Ã‚Â· Jeremy Davies Ã‚Â· Rebecca Mader Ã‚Â· Ken Leung \n\n\nDisk 4 (Seizoen 2)\n\n2-13 (38) &quot;The Long Con&quot; Sawyer Roxann Dawson Steven Maeda &amp; Leonard Dick  8 februari 2006 \nIn deze aflevering wordt Sun aangevallen door een onbekende. Heel het kamp staat in rep en roer. Jack, John en Ana-Lucia vrezen dat de &quot;Others&quot; hiermee iets te maken hebben, alhoewel die beloofd hadden, hen met rust te laten. Kate en Sawyer besluiten zelf op onderzoek uit te gaan om de dader te vinden en vinden een mysterieuze, zwarte kap. Tijdens deze aflevering blikt Sawyer terug op een vroegere liefde.  \n\n2-14 (39) &quot;One Of Them&quot; Sayid Stephen Williams Damon Lindelof &amp; Carlton Cuse  15 \nfebruari 2006 \nSayid denkt terug aan zijn tijd in Irak, toen de bunker waarin hij zat met de Republikeinse Garde werd ingenomen door de Amerikaanse troepen. Die dwongen hem toen te helpen bij de ondervraging van zijn commandant. Terug op het eiland wordt Rousseau gesignaleerd rond het kamp. Ze beweert dat ze op zoek was naar Sayid. Ze heeft een verrassing voor hem in de jungle.  \n\n2-15 (40) &quot;Maternity Leave&quot; Claire Jack Bender Dawn Lambertsen Kelly &amp; Matt Ragghianti  1 maart 2006 \nIn deze aflevering wordt de baby van Claire ziek: hij heeft koorts en uitslag. Claire maakt zich enorm veel zorgen en ze begint zich weer van alles te herinneren over toen ze was ontvoerd door Ethan. Je ziet haar herinnering waarin Ethan haar medicatie geeft zodat haar baby niet ziek wordt. Ze denkt dat dit geen medicatie is, maar een virus. Ze wil weten waar die plaats is waar ze gevangen werd gehouden maar ze heeft geen aanknopingspunten. \nZe gaat samen met Kate naar Rousseau, omdat zij weet waar Claire is achtergelaten. Zo komt ze erachter waar ze is heengebracht en waar ze die 2 weken heeft gezeten. Ze denkt dat ze een medicatie vindt voor haar kind maar ze vindt alleen een lege bunker. In die bunker was een kamer waar ze onder verdoving werd gehouden, in die kamer waren allemaal babyspulletjes. Op een gegeven moment zie je in haar herinnering, dat ze een babysokje aan het breien is en nu vindt ze dat babysokje, dat nog op de grond ligt, terwijl al de rest weg is. Medicatie voor haar baby vindt ze niet, maar ze komt er wel achter dat Rousseau haar niet wilde terugbrengen naar de &quot;Others&quot;, maar dat ze haar wilde helpen. Kate vindt in een kast netjes op hangers hangende kleding die de &quot;Others&quot; droegen. Ook vindt ze een plakbaard. Ze gaan terug naar het kamp en dan ziet ze dat haar baby weer beter is en dat het gewoon een koorts was.\n\nIn deze aflevering zit ook het verhaal van Jack en Locke die Henry Gale vasthouden, omdat ze vermoeden dat het iemand van de &quot;Others&quot; is. Mr. Eko komt er achter dat ze hem vasthouden en hij wil met die kerel praten. Hij vraagt vergiffenis omdat hij een paar van de &quot;Others&quot; heeft vermoord. Locke wordt ook kwaad, omdat hij geconfronteerd wordt met het feit, dat Jack eigenlijk al de touwtjes in handen heeft.  \n\n\n2-16 (41) &quot;The Whole Truth&quot; Sun Karen Gaviola Elizabeth Sarnoff &amp; Christina M. Kim  22 maart 2006 \nWe komen te weten dat Sun zwanger is. Uit flashbacks blijkt echter dat Jin geen kinderen kon krijgen. We krijgen ook te zien van wie Sun Engels geleerd heeft. \nAna-Lucia neemt het ondervragen van Henry Gale over van Jack en Sayid.\n\nAna-Lucia, Charlie en Sayid gaan op zoek naar de luchtballon van Henry. \n  ","torrent":{"xt":"urn:btih:312747cb47a16d4abcd60a8a37dbba6c2c362721","amp;dn":"LOST_Season2_DVD4_%28Retail%29%28MultiSub%29%28DVD9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"312747cb47a16d4abcd60a8a37dbba6c2c362721","infoHashBuffer":{"type":"Buffer","data":[49,39,71,203,71,161,109,74,188,214,10,138,55,219,186,108,44,54,39,33]},"announce":[],"urlList":[]}}