{"title":"Kourtney And Kim Take New York S04E10 (FINALE)","uid":6996945,"size":808040185,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:31949354e22677d2a6a2f4c90c47bae3dfa2c8a6&amp;dn=Kourtney+And+Kim+Take+New+York+S04E10+%28FINALE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"atndigcrk","files":3,"time":1327920400,"description":"Kourtney And Kim Take New York S04E10\n\njust out today - stayed till 4 am (CENTRAL TIME) tryin to rip this for u guys \nJanuary 23th Episode\n\nforget the description get it fast\n\nTHE LAST EP - IMMA MISS THIS SHOW HOPEFULLY NXT SEASON WILL COME QUICK\nand u know imma have it for ya see ya thx for downloading and seedin\n\nits a m4v rip itunes - i didnt feel like degrading the quality by converting to avi and uploading twice, i already cant play black ops bc my line is being tied up wit this tonite, so if u need avi get  a converter here ur self, as always its a itunes drm rip so playback gets better as the video goes, nothing i can do jus the drm ripped comes like dat \n\n\nSEASON NOTE:\nPLEASE dont anger me by saying its season 2 , lol \ni dont care what tvrage or rlslog, or the scene says, maybe the tv network is considering the other specials like miami and such to the season because itunes and there own tv network E! network says its season 4 so please dont remind me im going by what they say  \n\nenjoy!\n\n\t\t\nTHX USER:\n\n&quot;It shows it as season 4 because E! is counting these shows as the same:\nKourtney &amp; Khloe Take Miami as S01 &amp; S02\nKourtney &amp; Kim Take New York S03 &amp; S04\n\nThe Scene is recognizing them as 2 different shows, which means new season will start when a new show starts. It's not a big deal, E! just made shit confusing for everyone. \n\nBut uploader is following the right format for HIM. He is not scene. I see nothing wrong with his labels, and on top of that he takes the time to explain it to every single person that questions it...EVERY TIME HE UPLOADS AN EPISODE.\n\nTY atndigcrk for having these episodes up the fastest! I appreciate very much!&quot;&quot;\n\nSUPER FAST DOWNLOAD AS ALWAYS - STAY BACK FROM THE MONITOR HELPS ALOT ON PLAYBACK\t","torrent":{"xt":"urn:btih:31949354e22677d2a6a2f4c90c47bae3dfa2c8a6","amp;dn":"Kourtney+And+Kim+Take+New+York+S04E10+%28FINALE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31949354e22677d2a6a2f4c90c47bae3dfa2c8a6","infoHashBuffer":{"type":"Buffer","data":[49,148,147,84,226,38,119,210,166,162,244,201,12,71,186,227,223,162,200,166]},"announce":[],"urlList":[]}}