{"title":"Georg-With swastika to the Moon(nazi secret space program)(2008)","uid":7004357,"size":4851680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:337786346493241c8b584bd91ca1a800d04c83ae&amp;dn=Georg-With+swastika+to+the+Moon%28nazi+secret+space+program%29%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1328210812,"description":"For english-only speaking:\nThis book is in german language. English title would be: With swastika to the Moon - The suppressed truth about the Third reich's secret space program and its successors (2008). Friedrich Georg documents how the Third reich had its own secret space program and how the Germans launched satellites years before Sputnik ever circled the Earth. Was the first man in space in reality a German? Where did all the know-how for project Apollo come from and why has there been no such effort to send a man to space after it? Find out how all today's superpowers are using technological breakthroughs that really stem from the massive R&amp;D projects during World war 2 done secretly all around Germany. Has the secret space program behind the official one continued to this very day? 290 pages.\n\nFur Deutschsprachige:\nWar der erste Mensch im Weltraum ein Deutscher? Erinnern Sie sich noch an die Ã‚Â»ApolloÃ‚Â«-MondflÃƒÂ¼ge? Dann wird Ihnen nicht verborgen geblieben sein, dass es nach dem US-Mondlandeprogramm keine raumfahrttechnologische Weiterentwicklung mehr gab. Das Ã‚Â»Space ShuttleÃ‚Â«-Programm beispielsweise wird begleitet von laufenden, teilweise massiven oder sogar katastrophalen technischen Problemen. Die Probleme mit der Ã‚Â»modernenÃ‚Â« Raumfahrttechnik bestehen offensichtlich deshalb bis zum heutigen Tag, weil ihre Grundlagen auf deutschen Entwicklungen beruhen. Diese wurden nach dem Ende des Zweiten Weltkrieges von Amerikanern wie Russen gleichermaÃƒÅ¸en erbeutet, ohne jedoch bis ins letzte Detail verstanden worden zu sein. Ja, bei genauer Analyse der Situation drÃƒÂ¤ngt sich sogar der Schluss auf, dass alles, was wir heute aus der Luft- und Raumfahrt kennen, im Prinzip schon vor 1945 auf den deutschen ReiÃƒÅ¸brettern und in geheimen Entwicklungseinrichtungen vorhanden war. Daran ÃƒÂ¤ndert auch nichts, dass man nach Kriegsende erbeutete deutsce ReiÃƒÅ¸brettentwÃƒÂ¼rfe, Patente und Prototypen als Ã‚Â»neu erfundeneÃ‚Â« amerikanische oder russische Technik ausgab. 290 Seiten.\n","torrent":{"xt":"urn:btih:337786346493241c8b584bd91ca1a800d04c83ae","amp;dn":"Georg-With+swastika+to+the+Moon%28nazi+secret+space+program%29%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"337786346493241c8b584bd91ca1a800d04c83ae","infoHashBuffer":{"type":"Buffer","data":[51,119,134,52,100,147,36,28,139,88,75,217,28,161,168,0,208,76,131,174]},"announce":[],"urlList":[]}}