{"title":"Cyber Update Feb.2012------WP-18568  Ariel X &amp; Aiden Starr","uid":7006689,"size":834252367,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3383aa554bb1c196a103f55a76c8988516be0b57&amp;dn=Cyber+Update+Feb.2012------WP-18568++Ariel+X+%26amp%3B+Aiden+Starr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1328291681,"description":"From Kink.com    (Wiredpussy)  + Pics\n\n\n\nAiden Starr is what consultants would call an &quot;enlightened manager.&quot; She tries her best to be positive with the feedback she gives to her employees, empowers them with the information they need to succeed and gives them the latitude so they can thrive. Oh, and Aiden Starr's chosen field of work? Pimping prostitutes.\n \nBut like the old cliche says, pimping ain't easy. Despite being the sort of, ahem, &quot;manager&quot; that Birkenstock-wearing feminists believe would be different than pimps with a penis, even a pimp with a vagina knows that the reason why she's in business is to make money. Making political statements does not pay for Aiden's new Mercedes, after all.\n \nWhen Ariel X holds back on fees owed to Aiden, the short petite blonde doesn't mediate or contact HR. Aiden digs deep, brings out her inner pimp and turns her FemDom dial to 11. Rather than coaching Ariel and making her promise never to do it again, Aiden makes the lesson into a lesbian BDSM hell. With a cache of electrosex toys, Aiden makes sure she takes her fees out in the form of Ariel's ass.\n \nWith street smarts in addition to her smarts as a manager, Aiden knows this job isn't something she can delegate. Instead, she knows it's her responsibility to teach Aiden a lesson, through the help of a lot of electro BDSM and lesbian bondage, that she won't forget. Despite Ariel's insistence that she has learned never to hold back on her pimp, Aiden knows that the best lessons are learned through repetition. \n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=18568&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=18568&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:3383aa554bb1c196a103f55a76c8988516be0b57","amp;dn":"Cyber+Update+Feb.2012------WP-18568++Ariel+X+%26amp%3B+Aiden+Starr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3383aa554bb1c196a103f55a76c8988516be0b57","infoHashBuffer":{"type":"Buffer","data":[51,131,170,85,75,177,193,150,161,3,245,90,118,200,152,133,22,190,11,87]},"announce":[],"urlList":[]}}