{"title":"Bataan Rescue (TV) [2005] PBS","uid":6959133,"size":705062443,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:33bb5d6a84d5f27848739973a2317aa1108cd054&amp;dn=Bataan+Rescue+%28TV%29+%5B2005%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1326706185,"description":" &lt;a href=&quot;http://bayimg.com/OaLDMAAdo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/OaLDMAAdo&lt;/a&gt;\n\nThe American Experience  \n\nBataan Rescue\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0511738/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0511738/&lt;/a&gt;\n\nOriginal Air Date:7 July 2003 \n\nIn December 1944, more than five hundred American prisoners of war in a Japanese prison camp in the Philippines faced what they thought was certain death. After three years of brutal captivity, they believed their country had forgotten them. When they learned of the shocking slaughter of POWs by Japanese soldiers on nearby Palawan Island, they knew it would take a miracle to save them.\n\nIn just a few weeks that miracle would happen, in the form of an elite force of Army Rangers. With chilling testimony from both captive and liberator, Bataan Rescue tells the story of the most daring rescue mission of World War II.\n\nAttacked by the Japanese just hours after Pearl Harbor in 1941, American forces in the Philippines could not withstand the Japanese army's modern weaponry and superior supply lines. Thousands of American and Filipino troops retreated from Manila to the Bataan Peninsula where, cut off from food and ammunition, they had no choice but to surrender.\n\nIn captivity, the men were made to walk up to sixty miles to detention camps in what would become known as the Bataan Death March. Thousands perished along the way. &quot;Some of them just fell down in the road because of tiredness, nothing to eat,&quot; recalls Filipino veteran JosÃƒÂ© Juachon.\n\n&quot;Every one of us was sick,&quot; says former POW Richard Beck. &quot;I had a 104 fever. The man to my immediate right was executed because he couldn't keep up.&quot;\n\nTheir destination was the crowded prison camp at Cabanatuan, a breeding ground for malaria, beriberi, and other deadly diseases. The men were forced to work, breaking rocks or repairing roads in the oppressive heat. In the first months at Cabanatuan, disease, malnutrition, and exhaustion often claimed a dozen prisoners a night.\n\n &quot;I don't think the U.S. Army ever faced a foe quite like this before,&quot; says Hampton Sides, author of Ghost Soldiers. &quot;The Japanese Imperial Army believed it was the ultimate shame to fall into enemy hands. You were supposed to save your last round of ammunition for yourself. This influenced the way they treated the American POWs -- they were beneath contempt.&quot;\n\nFinally, the prisoners' plight was revealed to America for the first time, through newsreels using film footage captured from the Japanese. The Army mobilized the 6th Ranger Battalion for a rescue mission led by Colonel Henry Mucci, 32, dubbed &quot;little MacArthur&quot; by his men. The hot-tempered son of an Italian-American horsetrader, Mucci was &quot;one tough cookie,&quot; according to Ranger Robert Prince.\n\n&quot;He worked us so hard,&quot; recalls Ranger Bob Anderson, &quot;that sometimes you'd think, I hate that man.&quot; Ranger John Richardson says, &quot;I thought he was going to kill us.&quot;\n\nThe opportunity to put their training to work came in December 1944, when the Rangers landed in the Philippines and began an advance on the POW camp at Cabanatuan. Deep in Japanese territory, Mucci and his men would have to cross through enemy lines to reach the five hundred prisoners.\n\nThe Rangers plotted a careful, precise mission. Last-minute intelligence that nearly 8,000 Japanese troops had moved near the camp didn't deter them, although Mucci reluctantly did delay the attack by 24 hours. &quot;Before we went,&quot; says Richardson, &quot;they wanted to meet us in the chapel. Colonel Mucci says, I'm going to tell you this, probably all of you will come back -- or none.&quot;\n\nAs they drew close to the camp, the Rangers hit another snag: the high vegetation surrounding the camp on their map turned out to be flat rice paddies. The Rangers were fully exposed as they crawled toward the camp on their bellies, passing over American soldiers' graves in the dimming daylight.\n\nAt 7:40 p.m. -- ten nerve-wracking minutes behind schedule -- the Rangers opened up with their arsenal. &quot;I never heard so much fire in my life,&quot; says Richardson. Just 22 minutes after the first shot was fired, all 513 POWs were freed. On foot and in oxcarts borrowed from locals, the Rangers and the liberated captives made the thirty-mile journey back to American lines. A week later, they shipped out for home.\n\n&quot;That was a long wait, three years, we were just so happy to see them,&quot; says former POW Edward &quot;Tommie&quot; Thomas of his rescuers. &quot;They had restored our faith in America, in the soldiers, in the Army.&quot;\n\n","torrent":{"xt":"urn:btih:33bb5d6a84d5f27848739973a2317aa1108cd054","amp;dn":"Bataan+Rescue+%28TV%29+%5B2005%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33bb5d6a84d5f27848739973a2317aa1108cd054","infoHashBuffer":{"type":"Buffer","data":[51,187,93,106,132,213,242,120,72,115,153,115,162,49,122,161,16,140,208,84]},"announce":[],"urlList":[]}}