{"title":"The melancholy of Haruhi Suzumiya. Vol. 2","uid":6991200,"size":4682081936,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:340549f4c183b6bcc5bfb80e3d3afc41b6a308c0&amp;dn=The+melancholy+of+Haruhi+Suzumiya.+Vol.+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mike80219","files":3,"time":1327708583,"description":"Actors: Aya Hirano, Yuko Goto, Minori Chihara, Tomokazu Sugita, Daisuke Ono\n\nLanguage: English, Japanese \n\nWhen Kyon, the put-upon narrator of The Melancholy of Haruhi Suzumiya asks the title character why she's obsessed with time-travelers, aliens, and espers, she replies indignantly, &quot;What kind of fun does a normal high school student have?&quot; Haruhi's idea of fun doesn't jibe with Kyon's, but that doesn't matter. She's not only nuttier than he imagined, she's infinitely more powerful. Itsuki, the esper, tells Kyon that the existence of the entire universe may depend on Haruhi's whims. When she gets upset, dark gaps open between dimensions, haunted by shinji (ghostly giants) whom Itsuki and other espers must destroy. As the story progresses and more evidence of Haruhi's powers accumulates, Kyon wonders if he's having nightmares or protecting the world from destruction. His uncertainty adds an unsettling note to the off-beat mixture of comedy and fantasy that have made Melancholy of Haruhi Suzumiya so popular. The Limited Edition includes a second disc with the first episodes in their original broadcast order (in Japanese with English subtitles), an armband for the SOS club, an iron-on decal, a small pencil board, and a Bouken Desho Desho CD. (Rated 13 and older: cartoon violence, risquÃƒÂ© humor) --Charles Solomon \n\n[img]http://ecx.images-amazon.com/images/I/51oBD3DCVPL.jpg[/img]","torrent":{"xt":"urn:btih:340549f4c183b6bcc5bfb80e3d3afc41b6a308c0","amp;dn":"The+melancholy+of+Haruhi+Suzumiya.+Vol.+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340549f4c183b6bcc5bfb80e3d3afc41b6a308c0","infoHashBuffer":{"type":"Buffer","data":[52,5,73,244,193,131,182,188,197,191,184,14,61,58,252,65,182,163,8,192]},"announce":[],"urlList":[]}}