{"title":"Visidon AppLock Plus v1.6.1","uid":6995923,"size":4003226,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:364e222c8cb4372e76aa6240e4e203ad3aec255b&amp;dn=Visidon+AppLock+Plus+v1.6.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"StoneBoyTony","files":-1,"time":1327878154,"description":"Visidon AppLock Plus v1.6.1\n\n\n\n\n\nFast, convenient and cool way to protect your mobile with face recognition. Protect any application (i.e. SMS, Gallery, E-Mail, Facebook, etc.) on your phone using face recognition. Convenient and cool way to increase safety of your private apps and content\n\n/!\\ ROOT REQUIRED /!\\\n\nRequires Android: 2.3 and up + (ROOT)\n\nRelease Date: January 26, 2012\n\nINSTALLATION:\n\n1. Install Visidon_AppLock_Plus_v1.6.1.apk (Don't open after install!)\n2. Download LuckyPatcher.by.ChelpuS.v0.9.0 from here: http://thepiratebay.se/torrent/6986896/LuckyPatcher_by_ChelpuS_v0.9.0_\n3. Install LuckyPatcher.by.ChelpuS.v0.9.0.apk\n4. Run LuckyPatcher, find in the list the application and long press on the text and apply the &quot;Lucky Google Market Patch!&quot;. \n5. Restart your phone\n6. All done! Good Luck\n\n\nFast, convenient and cool way to protect your mobile with face recognition. Protect any application (i.e. SMS, Gallery, E-Mail, Facebook, etc.) on your phone using face recognition. Convenient and cool way to increase safety of your private apps and content.\n\nVisidon AppLock Plus lets you choose the apps to be protected. Your face is a key to open them! Application uses the frontal camera of your mobile and verifies in real-time that the face matches the one allowed to access the private apps.\n\nBy upgrading to Plus version you'll get:\n\n- No ads!\n- Pattern and PIN as alternative unlocking methods!\n- Haptic feedback for all alternative unlocking methods!\n- Experimental lockscreen feature (Read more important information about the lockscreen and some known issues from here:\n \n- Liveness detector, which guards against photograph spoofing!\n- Tasker/Locale integration!\n- More extra features in future versions!\n\n**NOTE**\n\nIf the newest version does not work, try to do clean install.\n\n\nPLEASE READ THESE NOTES AND TIPS:\n\n1. You must have a front facing camera in your device to use the face recognition feature. Otherwise it is disabled and you are only able to use password verification.\n\n2. In addition to the applications you wish to protect, you should also add Visidon AppLock Plus itself and any application that can be used to close or unistall applications or services (task manager, settings etc.) as well as any application that can be used to install new applications (market, myfiles etc.) to the protection list to get your mobile fully secured.\n\n3. If the preview image is upside down or sideways, please try the &quot;orientation displacement&quot; -setting.\n\n4. The default security level is medium. If it seems too low (i.e. other people can get in too easily), you can set it to maximum from the settings tab.\n\n5. The most accurate recognition will be achieved when all the training images are taken directly from front (i.e. no profile images etc.). Also, you should take training images in different illuminations (in those environments where you usually use your mobile). Sufficient amount of images per person is about 5 to 10.\n\n6. If you aren't using official release of Android, we cannot guarantee compatibility!\n\n7. If there is something wrong with the app, please consider sending us email and explaining the situation, so we have a chance to correct it.\n\n8. This application requires Android v2.3 at minimum, because frontal cameras are not supported in previous versions.\n\n9. If you have problems with this version (layout initialization failure etc.), please wipe app data or do a clean install.\n\n\n\nWhat's in this version:\n\nFixed annoying bug that caused glitching if the app was updated from older version. If this does not help, then just wipe the app data or do a clean install.\n\nWant to visit my other uploads?\n &lt;a href=&quot;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&lt;/a&gt; &lt;a href=&quot;\nhttp://thepiratebay.se/user/StoneBoyTony/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/StoneBoyTony/&lt;/a&gt;\n\nEnjoy and SeeD","torrent":{"xt":"urn:btih:364e222c8cb4372e76aa6240e4e203ad3aec255b","amp;dn":"Visidon+AppLock+Plus+v1.6.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"364e222c8cb4372e76aa6240e4e203ad3aec255b","infoHashBuffer":{"type":"Buffer","data":[54,78,34,44,140,180,55,46,118,170,98,64,228,226,3,173,58,236,37,91]},"announce":[],"urlList":[]}}