{"title":"The Hunt for Red October TBS","uid":6901854,"size":6921576775,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:36706189ba9936df3a189450f03af556224167f5&amp;dn=The+Hunt+for+Red+October+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"longdeer","files":-1,"time":1324422924,"description":"The Hunt for Red October\n\n\nNederlands:\nThe Hunt for Red October is een Amerikaanse film uit 1990,\ngeregisseerd door John McTiernan (Die Hard) en met in de hoofdrollen\nSean Connery en Alec Baldwin.\n\nDe film is gebaseerd op de gelijknamige roman van de Amerikaanse schrijver\nTom Clancy uit 1984, dat in het Nederlands is uitgeven onder de naam\nDe jacht op de Red October. Het verhaal is geÃƒÂ¯nspireerd op de muiterij in\n1975 aan boord van het Sovjet-Russische fregat Storoschewoi.\n\nConnery speelt Marko Ramius, commandant van de Red October, een moderne\nRussische kernonderzeeÃƒÂ«r. Baldwin is Jack Ryan, een Amerikaanse CIA-analist.\nBeide hoofdrolspelers waren tweede keus. Voor de rol van Marko Ramius had men aanvankelijk Klaus Maria Brandauer op het oog; voor de rol van Jack Ryan was\nKevin Costner gevraagd. Zij waren echter geen van beiden beschikbaar in de draaiperiode van de film; Costner draaide toen Dances with Wolves.\n\nHoewel de film bij verschijning in 1990 vooral negatieve kritieken oogstte,\nbracht hij toch 200 miljoen dollar op. Ook werd hij bekroond met de Academy\nAward voor Beste Geluidseffecten.\n\nKorte samenvatting:\n1.\nCIA-analist Jack Ryan beschikt over foto's van de Red October, een Russische\natoom-onderzeeÃƒÂ«r die twaalf meter langer en drie meter breder is dan alle\nandere duikboten. Erger is, dat de Red October aangedreven wordt door een zogenaamde 'stille' motor, waardoor de onderzeeÃƒÂ«r niet door de sonar van de Amerikanen kan waargenomen worden en zo vrijuit verscheidene Amerikaanse steden met de grond gelijk kan maken.\nJack acht de kans klein dat dit ooit gebeurt want Marko Ramius voert immers het bevel op de Red October. Marko heeft zich nooit echt loyaal opgesteld tegenover\nde Sovjet-Unie en sinds de dood van zijn vrouw heeft hij geen enkele band meer\nmet zijn vaderland...\n2.\nMidden in de nacht wordt CIA agent Jack Ryan voor een geheime missie opgeroepen naar aanleiding van een paar foto's van Rusland's nieuwste onderzeeÃƒÂ«r &quot;de Red October&quot;. Tijdens de eerste vaart van de Red October zet kapitein Ramius koers naar de Amerikaanse Oostkust. Volgens Jack Ryan wil Ramis overlopen, maar het Pentagon denkt daar anders over. Hun vermoeden wordt bevestigd, wanneer de Russische ambassadeur met de mededeling komt dat Ramius uit is op een eigen\noorlog met de VS. Amerika en Rusland zetten samen de achtervolging in en hun\nbeide vloten hebben dezelfde opdracht: &quot;Vernietig de Red October&quot;.\n\nEnglish:\nThe Hunt for Red October is a 1990 thriller film based on the novel of the same name by Tom Clancy. It was directed by John McTiernan and stars Sean Connery as Captain Marko Ramius and Alec Baldwin as Jack Ryan. The film received highly positive reviews from critics and was one of the top grossing films of the year, grossing $122 million in North America and $200 million worldwide. The film won the Academy Award for Best Sound Editing in 1991.\nPlot:\nSoviets create a new nuclear submarine that runs silent due to a revolutionary propulsion system. Russian sub captain defects, goal of taking it to the U.S.A.\nto prevent the Russians from using the sub to wreak nuclear (missile) war against the U.S. Lots of plot turns and twists in this high-tech thriller.\n\n\nCategorie: Beeld\nFormaat: DVD9\nSpeelduur: 129 minuten\nGenre: Thriller\nStandaard: PAL\nMenu: Ja\nCover: Ja\nGenre: Thriller\nTaal: Engels, Tsjechisch en Duits\nOndertiteling: Engels, Duits, Bulgaars, Deens, Fins, Hongaars, IJslands, Noors, Pools, Zweeds en Nederlands\n","torrent":{"xt":"urn:btih:36706189ba9936df3a189450f03af556224167f5","amp;dn":"The+Hunt+for+Red+October+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36706189ba9936df3a189450f03af556224167f5","infoHashBuffer":{"type":"Buffer","data":[54,112,97,137,186,153,54,223,58,24,148,80,240,58,245,86,34,65,103,245]},"announce":[],"urlList":[]}}