{"title":"Proceedings of a Workshop on Deterring Cyberattacks{BBS}","uid":6968294,"size":3225791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d6577768baf6bfee8122a9a186a072d58c3d88e&amp;dn=Proceedings+of+a+Workshop+on+Deterring+Cyberattacks%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1326997769,"description":"___________________________________________________________________________\n    ____                   ____                            __              \n    /   )    ,             /   )    /                    /    )            \n---/__ /---------__-------/__ /----/-----------__--------\\--------__----__-\n  /    )   /   /   )     /    )   /   /   /  /___)        \\     /___) /   )\n_/____/___/___(___/_____/____/___/___(___(__(___ _____(____/___(___ _(___(_\n                 /                                                         \n             (_ / \n___________________________________________________________________________\n\n***************************************************************************                                                         \n\nIn a world of increasing dependence on information technology, the prevention of cyberattacks on a nation's important computer and communications systems and networks is a problem that looms large. Given the demonstrated limitations of passive cybersecurity defense measures, it is natural to consider the possibility that deterrence might play a useful role in preventing cyberattacks against the United States and its vital interests. At the request of the Office of the Director of National Intelligence, the National Research Council undertook a two-phase project aimed to foster a broad, multidisciplinary examination of strategies for deterring cyberattacks on the United States and of the possible utility of these strategies for the U.S. government.\n\nThe first phase produced a letter report providing basic information needed to understand the nature of the problem and to articulate important questions that can drive research regarding ways of more effectively preventing, discouraging, and inhibiting hostile activity against important U.S. information systems and networks.\n\nThe second phase of the project entailed selecting appropriate experts to write papers on questions raised in the letter report. A number of experts, identified by the committee, were commissioned to write these papers under contract with the National Academy of Sciences. Commissioned papers were discussed at a public workshop held June 10-11, 2010, in Washington, D.C., and authors revised their papers after the workshop.\n\nAlthough the authors were selected and the papers reviewed and discussed by the committee, the individually authored papers do not reflect consensus views of the committee, and the reader should view these papers as offering points of departure that can stimulate further work on the topics discussed. The papers presented in this volume are published essentially as received from the authors, with some proofreading corrections made as limited time allowed.\nProduct Details\n\n    * Paperback: 400 pages\n    * Publisher: National Academies Press (September 30, 2010)\n    * Language: English\n    * ISBN-10: 0309160359\n    * ISBN-13: 978-0309160353","torrent":{"xt":"urn:btih:3d6577768baf6bfee8122a9a186a072d58c3d88e","amp;dn":"Proceedings+of+a+Workshop+on+Deterring+Cyberattacks%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d6577768baf6bfee8122a9a186a072d58c3d88e","infoHashBuffer":{"type":"Buffer","data":[61,101,119,118,139,175,107,254,232,18,42,154,24,106,7,45,88,195,216,142]},"announce":[],"urlList":[]}}