{"title":"HALO: Campaign Commander LAND BETA","uid":6881708,"size":324682610,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3dd87302942dba5877027ebe21b46b4d87fa1fac&amp;dn=HALO%3A+Campaign+Commander+LAND+BETA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Maverick2587","files":1,"time":1323650081,"description":"This beta includes the nearly finished land portion of the mod. It is being provided &quot;as-is&quot; for the purpose of publicity and bug/general feedback.\n\nt's been nearly 2 years of work and anticipation but the LAND BETA is finally here! Merry Christmas Halo fans! The beta ONLY supports land combat in skirmish mode. Galactic conquest has been disabled and space battles may cause crashes as that part of the mod has not been worked on yet.\n\nSome features of the beta are subject to change, depending on user feedback. Some features are also not yet finished and will be included when the space beta is released.\n\nHere is the README, for your benefit:\n\nReadme File:\n==========================================================\n\nJeff Cheney's &quot;HALO: Campaign Commander&quot;\nA total conversion mod for Forces of Corruption\n\n==========================================================\n\nINSTALL:\n\nSimply place the contained folder (Halo) into you Forces of Corruption, root directory &quot;Mods&quot; folder. ie: C:Program Files/Lucas Arts/Forces of Corruption/Mods\n\nIf you do not have one of these folders than create it yourself. After placing the contents in the correct place, move the contained shortcut to your desktop and make sure that the &quot;Target&quot; is located to the place you put the files. The part at the end (MODPATH=Mods/Halo) MUST be included in order for the mod to load when the game does.\n\nIf you have other mod files in your FoC Data folder, these will override anything that's in the Mods folder, so remove them or this mod may not work correctly.\n\nUNINSTALL:\n\nSimply delete all files to uninstall.\n\n--------------------------------------------\n--------------------------------------------\n\nWELCOME TO CAMPAIGN COMMANDER - LAND BETA:\n\nThe human race trembles beneath your feet as you march forth towards glorious salvation, conquering or burning all worlds in your path.\n\nDesperate odd call for daring heroes and ultimate sacrifices. Defend every world to the last as you fight for survival against a fanatic alien horde!\n\nHALO: Campaign Commander puts you in control of the mightiest armies that the UNSC or Covenant has to offer. Fight a single battle or pit yourself in endless skirmishes across an entire galaxy, using all the units you've come to love from the Halo universe.\n\nThis version of Campaign Commander is the first of two public betas. This first beta will allow players to 'field test' the land portion of the mod to find bugs, learn strategy, and leave feedback.\n\nNOTE:\nGalactic Conquest and Campaign modes have been temporarily disabled as space combat has not been worked on up to this point. If you attempt to play space battles, be aware that there is a high probability of a crash or program glitch. Please ONLY PLAY LAND BATTLES FOR THIS BETA.\n\nAlso, all land maps SHOULD work with this mod, even the original Star Wars maps. However, a single Halo map with accurate props has been included for the beta. To access it, click the &quot;enhanced&quot; button at the map selection screen. Select the halo map and play!\n\n--------------------------------------------\n--------------------------------------------\n\nLEGAL:\n\nAs with all mods, please don't take my stuff without permission. If you want to use any of this content in another mod, please e-mail me and we can work something out. Not all of this content is mine to give either so contact me and I can tell you who to get permission from if something isn't originally mine. Don't just copy and paste from the credits either...I've been known to make mistakes and some modders like to stay informed about their own stuff anyway.\n\nI am not liable in any way for ANY damage, loss of data, virus, male-ware, or any other harm that may come to your computer by using this mod. Though, frankly, if you get any of that from this than I would be very surprised...\n\n--------------------------------------------\n--------------------------------------------\n\nCONTACT:\n\nE-mail: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;670d020101270d02010102151e040f0209021e4904080a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nCREDITS:\n\nthe_Farseer (me): All props, textures, particle effects, animations, models, sounds and game mechanics that are not listed below or owned by Petroglyph or Bungie, were created solely by myself for this mod. This includes just about everything you will see on the screen with a few exceptions.\n\nCodeuser: Help with shaders, skinned heat shader fix\n\n.Corey.: Seraph model, warthog base model, Mongoose base model, Longsword model, and Hornet base model\n\nGotoprime: some elite voiceovers\n\nolly12345: Converting some Halo:CE sounds for use in the mod","torrent":{"xt":"urn:btih:3dd87302942dba5877027ebe21b46b4d87fa1fac","amp;dn":"HALO%3A+Campaign+Commander+LAND+BETA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd87302942dba5877027ebe21b46b4d87fa1fac","infoHashBuffer":{"type":"Buffer","data":[61,216,115,2,148,45,186,88,119,2,126,190,33,180,107,77,135,250,31,172]},"announce":[],"urlList":[]}}