{"title":"Democracy Now - 03 jan 2012","uid":6929439,"size":454556912,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3de76f7314e93a3a796153bdab683fc5ad1c419a&amp;dn=Democracy+Now+-+03+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1325609701,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 03, 2012\n\n- Obama Signs Defense Bill Allowing For Indefinite Detention of U.S. Citizens Without Trial\n- Iowa Holds First 2012 Presidential Caucus\n- Occupy Supporters in Iowa Stage Actions Against GOP Candidates, Obama\n- Scores of Occupy Protesters in New York City Arrested Following New Years Action\n- Iraq PM Declares National Holiday to Commemorate U.S. Troop Withdrawal\n- Egypt: Mubarak in Court, Accused of &quot;Tyrannical Rule&quot;\n- Egyptian Military Defends Office Raids of Human Rights, Civil Society Groups\n- Nigerian Protesters Demand Shell Clean Up Massive Oil Spill\n- Islamic Center Targeted in String of Firebombings in Queens\n- Federal Authorities Investigate Fire at Florida Abortion Clinic Previously Targeted With Violence\n- LAPD Arrests German Man in Connection With 53 Arson Fires\n- Iraq War Veteran Suspected in Park Ranger Killing Found Dead After Massive Manhunt\n- Seismologists: Fracking Linked to 11 Ohio Earthquakes Since March\n\n\nSpecial reports\n\n- Super PACs, Occupy Iowa Protests and a Surging Rick Santorum: Iowa GOP Caucus Begins 2012 Race\n\nIowa is awash in millions of dollars of negative campaign ads funded by so-called Super PACs as voters head to their caucuses in the first real test of the 2012 election. &quot;If you want to see the future of politics in America, turn on the television in Iowa,&quot; says John Nichols, correspondent for The Nation magazine. &quot;If it is this kind of overwhelming flood of negative ads, literally flipping on a dime to take down any candidate who rises in opposition to the mainstream, or kind of core Republican contender with the most money - it's a pretty scary picture. And it is one that suggests that if we don't get serious about addressing Citizens United [v. Federal Election Commission], we're going to end up with a much uglier, more destructive politics.&quot; Nichols estimates the candidates and their PACs spent &quot;$200 per vote&quot; in Iowa. The latest public opinion polls show Massachusetts governor Mitt Romney holding a narrow lead of 24 percent over Rep. Ron Paul and Rick Santorum. Nichols says Santorum's comments over the weekend about not wanting to &quot;make black people's lives better by giving them somebody else's money,&quot; highlight how Republican candidates have failed to reach out to Iowa's many minority communities. Meanwhile, the Occupy movement has tried to inject the voices of the 99 percent into the race by holding protests at events and both Republican and Democratic campaign headquarters throughout the state.\n\n\n- &quot;Pity The Billionaire&quot;: Thomas Frank on the &quot;Unlikely Comeback of the Right&quot; Ahead of Iowa Caucus\n\nBest-selling author and Harper's magazine columnist Thomas Frank argues that as President Barack Obama fails to provide a coherent, progressive economic alternative, the Right has staged an unlikely comeback - despite the ongoing fallout from the 2008 financial crisis for which its trademark polices were largely responsible. Frank's new book is called, &quot;Pity the Billionaire: The Hard-Times Swindle and the Unlikely Comeback of the Right.&quot; &quot;[Conservatives after 2008] didn't take the pundit's advice - they didn't move to the center, they didn't moderate themselves. They did the opposite,&quot; Frank says. &quot;They purged their moderate wings, moved dramatically to the right with the Tea Party movement and enjoyed this incredible success in the 2010 election.&quot; Frank says whether the conservatives will succeed in 2012 is still &quot;anyone's guess,&quot; and says Obama should &quot;start getting some of the rhetoric of the Occupy movement in there. He needs to start talking about the 1 percent. He needs to start talking about what has happened and why over the last 30 years.&quot; We also speak with The Nation correspondent John Nichols about the Occupy movement in Iowa.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;","torrent":{"xt":"urn:btih:3de76f7314e93a3a796153bdab683fc5ad1c419a","amp;dn":"Democracy+Now+-+03+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de76f7314e93a3a796153bdab683fc5ad1c419a","infoHashBuffer":{"type":"Buffer","data":[61,231,111,115,20,233,58,58,121,97,83,189,171,104,63,197,173,28,65,154]},"announce":[],"urlList":[]}}