{"title":"The New Southern Garden Cookbook {BBS}","uid":6857861,"size":3610560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f7895edaf7295876b3e86862716bd10190023c5&amp;dn=The+New+Southern+Garden+Cookbook+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1322767842,"description":"In The New Southern Garden Cookbook, well-known food writer Sheri Castle aims to make &quot;what's in season&quot; the answer to &quot;what's for dinner?&quot; This timely cookbook, with dishes for omnivores and vegetarians alike, celebrates and promotes the delicious, healthful homemade meals centered on the diverse array of seasonal fruits and vegetables grown in the South, and in most of the rest of the nation as well.\n\nIncreased attention to the health benefits and environmental advantages of eating locally, Castle notes, is inspiring Americans to partake of the garden by raising their own kitchen plots, visiting area farmers' markets and pick-your-own farms, and signing up for CSA (Community Supported Agriculture) boxes from local growers.\n\nThe New Southern Garden Cookbook offers over 300 brightly flavored recipes that will inspire beginning and experienced cooks, southern or otherwise, to take advantage of seasonal delights. Castle has organized the cookbook alphabetically by type of vegetable or fruit, building on the premise that when cooking with fresh produce, the ingredient, not the recipe, is the wiser starting point. While some dishes are inspired by traditional southern recipes, many reveal the goodness of gardens in new, contemporary ways. Peppered with tips, hints, and great stories, these pages make for good food and a good read.\n\n\n# Hardcover: 456 pages\n# Publisher: The University of North Carolina Press (May 4, 2011)\n# Language: English\n# ISBN-10: 0807834653\n# ISBN-13: 978-0807834657","torrent":{"xt":"urn:btih:3f7895edaf7295876b3e86862716bd10190023c5","amp;dn":"The+New+Southern+Garden+Cookbook+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7895edaf7295876b3e86862716bd10190023c5","infoHashBuffer":{"type":"Buffer","data":[63,120,149,237,175,114,149,135,107,62,134,134,39,22,189,16,25,0,35,197]},"announce":[],"urlList":[]}}