{"title":"Ballon dOr 2011 ceremony in High Definition","uid":6943832,"size":9124055328,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4027fb32551d5a5d4086f31d257bb7f52ff366eb&amp;dn=Ballon+dOr+2011+ceremony+in+High+Definition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Shepard76","files":-1,"time":1326142673,"description":"Lionel Messi has claimed the title of the world's best player for a third straight year after winning the FIFA Ballon d'Or at an awards gala in Zurich.\n\nBarcelonas 24-year-old Argentine striker beat team-mate Xavi and Real Madrids Cristiano Ronaldo to pick up the prestigious prize once again.\n\nMessi, man of the match in the UEFA Champions League final in 2011, also won the Primera Division, Spanish Supercopa, UEFA Super Cup and Club World Cup last year.\n\nXavi paid tribute to the winner, tipping Messi to go from strength to strength and take his place at the head of football\\'s pantheon of all-time legends.\n\n&quot;Hes still young, only 24, and I think hes going to break all the records that exist in this sport&quot; said the midfielder.\n&quot;Hes going to be one of the best footballers in the history of the sport&quot;\nGreat year\n\nManchester United's Wayne Rooney and Nemanja Vidic were both included in the world XI dominated by Spain-based players.\n\nThe FIFPro World XI was: Iker Casillas (Real Madrid), Dani Alves (Barcelona), Gerard Pique (Barcelona), Sergio Ramos (Real Madrid), Nemanja Vidic (Man Utd), Andres Iniesta (Barcelona), Xabi Alonso (Real Madrid), Xavi (Barcelona), Lionel Messi (Barcelona), Cristiano Ronaldo (Real Madrid), Wayne Rooney (Man Utd).\n\nRooney said at the gala: &quot;It was a great year and the highlight was winning the Premier League for the 19th time, which was a great moment for the club.&quot;\n\nBarcelonas Pep Guardiola was named coach of the year; Japans womens World Cup-winning captain Homare Sawa the womens player; Japans (male) manager Norio Sasaki coach of the year for women's football; the Japanese FA were awarded the FIFA fair play award; Brazilian 19-year-old sensation Neymar won the FIFA Puskas award for the best goal of 2011.\n\n\nFile video format: the entire gala is in HD (1440 x 1080) mp4 format.\nThere are other previous and post gala videos recorded in standard quality 720 x 576. \nIf you have problems reading the HD file try Video Lan player. This player should open the file perfectly.\n","torrent":{"xt":"urn:btih:4027fb32551d5a5d4086f31d257bb7f52ff366eb","amp;dn":"Ballon+dOr+2011+ceremony+in+High+Definition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4027fb32551d5a5d4086f31d257bb7f52ff366eb","infoHashBuffer":{"type":"Buffer","data":[64,39,251,50,85,29,90,93,64,134,243,29,37,123,183,245,47,243,102,235]},"announce":[],"urlList":[]}}