{"title":"[Eng sub] SP / Security Police The Motion Picture Yabo Hen [2010","uid":6916427,"size":734282209,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:428bd02e3ee4f2be0c3897f6394bd6f8b71c76da&amp;dn=%5BEng+sub%5D+SP+%2F+Security+Police+The+Motion+Picture+Yabo+Hen+%5B2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"timepink","files":-1,"time":1325050922,"description":"Release: SP.The.Motion.Picture.Yabo.Hen.2010.JAP.DVDRip.XviD-AXiNE\nLanguage: Japanese\nSubtitle: English\n\nTitle: SP: The Motion Picture (Yabo Hen)\nDirector: Takafumi Hatano\nWriter: Kazuki Kaneshiro\nRelease Date: October 30, 2010\nRuntime: 98 min.\nCountry: Japan\n\nThe Pitch\n\nThe SP here stands for Security Police and it centered around the trials and tribulation of a team of Japanese politicians bodyguards. SP first found life as a TV series (3rd Nov 2007 to 26th Jan 2008) and like many popular Japanese TV drama series these days, SP was made into 2 motion pictures (this being the first one).\n\nThe most interesting aspect of this movie (for someone who have not caught the drama series) would be that this movie topped the Japanese Box Office for 3 weeks (from 30th Oct to 14th Nov 2010)* and the follow up movie SP: The Motion Picture II is currently at the top too (3 straight weeks from 12 Mar to 27th Mar 2011)*. It's intriguing to find out what the drawing power that this franchise got on the Japanese audience that make them come back for more.\n\nPlot\n\nFor the uninitiated, SP: The Motion Picture basically introduced a team of Japanese politician bodyguards. The focus here lies on the team leader, Soichiro Ogata (Shin'ichi Tsutsumi / Suspect X) and one of the member Kaoru Inoue (Junichi Okada). Inoue stood out from the rest with his special &quot;ESP&quot; abilities to remember stuff, detect traps and even premonition. Needless to say, as the protagonist, he would go above and beyond the call of duty.\n\nThe plot thickens when Secretary General Kunio Date (Teruyuki Kagawa / 20th Century Boys series) gathered a group of politicians from various departments for a meeting to create crisis that would unite the Japanese citizen. Among the group, Ogata been tasked to carry out the plan and attempted to recruit Inoue for the sinister cause.\n\nIt's not hard to figure out how would the hero react to such invitation. Before he got time to ponder more about Ogata's unexplained cause, an emergency occurred and his team had been tasked to protect another Secretary who was making his way to the Prime Minister house. Let's just say that it won't be an easy mission for the hero and his team mates.\n\nSource: asianmediawiki.com\n\nTechnical Info\nFormat                           : AVI\nFile size                        : 700 MiB\nDuration                         : 1h 38mn\nOverall bit rate                 : 992 Kbps\n\nVideo\nFormat                           : MPEG-4 Visual\nBit rate                         : 850 Kbps\nWidth                            : 640 pixels\nHeight                           : 352 pixels\nDisplay aspect ratio             : 16:9\nFrame rate                       : 23.976 fps\n\nAudio\nFormat                           : MPEG Audio\nBit rate                         : 128 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz","torrent":{"xt":"urn:btih:428bd02e3ee4f2be0c3897f6394bd6f8b71c76da","amp;dn":"%5BEng+sub%5D+SP+%2F+Security+Police+The+Motion+Picture+Yabo+Hen+%5B2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"428bd02e3ee4f2be0c3897f6394bd6f8b71c76da","infoHashBuffer":{"type":"Buffer","data":[66,139,208,46,62,228,242,190,12,56,151,246,57,75,214,248,183,28,118,218]},"announce":[],"urlList":[]}}