{"title":"Summerhill_Drama.mp4","uid":6907902,"size":1546609062,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4378b68de063d409c5c9f51da2b1ad8c439f059d&amp;dn=Summerhill_Drama.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"telecal","files":-1,"time":1324667288,"description":"In 1999 Ofsted inspected the internationally famous \\'free school\\' Summerhill. Despite the fact that the school achieved higher than national average exam pass rates and an unprecedented level of parental and pupil satisfaction, Ofsted issued a notice of complaint effectively seeking the school\\'s closure. What lay behind this clash?\n\nSummerhill school was founded in 1921 by world-renowned educator A S Neill on the principles of self-regulation. The unique Suffolk based boarding school runs as a self-governing democratic community. Pupils (aged 5 to 16), teachers, live-in house parents and Headmistress Zoe Readhead, (Neill\\'s daughter) only possess one equal vote which they use during their thrice weekly school meetings to decide on all matters pertaining to the running of the school. This is no toothless school council. The amending, abolishing and making of rules, matters of discipline, extra-curricular activities etc, all are decided democratically, with a rotating chairperson drawn from the school\\'s entire community. The children police themselves, dealing with infractions of their multitudinous self-imposed laws with surprising compassion and wisdom. The only rule they cannot change is the prime principle upon which A S Neill founded the school; that no child should be compelled to attend any lesson that they do not choose freely by themselves. And it was this guiding principle, at odds with everything Ofsted and the newly elected Labour government\\'s \\&quot;education, education, education\\&quot; manifesto stood for, that put the highly successful school at the top of a hit list otherwise reserved for failing institutions.\n\nOfsted\\'s notice of complaint required the school to abandon the key freedoms it offered its pupils. Facing closure if it failed to comply, the school instead took Ofsted to court and fought for its survival.\n\nThis fast-paced vibrant drama is aimed at a broad audience and offers the suspense generated by its compelling true David and Goliath story with the emotion and humour of semi-fictionalised tales of personal transformation. Partly filmed at the real Summerhill school with Summerhillians taking some of the roles, the drama is inspired by real events and aims to entertainingly contribute to the wider national debate around the fundamental aims and methodology of education in the UK.\n\nCast &amp; Crew\nWritten by Alison Hume (Pure, The Vice, Rocket Man, New Tricks), produced by Stephen Smallwood (Murphy\\'s Law, Colditz, Cadfael), exec produced for Tiger Aspect by Greg Brenman (Billy Eliot, Robin Hood, Omagh), exec produced for the BBC and directed by Jon East (Bodies, Silent Witness, The Vice).\n\nMusic by Sheridan Tongue (Spooks, Silent Witness), Cinematography by Dave Marsh (Fear of Fanny, Bonekickers), Editing by Helen Chapman, (Murphy\\'s Law).\n\nThe cast includes Ron Cook (Hot Fuzz, Thunderbirds), Annette Badland (Doctor Who, Cutting It), Jessie Cave (Harry Potter and the Half-Blood Prince), Tracy Ann-Oberman (Sorted), Connor MacIntyre (Drop Dead Gorgeous). Richard Lintern (Syriana).","torrent":{"xt":"urn:btih:4378b68de063d409c5c9f51da2b1ad8c439f059d","amp;dn":"Summerhill_Drama.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4378b68de063d409c5c9f51da2b1ad8c439f059d","infoHashBuffer":{"type":"Buffer","data":[67,120,182,141,224,99,212,9,197,201,245,29,162,177,173,140,67,159,5,157]},"announce":[],"urlList":[]}}