{"title":"WireframeSketcher.Studio.v3.1.1.MacOSX-HERiTAGE","uid":6901597,"size":48862822,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:45e23fa5c265cb00a861ee3971d460c12f5c6f60&amp;dn=WireframeSketcher.Studio.v3.1.1.MacOSX-HERiTAGE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA","files":-1,"time":1324414310,"description":"WireframeSketcher Studio v3.1.1\n(c) WireframeSketcher\n\nSUPPLiER:    HERiTAGE                TYPE:          Utility\nPACKAGER:    HERiTAGE                # OF DiSKS:    10 x 5.00 MB\nPROTECTiON:  Gone                    RELEASE DATE:  20.12.2011\nCRACKER:    HERiTAGE                RATiNG:        Rate it yourself\n\nSYSTEM REQUiREMENTS:  PC/WinALL\n\nRELEASE NOTES:\n\nWireframeSketcher comes both as a standalone application but also as a\nplug-in for any Eclipse IDE. It's cross-platform and has a native and fast\nGUI on Windows, Mac OS X and Linux.\n\nWireframeSketcher is a software tool that helps product managers,\ndesigners and developers quickly create wireframes, mockups and prototypes\nfor desktop, web and mobile applications.\n\nMockup your website, desktop, Android and iPhone applications. Stencils of\nall kinds are shared by the community.\n\nStreamlined and professional interface lets you get results fast and with\ngreat effect. Sketchy look makes you focus on what's important.\n\nUse version control to work with your team. Present your prototype in\nfull-screen viewer. Share click-through PDFs with your clients.\n\nWith WireframeSketcher you get a rough, unfinished, hand-drawn look for\nyour mockups. This way your stakeholders won't be distracted by little\ndetails and you can focus on what's important. When needed, you can\ninstantly switch to a clean look.\n\nWireframeSketcher comes with an extensive set of UI controls. You'll find\nbuttons, checkboxes, trees, tables, you name it. Controls are very\nflexible and can be customized using properties and by applying wiki\nsyntax directly in text.\n\nThe interface is optimized for speed. Multiple shortcuts allow an\nefficient keyboard use. The properties view is streamlined to maximize\nyour efficiency. Position objects quickly with grid snapping and smart\nguides.\n\nUse linking to create interactive prototypes. Present your prototypes in\nfull-screen mode and click-through to show how the application or website\nis supposed work. Export your prototype to a clickable, high-quality PDF\nand let your clients test it themselves.\n\nWiki formatting lets you style any widget that supports text. Using a\nsimple syntax you can make bits of text bold, italic, underlined and even\ninsert icons to make checkboxes, radio buttons and more. Syntax\nhighlighting saves you from getting lost in your text.\n\nMissing a widget? Want to include a logo? WireframeSketcher lets you use\nyour own images. Color images can be conveniently drawn in black and white\nto blend in with the overall look of the wireframe. And the best thing -\nyou can use SVG vector graphic images which will even automatically get\nthe hand-drawn look.\n\nWireframeSketcher comes with more than 180 icons for your to choose from.\nIcons come in vector format that works at any size, can be colored and can\nbe used virtually anywhere. Just hit CtrlSpace while editing a widget's\ntext.\n\nDo you need a common template for all your screens? Want to reuse that\nstandard dialog in multiple places? Use components to do just that.\nChanges to components propagate automatically and are instantly visible in\nall the screens that use them. You can put them in the palette and create\nentire reusable stencils.\n\nStoryboard your use-cases and show how the UI responds to user actions and\nchanges in time. Use storyboards to make slideshow presentations and\nexport multi-page, interactive PDFs or HTML.\n\nNeed to discuss an idea without the rest of the IDE getting in your way?\nWant to make a presentation of the prototype to your client? The\nfull-screen presentation mode is one mouse click away. Want to send around\nyour wireframes and storyboards? Just export your wireframes to a\nhigh-quality PDF, HTML or PNG and you are all set. You can always print\nout your wireframes on paper and then discuss them with your clients face\nto face.\n\nMake use of the user-contributed Mockups Gallery to jump-start your\nmockups and to get inspiration from. Find Android, iPhone, iPad stencils\nand other useful resources and share your own contributions with the\ncommunity.\n\nWireframes are stored in an open XML-based format. You can easily store\nyour screens under version control and use standard Eclipse tools to track\nchanges and to perform diffs and merges when needed. Create your own tools\naround this format by using the open-source SDK.\n\nEnjoy another fine release from HERiTAGE\n\nINSTALL NOTES:\n\nUnpack the archive in your location of choice.\nCopy the file from the Crack folder into WireframeSketcher Studioplugins\nand overwrite the existing file with our included cracked one.\nSimply launch the executable to get started.","torrent":{"xt":"urn:btih:45e23fa5c265cb00a861ee3971d460c12f5c6f60","amp;dn":"WireframeSketcher.Studio.v3.1.1.MacOSX-HERiTAGE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45e23fa5c265cb00a861ee3971d460c12f5c6f60","infoHashBuffer":{"type":"Buffer","data":[69,226,63,165,194,101,203,0,168,97,238,57,113,212,96,193,47,92,111,96]},"announce":[],"urlList":[]}}