{"title":"Interracial Payload 3 (2012)","uid":6975253,"size":1461182868,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4635ff7c9c4260a68551f032e47ca5eb96c0b0b9&amp;dn=Interracial+Payload+3+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1327233327,"description":"Interracial Payload 3 (2012)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/3004163D3_Inter-Racial_Payload_3_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/3004163D3_Inter-Racial_Payload_3_dvd.htm&lt;/a&gt;\n\nTitle: Interracial Payload 3\nOriginal title: Interracial Payload 3\nReleased: 2012\nCountry: USA\nGenre: All Sex Movies, Anal, Interracial, Threesomes &amp; More, Big Dicks\nStudio: Evil Angel\nDirected by: John Leslie\nStarring: Caroline Pierce, Kaci Starr, Mia Bangg, Ann Marie, Cindy, Elizabeth Delmar, Alexxxis Tyler, Tommi Rose, Ryan\n\nDescription: \nThe late smut master John Leslie was always keen to explore the taboo electricity created when gorgeous, sex-crazed babes reject society's color barriers and abandon themselves to big, black dick! J.L. used his famous eye for erotic composition to examine the sexual possibilities of such raw magnetism. Now seven of his hottest scenes have been collected in &quot;Inter-Racial Payload 3,&quot; a compilation of forbidden lust starring much of Mr. Leslie's biggest and blackest male talent, along with some of the most beautiful and adventurous sluts he's ever shot. Pale, big-assed wench Caroline Pierce fucks herself with black dildos before taking the brunt of chocolate stud Wesley Pipes. The sultry redhead gets a ferocious pounding and a nasty cum facial. Next, seductive, sleek Ryan is a dark-haired, cock-hungry whore who joins blonde cutie Alexxxis Tyler in servicing two huge black dicks. Alexxxis gets a mouthful of sperm, and Ryan takes a shot of hot cum directly on her reamed-out asshole. Cherubic, curvy teen Kaci Starr offers her soft titties, pretty mouth and plump, cushy ass to two well-hung gentlemen who double-stuff her with thick meat. Stunning and all natural, red-haired Tommi Rose works her mouth and pussy all over Mr. Marcus' giant pole. Busty, all-real Mia Bangg gets anally railed and double-penetrated by a pair of black brutes; petite Latina Ann Marie and blonde Elizabeth Delmar team up to pleasure Sledge Hammer's huge member; and glamorous Euro-slut Cindy gets a sensuous, three- way anal treat. This &quot;Payload&quot; delivers!\n\nQuality: DVDRip\nFormat: AVI\nVideo: 576x320 (1.80:1), 29.970 fps, XviD build 55 ~ 837 kbps avg, 0.15 bit / pixel\nSound: 48 kHz, MPEG Layer 3, 2 ch, ~ 125.74 kbps avg\nSize: 1.36 Gb","torrent":{"xt":"urn:btih:4635ff7c9c4260a68551f032e47ca5eb96c0b0b9","amp;dn":"Interracial+Payload+3+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4635ff7c9c4260a68551f032e47ca5eb96c0b0b9","infoHashBuffer":{"type":"Buffer","data":[70,53,255,124,156,66,96,166,133,81,240,50,228,124,165,235,150,192,176,185]},"announce":[],"urlList":[]}}