{"title":"Mount.and.Blade.Warband-SKIDROW","uid":16046665,"size":331381216,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:48611732d19dbd1c84288fe03fe4c37461de9a51&amp;dn=Mount.and.Blade.Warband-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lkicsihuszari","files":1,"time":1476575801,"description":"\nRelease Notes:\r\n\r\nThe Skid Rowdies are looking new blood to fill up the ranks.\r\nWe're a professional team of dedicated sceners with big mark\r\nunder sceners. We believe on the ground idealism of the root\r\nof the real old school scene. We do all this for fun and\r\nnothing else. We don't earn anything on our hobby, as we do\r\nthis for the competition and the heart of what got the scene\r\nstarted in the mid eighties.\r\n\r\nIf you think you got something to offer, then don't hold back\r\non contacting us as soon as possible.\r\n\r\ntwice the fun   / double the trouble\r\n\r\nOn with the game release information:\r\n\r\nIn a land torn asunder by incessant warfare, it is time to\r\nassemble your own band of hardened warriors and enter the\r\nfray. Lead your men into battle, expand your realm, and claim\r\nthe ultimate prize: the throne of Calradia! Mount &amp; Blade:\r\nWarband is the eagerly anticipated sequel for the game that\r\nbrought medieval battlefields to life with its realistic\r\nmounted combat and detailed fighting system.\r\n\r\nGraphical overhaul: Support added for HDR, FSAA, depth of\r\nfield, soft particles, tone mapping, and many other effects\r\n\r\nNew models with greater detail and high-quality textures\r\n\r\nMultiplayer battles with up to 64 players. Multiplayer modes\r\ninclude Deathmatch, Team Deathmatch, Capture the Flag,\r\nConquest, Battle, and Siege\r\n\r\nA campaign allowing you to become the ruler of a faction and\r\nconvince lords to become your vassals\r\n\r\nThe ability to upgrade your companions to vassals by granting\r\nthem lands\r\n\r\nThe ability to marry a lady of the realm for romance or cold\r\npolitical gain. Try to win a ladys heart through poetry or\r\nbravery\r\n\r\nImproved mechanics for soldier morale: Soldiers will break and\r\nrun away if their morale gets too low\r\n\r\nPick any projectile off the battlefield for use as additional\r\nmunitions\r\n\r\nNew motion-captured combat animations\r\n\r\nNumerous improvements to the combat system: Your shield will\r\nstill stop arrows even if you are not actively defending\r\n\r\nThe ability to play multiplayer matches on random maps as well\r\nas hand-designed ones\r\n\r\nMultiplayer equipment system: Earn money by fighting opponents\r\nor accomplishing goals\r\n\r\nThe ability to use most throwing weapons in close combat:\r\nSwitch to using a javelin as a short spear when the enemy gets\r\nclose\r\n\r\nSpend gold on more powerful equipment, using a carefully\r\nbalanced system that will make combat more exciting without\r\ngiving too much of an advantage to the leading team\r\n\r\nInstall Notes:\r\n\r\n1. Unpack release\r\n2. Mount image or burn it\r\n3. Install\r\n4. Copy the content from the SKIDROW folder on the CD to your\r\ninstallation directory and overwrite\r\n5. Play the game","torrent":{"xt":"urn:btih:48611732d19dbd1c84288fe03fe4c37461de9a51","amp;dn":"Mount.and.Blade.Warband-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48611732d19dbd1c84288fe03fe4c37461de9a51","infoHashBuffer":{"type":"Buffer","data":[72,97,23,50,209,157,189,28,132,40,143,224,63,228,195,116,97,222,154,81]},"announce":[],"urlList":[]}}