{"title":"Cyber Update Des.2011-------WP-16792  Isis Love and Ashlynn Le","uid":6894378,"size":735594333,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4c63b1ccf97e89fde326e49b95de1fbd0f8cfab4&amp;dn=Cyber+Update+Des.2011-------WP-16792++Isis+Love+and+Ashlynn+Le&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":197,"time":1324139568,"description":"From Kink.com    (Wiredpussy)  + Pics\n\n\n\n\nIn a city like San Francisco, smoking cigarettes is a crime without comparison. While thieves, murderers and bankers might be taught the error of their ways and rehabilitated, the smoker is a degenerate who deserves no mercy. Or so teacher's assistant Ashlynn Leigh learns when Bobbi Starr, the dean, catches her while taking a few drags and thinking about flavor country in the locker room. As punishment for the facility's strict no-smoking policy and for possibly corrupting the students, Bobbi places Ashlynn in a rehabilitation center for 24 hours. Though she protests, the need for a paycheck outweighs her sense of injustice about the situation. In the rehabilitation center, head warden Isis Love lays down the rules on the otherwise indifferent Ashlynn. Restraining her with handcuffs, Isis shows how the tools of her trade can be the agents of pleasure and pain. Ashlynn is teased with Tasers, sparking with electricity while she removes her clothes for the prurient interests of the warden. Rehabilitation is far from her mind and to start, Ashlynn's elbows and chest are wrapped, framing her tits for Isis to play with. Then, with legs spread-eagled on a bed, Isis takes control of Ashlynn's muscles, the current causing them to spasm at her will. But Isis can't resist administering as much gratification as she does discomfort, fucking Ashlynn's worn pussy with an acrylic plug. Isis concludes the sentence with a metal plug in Ashlynn's ass and a dick-on-a-stick in her cunt, double penetrating her while tied in doggy. \n\n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=16792&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=16792&lt;/a&gt;\n\n\nCheerz  :-)","torrent":{"xt":"urn:btih:4c63b1ccf97e89fde326e49b95de1fbd0f8cfab4","amp;dn":"Cyber+Update+Des.2011-------WP-16792++Isis+Love+and+Ashlynn+Le","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c63b1ccf97e89fde326e49b95de1fbd0f8cfab4","infoHashBuffer":{"type":"Buffer","data":[76,99,177,204,249,126,137,253,227,38,228,155,149,222,31,189,15,140,250,180]},"announce":[],"urlList":[]}}