{"title":"Mastodon Discography (2016) @320kbps","uid":15807442,"size":1566226253,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50b3a1c6e33730b79118f7768ac03b097ac00ea4&amp;dn=Mastodon+Discography+%282016%29+%40320kbps&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":23,"uploader":"Vogard7A","files":154,"time":1473575828,"description":"Mastodon Discography\r\n\r\n\r\nStudio songs are always at 320kbps for all Vogard7A torrents.\r\n\r\n\r\nMastodon is an American heavy metal band from Atlanta, Georgia, formed in early 2000 and composed of bassist Troy Sanders, guitarists Brent Hinds and Bill Kelliher and drummer Brann Dailor. Their musical style features progressive concepts and unique instrumentation. All four members participate in vocals, creating a unique blend of singing styles and voices.\r\n\r\nMastodon cross multiple heavy metal genres such as progressive metal, sludge metal, alternative metal, stoner rock, experimental metal, and groove metal. James Christopher Monger of Allmusic describes Mastodon as &quot;one of the more notable New Wave of American Heavy Metal acts, a genre spawned in the mid-'90s&quot; and says that &quot;Mastodon's innovative, lyrically astute blend of progressive metal, grindcore, and hardcore helped position the band as one of the preeminent metal acts of the early 21st century.&quot;\r\n\r\n\r\nAlbums included:\r\n2000 - 9 Song Demo [Demo]\r\n2002 - Remission\r\n2004 - Leviathan\r\n2006a - Call of the Mastodon [Compilation]\r\n2006b - Blood Mountain\r\n2009 - Crack the Skye\r\n2010 - Jonah Hex Revenge Gets Ugly [EP]\r\n2011a - Live at the Aragon [Live]\r\n2011b - The Hunter\r\n2014a - Live at Brixton [Live]\r\n2014b - Once More 'Round the Sun\r\nRare &amp; Misc\r\n\r\n\r\n\r\n1. All studios songs must be present at 320kbps.\r\n2. Demos are not required, but if included they will be included as duplicates.\r\n3. Live albums are not required, but will be included if not difficult to find.\r\n4. If acoustic or instrumental versions are rare, then it is not necessary to include them.\r\n5. If some songs were never released in an LP or EP, i.e. from a soundtrack, then a &quot;Rare and Misc&quot; folder will include the overflow. Number is based on date they were created. If some songs were only ever included in Singles, they may or may not get a Single album, based on judgement.\r\n6. The goal is to be able to open a folder from your music player and have all of the songs available without duplicates. Because of this I will not include an identical song twice, with priority given to older album &gt; newer album &gt; EP &gt; Single.\r\n7. Metadata for all songs are edited by hand gathering information from sources like Wikipedia or Discogs.\r\n8. All Discographies are to be updated once a year in case of new albums, with the latest year in the title of the torrent.\r\n9. NEVER mention the name Vogard7A in any metadata or comments. I share music, I don't need to stamp my name on other peoples' great work.\r\n10. Include a playlist with my favorite songs from each band! You can delete this if it gets in the way.\r\n\r\nIf there are any errors (not subjective opinions about organization) drop a comment and I'll look at it before updating the Discography next year!","torrent":{"xt":"urn:btih:50b3a1c6e33730b79118f7768ac03b097ac00ea4","amp;dn":"Mastodon+Discography+%282016%29+%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50b3a1c6e33730b79118f7768ac03b097ac00ea4","infoHashBuffer":{"type":"Buffer","data":[80,179,161,198,227,55,48,183,145,24,247,118,138,192,59,9,122,192,14,164]},"announce":[],"urlList":[]}}