{"title":"Galaxy Angel Season 1","uid":6963206,"size":3786705260,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:52dd3ce44f202d94863b1dd7af4ae4e6ee399013&amp;dn=Galaxy+Angel+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Garules7","files":27,"time":1326831984,"description":"Galaxy Angel Season 1\n\n// The Galaxy Angel anime series, produced by BROCCOLI, Madhouse and Bandai Visual, premiered across Japan on Animax between 7 April 2001 to 29 September 2001, and was soon followed by numerous sequels, including a second series (&quot;Z&quot;), a third series (&quot;A&quot;, &quot;AA&quot;, and &quot;S&quot;) and a fourth (&quot;X&quot;). Each broadcast is made up of two fifteen minute episodes, whose titles always contain references to food. The first series was broadcast by Animax, while later series have been broadcast by TV Osaka and other TXN stations. Internationally, the series has been broadcast by Animax and its respective networks worldwide, including its English language networks in Southeast Asia and South Asia, and its other networks in Hong Kong, Taiwan, South Korea and Latin America. In the US, this series is distributed in DVDs from Bandai Entertainment.\n\nThe story is about a group of women and girls who go on government-sponsored humanitarian missions as the Angel Troupe (Angel-tai) to search for Lost Technology, generally a plot device to set up amusing and absurd humor typical of the show, rife with obscure Japanese puns. Many of the devices look like extremely mundane objects like sticks or rice cookers, but have fantastic powers like mutating organisms or as destructive weapons. //\n\n- From Wikipedia\n\n\n\nEnjoy and PLEASE SEED!!!","torrent":{"xt":"urn:btih:52dd3ce44f202d94863b1dd7af4ae4e6ee399013","amp;dn":"Galaxy+Angel+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52dd3ce44f202d94863b1dd7af4ae4e6ee399013","infoHashBuffer":{"type":"Buffer","data":[82,221,60,228,79,32,45,148,134,59,29,215,175,74,228,230,238,57,144,19]},"announce":[],"urlList":[]}}