{"title":"Supernatural S07E04-E05-E06 720p HDTV (NL Subs) TBS","uid":6952494,"size":3402351313,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:5386e8854ceff50be64b7450baaca3889c09a7d3&amp;dn=Supernatural+S07E04-E05-E06+720p+HDTV+%28NL+Subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vlinder.","files":-1,"time":1326454183,"description":"Supernatural S07E04-E05-E06 720p HDTV (NL Subs) TBS\n\n \n\nSupernatural is een Amerikaanse serie van de zender The WB. De serie ging in premiÃƒÂ¨re op 13 september 2005. \n\nSupernatural gaat over de broers Winchester die het bovennatuurlijke kwaad bestrijden. Ze nemen hierbij de taak van hun vader John over, \ndie hiermee begonnen is om de dood van zijn vrouw te wreken. Dankzij hun vader groeien Sam en Dean op als demonenjagers. \nIn elke aflevering lossen Dean en Sam een mysterie op door met een bovennatuurlijke tegenstander af te rekenen. Mysteries draaien meestal om kwaadaardige geesten, \nmaar ook vampiers, weerwolven en andere demonen moeten worden verslagen.\nMysteries spelen zich af door heelAmerika heen. Dit betekent dat elke aflevering zich in een andere stad of dorp afspeelt, wat de serie een extra dimensie geeft. \nOmdat Dean vliegangst heeft, rijden de broers per auto van stad naar stad. Dean's 67 Chevy Impala is dan ook, na zijn broer Sam, het meest dierbare in zijn leven.\nElke aflevering is een op zichzelf staand verhaal, maar draagt ook bij aan de langere verhaallijn van elk seizoen. \nZo draait het eerste seizoen bijvoorbeeld om het doden van de demoon met de gele ogen. \nSommige afleveringen behandelen bekende Amerikaanse urban legends zoals de vijfde aflevering Bloody Mary of de zevende aflevering Hookman.\n\nSupernatural is an American series of the channel The WB. The series premiered on september 13, 2005. \n\nSupernatural is about the brothers Winchester that the supernatural combat evil. They take on the task of their father John, who started to avenge the death of his wife. Thanks to their father grow Sam and Dean as demons hunters. \nIn each episode resolve Dean and Sam on a mystery opponent by with a supernatural. Mysteries usually rotate but also malicious spirits, vampires, werewolves and other demons must be defeated.\nMysteries are set by heelAmerika. This means that each episode is in another city or village, what the series gives an extra dimension. \nBecause Dean has fear of flying, driving the brothers per car from city to city. Dean's 67 Chevy Impala is therefore, after his brother Sam, the most precious in his life.\nEach episode is a self-contained story, but also contributes to the longer storyline of each season. \nSo runs the first season for example, killing the demon with the yellow eyes. \nSome episodes deal with well-known American urban legends such as the fifth episode Bloody Mary or the seventh episode Hookman.\n\n\ninfo:\n\nFormaat....: x264HD  \nBron.......: HDTV  \nTaal.......: Nederlands ondertiteld (instelbaar)  \nAudio......: Engels gesproken\nGenre......: TV Series  \n \n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0460681&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0460681&lt;/a&gt;\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n  &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\t","torrent":{"xt":"urn:btih:5386e8854ceff50be64b7450baaca3889c09a7d3","amp;dn":"Supernatural+S07E04-E05-E06+720p+HDTV+%28NL+Subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5386e8854ceff50be64b7450baaca3889c09a7d3","infoHashBuffer":{"type":"Buffer","data":[83,134,232,133,76,239,245,11,230,75,116,80,186,172,163,136,156,9,167,211]},"announce":[],"urlList":[]}}