{"title":"Celestial Bodies LiveWallpaper v3.7.7","uid":6991596,"size":2129966,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:53afaf27e7acb85506e5ba2cf418abc5ac9a98f2&amp;dn=Celestial+Bodies+LiveWallpaper+v3.7.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"StoneBoyTony","files":-1,"time":1327723884,"description":"Celestial Bodies LiveWallpaper v3.7.7\n\n\n\nRequires Android: 2.1+ \n\nRelease Date: January 27, 2012\n\n\nDescription\n\n3D Live Wallpaper of the solar system. Highly customizable. Music visualization.\nDo you love space? Are you tired of staring at pictures of your loved ones? Have other live wallpapers let you down with their uninspired lacklustery?\n\nA yes or no answer to any of the previous questions probably means you will love this live wallpaper.\n\nCelestial Bodies is a fully animated solar system including planets with cloud layers and moons, an asteroid belt, a complex star with coronal ejections, and of course it wouldn't be the 21st century without an over-the-top lens flare effect!\n\nA complex view transition system keeps the scene fresh and dynamic unlike other static and stale wallpapers. It's like three-dimensional and stuff!\n\nFully interactive. Bored in your meeting? Ignoring your spouse? Stuck in a snowstorm with no reception? Fling yourself to another world. Swipe and poke your way through the solar system. You've probably done less productive things with your time!\n\nHighly customizable. So many settings you'll probably need instructions. You're in luck as those are included! Don't like instructions? You are further in luck as the default settings are pretty great already!\n\nBecause you're awesome you've decided either to upgrade from the lite version or have come straight to the cow demanding your $1.25 of precious milks.\n\nThis full version is way better. For instance now you can create totally new random solar systems with random planetary characteristics. One poke in the center of the screen and an entire system is vaporized in an all-consuming supernova before birthing a new system in its wake. Pick up your jaw there is more.\n\nSpruce up the bland of black and white starfields with a variety of colorful nebulae. Watch a comet zip by and further demonstrate an unhealthy obsession with lens flare effects.\n\nBut certainly best of all is the music visualization. Responding to audio playback on your device the star will bulge and pulse a variety of colors while the paths of the planets dance out the waveform.\n\nIf you haven't been convinced yet then you owe it to yourself to scroll to the top of this description and read it again. Or just try it out for few minutes. Throw some time on this space...\n\n*How to open: Home &gt; Menu &gt; Wallpapers &gt; Live Wallpapers\n\nWhat's in this version:\n\n&gt; 3.7.7:\n- re-worked particles image and removed spin\n- fixed rainbow burst, clouds on Earth, &amp; settings screen on ICS\n&gt; 3.7.3:\n- updated music visualization (currently for 2.3+ devices only)\n- added orbital rings (enable in settings)\n- restructured codebase to finally share between lite and full versions\n- significant performance optimizations\n- added different particle shapes to solar flares and added spin\n- modified lens flare\n\n\nWant to visit my other uploads?\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/StoneBoyTony/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/StoneBoyTony/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kat.ph/user/StoneBoyTony/uploads/&lt;/a&gt;\n\nEnjoy and Please SeeD :)","torrent":{"xt":"urn:btih:53afaf27e7acb85506e5ba2cf418abc5ac9a98f2","amp;dn":"Celestial+Bodies+LiveWallpaper+v3.7.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53afaf27e7acb85506e5ba2cf418abc5ac9a98f2","infoHashBuffer":{"type":"Buffer","data":[83,175,175,39,231,172,184,85,6,229,186,44,244,24,171,197,172,154,152,242]},"announce":[],"urlList":[]}}