{"title":"Discourses on Livy by Niccolo Machiavelli (Oxford Classics)","uid":16024521,"size":1723696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:577f13776e942088772aa46ff05851a974376015&amp;dn=Discourses+on+Livy+by+Niccolo+Machiavelli+%28Oxford+Classics%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476368949,"description":"Discourses on Livy (Oxford Classics) - Niccolo Machiavelli [epub]\r\n\r\nDiscourses on Livy, written in 1531, is as essential to an understanding of Machiavelli as his famous treatise, The Prince. Equally controversial, it reveals his fundamental preference for a republican state.\r\n\r\nComparing the practice of the ancient Romans with that of his contemporaries provided Machiavelli with a consistent point of view in all his works. Machiavelli's close analysis of Livy's history of Rome led him to advance his most original and outspoken view of politics - the belief that a healthy political body was characterized by social friction and conflict rather than by rigid stability.\r\n\r\nHis discussion of conspiracies in Discourses on Livy is one of the most sophisticated treatments of archetypal political upheaval ever written. In an age of increasing political absolutism, Machiavelli's theories became a dangerous ideology.\r\n\r\nThis new translation is richly annotated, providing the contemporary reader with sufficient historical, linguistic, and political information to understand and interpret the revolutionary affirmations Machiavelli made, based on the historical evidence he found in Livy","torrent":{"xt":"urn:btih:577f13776e942088772aa46ff05851a974376015","amp;dn":"Discourses+on+Livy+by+Niccolo+Machiavelli+%28Oxford+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577f13776e942088772aa46ff05851a974376015","infoHashBuffer":{"type":"Buffer","data":[87,127,19,119,110,148,32,136,119,42,164,111,240,88,81,169,116,55,96,21]},"announce":[],"urlList":[]}}