{"title":"The Sound of Music (1965)  XviD  (moviesbyrizzo) MULTI audio","uid":6898580,"size":2743075793,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5867429d557543b3b7598e62d628f2880c9ab993&amp;dn=The+Sound+of+Music+%281965%29++XviD++%28moviesbyrizzo%29+MULTI+audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1324303124,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0059742/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0059742/&lt;/a&gt;\n\nfullscreen format (same as our 1080p from which we made this standard XviD vers)\n720 X 404 resolution at 1305k video bitrate 256k mp3 english audio track and \nsupplementary 128k audio tracks to watch the movie in \n\nGerman\nItalian,\nSpanish  \nRussian \n\n(English subtitles included) all audio converted from DTS to mp3 as ac3 tends\nto be more muted in volume power\n\nWe didn't find French audio on the disc for some godforsaken reason - sorry!\n\nThere were lots of various euro subtitles on the bluray disc file we obtained,\nRussian and Ukrainian were also there,  however they are bloated sup image format\nfiles amounting to over half a gigabyte overall when only a mere one tenth of one\npercent of that was needed if they had only used sensible srt formatted text files\ninstead I suppose. We will do what we can to convert these sup files although it\nmay take some time to do them all. If you do check around for subs please note\nthis is the full 2hrs 54 minutes version of the movie program (the euro version\nis same length now as north American version)\n\n\nExcerpted from the Daily Mail (UK) Newspaper website:\n\nStarring Julie Andrews and Christopher Plummer, directed by Robert Wise\nand filmed partly on location in Salzburg, Austria, The Sound of Music was\nthe top-grossing film of its era, and remains the most successful movie\nmusical of all time.\n\nNominated for ten Academy Awards, it won five, including Best Picture, \nBest Sound Recording, and Best Scoring of Music (adaptation) by the legendary\nIrwin Kostal.\n\nFrom its first, record-breaking run on stage at London's Palace Theater\nin the early 1960s, through the zaniness of the sing-a-long A Sound of Music\ncraze, and the huge success of the West End theater's current smash hit revival \npresented by Andrew Lloyd Webber, The Sound of Music has always been one of \nGreat Britain's Most favourite things.&quot;\n\n\nThis is undoubtedly the greatest movie ever made - to show the supreme\nspirit of Ms. Julie Andrews and its rightful place upon the throne as \na far better alternative over the wisdom that otherwise seems to pervade\nthe planet even on the part of such misguided authoritarian characters as\nthat which is played by the talented Christopher Plummer (who really should\nnot have to be shown what is better, you would think!).\n\nThis movie has made more than enough money that a sensible, Christianly \nspirited studio could long ago have afforded to make available on a cheap\nfive dollar HD disc - or else more rightly I think, settle for those that\nmake do with the versions we give away here instead - awaiting the prevailing\nof better minds in the running of things in this industry generally speaking.\n\nA 1965 movie is in any event a great candidate for the end of copyright\nprotection and the grace of public domain ownership - the cost of abuses by\nthis industry as I say once again.\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\t","torrent":{"xt":"urn:btih:5867429d557543b3b7598e62d628f2880c9ab993","amp;dn":"The+Sound+of+Music+%281965%29++XviD++%28moviesbyrizzo%29+MULTI+audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5867429d557543b3b7598e62d628f2880c9ab993","infoHashBuffer":{"type":"Buffer","data":[88,103,66,157,85,117,67,179,183,89,142,98,214,40,242,136,12,154,185,147]},"announce":[],"urlList":[]}}