{"title":"The Bible Series - Finger of God - Furious Love - Father of Lite","uid":15908411,"size":8350995128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58c745f20ae846013e403871fec7aac283482bfa&amp;dn=The+Bible+Series+-+Finger+of+God+-+Furious+Love+-+Father+of+Lite&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":23,"time":1475075017,"description":"ABOUT FINGER OF GOD\r\n\r\nFinger of God began as a short film about God’s miraculous power. I had no budget, no script, and no idea what this movie was ultimately going to look like. I teach storytelling and film at a University in Chicago, and here I was breaking all of my own rules.\r\n\r\nBut that’s where I found myself, and I quickly discovered that God is an incredible film producer. He funded the whole film (I never had to ask for money), took me around the world, and introduced me to some truly incredible people.\r\n\r\nSo what is the film about? Well, now that it’s finished, I can finally answer that question. On the surface it is about the miraculous. I originally thought I was making a film that simply tried to capture miracles on tape. But as the story progressed, things began to change.\r\n\r\nAt its core, it is about the heart of God. It’s about how He views us, and how He is desperate for a relationship with us. Along the way, He places his finger on our lives, touches us deeply, heals us, shows His creativity, and generally surprises us with every move He makes.\r\n\r\nThe film’s international cast includes a wide variety of people, ministries, and personalities. But just to whet your appetite, here is a partial list of some of the things you will see and hear about in this film:\r\n\r\nThe Charlie Daniels Movie &quot;Pale Horse&quot; is outstanding","torrent":{"xt":"urn:btih:58c745f20ae846013e403871fec7aac283482bfa","amp;dn":"The+Bible+Series+-+Finger+of+God+-+Furious+Love+-+Father+of+Lite","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58c745f20ae846013e403871fec7aac283482bfa","infoHashBuffer":{"type":"Buffer","data":[88,199,69,242,10,232,70,1,62,64,56,113,254,199,170,194,131,72,43,250]},"announce":[],"urlList":[]}}