{"title":"The Great Transatlantic Cable (TV) [2005] PBS","uid":6970087,"size":628133476,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:596b7253cc9b0a304c895f5c852b0ac2581f21b2&amp;dn=The+Great+Transatlantic+Cable+%28TV%29+%5B2005%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1327020932,"description":" &lt;a href=&quot;http://bayimg.com/oameOaADa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/oameOaADa&lt;/a&gt;\n\nThe American Experience \n \nThe Great Transatlantic Cable \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0815942/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0815942/&lt;/a&gt;\n\nOriginal Air Date:11 April 2005 \n\nOn January 8, 1815 a British fleet attacked New Orleans, Louisiana. It was intended to be the final battle of the War of 1812. The British aimed to block the strategic mouth of the Mississippi, taking control of America's inland waterways. The assault was met by a small number of American troops commanded by General Andrew Jackson, and quickly turned into a rout for the attackers. In a single day the British suffered over 2000 casualties. The next morning the British fleet limped out of the harbor and set sail for England.\n\nOnly when the British returned home did they learn that their bloody sacrifice at New Orleans had been pointless. Two weeks before the battle, on Christmas Eve, 1814, diplomats from Britain and the United States had signed a treaty at Ghent, Belgium, ending their war. On the day of the Battle of New Orleans, both nations were officially at peace -- but the message had not yet arrived in America.\n\nFor most of the 19th century information traveled between Europe and America no faster than a packet ship could carry it. Even by 1850, long after telegraph wires had been strung across North America, there was no transatlantic connection. Communication stopped at the water's edge. A question could require a month for an answer. If winter storms shut down the shipping lanes, the two continents could be cut off for months.\n\nThe need for transatlantic communication was obvious, but there had never been an undersea cable longer than a couple of hundred miles, and only three hundred feet deep. A cable across the Atlantic would need to be over two thousand miles long and be laid three miles deep. In 1858 no one had even manufactured a wire that long. No ship could carry such a weight. The floor of the sea was a dark mystery. No one knew if an electric current could even be sent so far. The science of the day, in short, offered more questions than answers.\n\nThe challenge of an Atlantic cable was not pursued by the great powers and their formidable navies. Instead, the Atlantic cable became the singular obsession of Cyrus Field, a young, successful New York paper manufacturer. His business had brought him riches but little fame. Field was one of the new breed of financiers born of the industrial age and well-connected in the New York business world.\n\nIt took twelve years of struggle and expense before Field and his team of engineers finally succeeded. On July 27, 1866, Field sent back the first message to Europe: &quot;Thank God,&quot; he wrote, &quot;the Cable is Laid.&quot;\n\nThe laying of the Atlantic cable was one of the great international undertakings of the nineteenth century. From 1856 to 1866 the equivalent of billions of dollars was spent trying to stretch a copper wire from a remote, fog-bound bay in Ireland to another fog-bound bay in Canada. Five separate attempts were required before success was achieved. Writer Arthur C. Clarke would later call it the Victorian equivalent of putting a man on the moon.\n\n","torrent":{"xt":"urn:btih:596b7253cc9b0a304c895f5c852b0ac2581f21b2","amp;dn":"The+Great+Transatlantic+Cable+%28TV%29+%5B2005%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596b7253cc9b0a304c895f5c852b0ac2581f21b2","infoHashBuffer":{"type":"Buffer","data":[89,107,114,83,204,155,10,48,76,137,95,92,133,43,10,194,88,31,33,178]},"announce":[],"urlList":[]}}