{"title":"Maverick - Season 5","uid":16012550,"size":9480951283,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5bda545ecb41ed38e5d240bf3b27082a62db6df7&amp;dn=Maverick+-+Season+5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"Invader97","files":13,"time":1476252461,"description":"Maverick is an American Western television series with comedic overtones created by Roy Huggins. The show ran from September 22, 1957 to July 8, 1962 on ABC and stars James Garner as Bret Maverick, an adroitly articulate cardsharp. Eight episodes into the first season, he was joined by Jack Kelly as his brother Bart, and from that point on, Garner and Kelly alternated leads from week to week, sometimes teaming up for the occasional two-brother episode. The Mavericks were poker players from Texas who traveled all over the American Old West and on Mississippi riverboats, constantly getting into and out of life-threatening trouble of one sort or another, usually involving money, women, or both. They would typically find themselves weighing a financial windfall against a moral dilemma. More often than not, their consciences trumped their wallets since both Mavericks were intensely ethical.\r\n\r\nWhen Garner left the series after the third season due to a legal dispute, Roger Moore was added to the cast as their cousin Beau Maverick. Robert Colbert appeared later in the fourth season as a third Maverick brother, Brent Maverick. No more than two of the series leads ever appeared together in the same episode, and usually only one.\r\n\r\nMy previous version of this torrent contained videos of several episodes having poor syncing of the audio and video. The videos here should be problem free.\r\n\r\nInvader97","torrent":{"xt":"urn:btih:5bda545ecb41ed38e5d240bf3b27082a62db6df7","amp;dn":"Maverick+-+Season+5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bda545ecb41ed38e5d240bf3b27082a62db6df7","infoHashBuffer":{"type":"Buffer","data":[91,218,84,94,203,65,237,56,229,210,64,191,59,39,8,42,98,219,109,247]},"announce":[],"urlList":[]}}