{"title":"The Sixties The Years That Shaped a Generation (TV)  [2005]","uid":6981560,"size":733690867,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c9cb9f2c39bc4f17ac6eed91114595251529ec4&amp;dn=The+Sixties+The+Years+That+Shaped+a+Generation+%28TV%29++%5B2005%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1327420966,"description":" &lt;a href=&quot;http://bayimg.com/palopAado&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/palopAado&lt;/a&gt;\n\nThe Sixties: The Years That Shaped a Generation (TV 2005) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0484892/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0484892/&lt;/a&gt;\n\nRelease Date:29 September 2005\n\nA defining chapter in America's past, the '60s shaped a generation and sculpted a political landscape that can still be seen today. The story of the '60s is illuminated with images of freedom protests, atom bombs, flower power, and a nation divided by war.\n\nIt was a time when a generation rebelled and lost its innocence. From the Vietnam War to the struggle for racial equality to the birth of a counter-culture explosion, the 1960s was a decade of change, experimentation and hope that transformed an entire nation. THE SIXTIES: THE YEARS THAT SHAPED A GENERATION traces the events of one of the most turbulent and influential periods of political and cultural change in the 20th century and the powerful impact forced on an entire generation. There is disagreement even today over the failures and accomplishments that were born from the 1960s, but one thing is certain ? there has never been a time quite like it. THE SIXTIES: THE YEARS THAT SHAPED A GENERATION highlights the tumultuous and exhilarating moments of a decade that continues to have a profound impact on our society today ? from American foreign policy to the birth of the environmental and gay rights and women's liberation movements.\n\nThe 2-hour documentary features revealing interviews with prominent figures of the era including, Judge Robert Bork, Patrick Buchanan, Rev. William Sloane Coffin, Peter Coyote, Walter Cronkite, Daniel Ellsberg, Carlos Fuentes, Arlo Guthrie, Tom Hayden, Rev. Jesse Jackson, Henry Kissinger, Norman Mailer, Robert McNamara, Ed Meese, and Bobby Seale.\n\n","torrent":{"xt":"urn:btih:5c9cb9f2c39bc4f17ac6eed91114595251529ec4","amp;dn":"The+Sixties+The+Years+That+Shaped+a+Generation+%28TV%29++%5B2005%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c9cb9f2c39bc4f17ac6eed91114595251529ec4","infoHashBuffer":{"type":"Buffer","data":[92,156,185,242,195,155,196,241,122,198,238,217,17,20,89,82,81,82,158,196]},"announce":[],"urlList":[]}}