{"title":"The Greatest Story Ever Told DVD NL (dvd5)(Nl subs) RETAIL TBS B","uid":6963922,"size":3982188666,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5d6fff0b987a9c39f778dde4441fd5b5dd359b96&amp;dn=The+Greatest+Story+Ever+Told+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":-1,"time":1326852305,"description":"Left Behind (2000)\n\nNederlands\nBuck Williams (Kirk Cameron) is een gerenommeerd journalist die tijdens een reportage in IsraÃƒÂ«l enkele bizarre ontdekkingen doet.\nVanaf dat moment beginnen er zich op aarde allerlei vreemde verschijnselen voor te doen. Ontploffingen komen uit het niets en miljoenen mensen verdwijnen zomaar van onze planeet.\nEen tijd van chaos, angst en duisternis lijkt zijn intrede te doen.\nWanneer ook piloot Rayford Steele (Brad Johnson) bij zijn thuiskomst merkt dat zijn vrouw en kind zijn verdwenen, begint voor hem een lange zoektocht naar de waarheid.\nEen zoektocht die zijn leven ingrijpend zal veranderen.\n\nEnglish\nRayford Steele is an airline pilot whose relationship with his wife has gone sour;\nhe ponders having an affair with an attractive flight attendant, Hattie Durham.\nIn the midst of a flight to London, a number of their passengers mysteriously disappear, and chaos takes hold as a number of vehicles on the ground and in the air are suddenly unmanned.\nMeanwhile, Buck Williams, a television journalist, is pondering the rash of sudden disappearances as he works on a report about Dr. Chaim Rosenzweig,\nan Israeli scientist who has devised a formula that would make any soil on earth easy to cultivate.\nHowever, Buck wonders if there's more to Rosenzweig than he first imagined when he discovers the doctor is in cahoots with two multi-millionaires\nwho plan to broker the invention to promote their own agenda of international domination\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Actie / Drama\nTime          : 96 minuten\n","torrent":{"xt":"urn:btih:5d6fff0b987a9c39f778dde4441fd5b5dd359b96","amp;dn":"The+Greatest+Story+Ever+Told+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d6fff0b987a9c39f778dde4441fd5b5dd359b96","infoHashBuffer":{"type":"Buffer","data":[93,111,255,11,152,122,156,57,247,120,221,228,68,31,213,181,221,53,155,150]},"announce":[],"urlList":[]}}