{"title":"[UPDATED] Red Hot Chili Peppers - Absolute Archive","uid":6979427,"size":58142662745,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5dc91d00f069b36524fd80a25a058e68c9e3fd88&amp;dn=%5BUPDATED%5D+Red+Hot+Chili+Peppers+-+Absolute+Archive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"e7add9","files":1529,"time":1327351769,"description":"My previous account on TPB, panza32, had trouble seeding this RHCP archive the past 2 times I attempted to upload/seed it, so here it goes again. Except this time, I've updated the archive so there's like 10 more GB of content.\n\nOnce more, I am confident this is the largest RHCP collection that exists. Everything the band has done is in here, including\n\n- Complete studio discography (including booklet/album scans)\n- All music videos (including rare videos)\n- A boatload of master tracks (BSSM and SA mainly, but also IWY, BTW, MM, and CA)\n- Vinyl rips of MM, BSSM, WH!, OHM, CA, BTW, GH, SA and IWY\n- Unmastered versions of BSSM and CA\n- FLAC versions of TRHCP, MM, BSSM, WH!, OHM, CA, BTW, SA, IWY and all the remasters\n- Every bootleg worth owning, meaning the ones with at least decent quality\n- A ton of rare songs, b-sides, live covers, bonus tracks, unreleased tracks, pretty much everything.\n- A bunch of random things like RHCP icons, wallpapers, magazine scans, etc.\n- Also there is a whole lot of random videos, including interviews, live song performances, the iTunes Originals mini-concert, the recent View From the Road series, and the Making Of series for a bunch of the official music videos. Furthermore there are 25 full-length and high quality shows here, including rare ones such as Red Hot Skate Rock. The video formats are all either .avi, .mp4, .mpg or .flv.\n\nAll media in this archive can be opened with the free VLC Media Player.\n\nI will seed as long as i can!","torrent":{"xt":"urn:btih:5dc91d00f069b36524fd80a25a058e68c9e3fd88","amp;dn":"%5BUPDATED%5D+Red+Hot+Chili+Peppers+-+Absolute+Archive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dc91d00f069b36524fd80a25a058e68c9e3fd88","infoHashBuffer":{"type":"Buffer","data":[93,201,29,0,240,105,179,101,36,253,128,162,90,5,142,104,201,227,253,136]},"announce":[],"urlList":[]}}