{"title":"Valet - Blood is Clean","uid":6902356,"size":191594045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5eb3bb84614503e1a3230dc62406daf58b6ea291&amp;dn=Valet+-+Blood+is+Clean&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"tonioferah","files":11,"time":1324447968,"description":"Blood is Clean is the debut release by Honey Owens under the name Valet. The songs were formed out of a natural and spontaneous process as separate incidents of recording over a 5 month period from January to May of 2006. They were recorded by and large in single, live takes with minor additional tracking added here and there. The results are at once spare and expansive; exploratory, yet deceptively simple.\n\nHoney wanted to make music that was not neccessarily of her, but rather &quot;to be a medium channeling sounds from an unknown place, opening up and spilling out onto the computer-tape.&quot; The cryptic, mesmerizing sound pallete was inspired by &quot;lucid dreams and physical artifacts that appeared to me daily that hinted at a sound-world of Haitian Voodoo drumming, various shamanic dreamtime musics, the Velvet Underground, and the 'Fourth-World' concepts of Jon Hassell&quot;. We will just say that these are some of the most inspiring alien-psychedelic-blues-jams that we have heard in ages. And check out the absolutely fried guitar work from the outer edge of the galaxy on the title cut.\n\nQuote: &quot;Does Honey Owens aka Valet really sing 'My blood is clean/But the devil's in me' right before that percussion kicks in? Holy moley; that's too perfect. That guitar solo is the best we might have heard in years. It's a time-stopping guitar solo. Everyone else should stop doing that, right now; put down your guitars! Thank you.&quot; MikeMcGonigal-Yeti Magazine #4","torrent":{"xt":"urn:btih:5eb3bb84614503e1a3230dc62406daf58b6ea291","amp;dn":"Valet+-+Blood+is+Clean","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb3bb84614503e1a3230dc62406daf58b6ea291","infoHashBuffer":{"type":"Buffer","data":[94,179,187,132,97,69,3,225,163,35,13,198,36,6,218,245,139,110,162,145]},"announce":[],"urlList":[]}}