{"title":"John Steinbeck - De ratones y hombres (ePub)","uid":6996920,"size":265401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6100504cbfd8f1daa2accaa5bdf74347af58b533&amp;dn=John+Steinbeck+-+De+ratones+y+hombres+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1327919258,"description":"Lennie, un deficiente mental tan bruto como tierno, recorre los caminos junto al pÃƒÂ­caro e ingenioso George. Son dos figuras errantes en el paisaje rural de la Gran DepresiÃƒÂ³n que asolÃƒÂ³ NorteamÃƒÂ©rica, en busca siempre de cualquier trabajo que les permita sobrevivir.\n\nJohn Steinbeck, Premio Nobel 1962, plasmÃƒÂ³ en muchas de sus novelas el mundo de los desheredados que vagaban por la AmÃƒÂ©rica rural de los anos de la Depresion, en busca de cualquier trabajo que les permitiera sobrevivir. En esta novela, que ha sido llevada a la pantalla en 1992, Steinbeck narra la relacion entre Lennie y George: Lennie, un debil mental tan primitivo como tierno; George, un picaro habil a ingenioso, que intenta proteger a Lennie de si mismo, aunque a veces se escude en su fuerza para salir de apuros. La amistad entre estos dos seres marginados y su enfrentamiento al convencional y civilizado mundo de los poderosos es producto de un costado humano que sigue hoy tan vigente como cuando se escribio esta novela, hace mas de sesenta anos: la solidaridad.","torrent":{"xt":"urn:btih:6100504cbfd8f1daa2accaa5bdf74347af58b533","amp;dn":"John+Steinbeck+-+De+ratones+y+hombres+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6100504cbfd8f1daa2accaa5bdf74347af58b533","infoHashBuffer":{"type":"Buffer","data":[97,0,80,76,191,216,241,218,162,172,202,165,189,247,67,71,175,88,181,51]},"announce":[],"urlList":[]}}