{"title":"Demigod 1.0","uid":6919259,"size":2559471616,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6154020c8e6595011001a49a14c075b9486d773d&amp;dn=Demigod+1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"copkillu","files":1,"time":1325155504,"description":"Set in a magical world where gods walk among mortals, Demigod blends action, strategy and role-playing elements into a thrilling new experience. Select the Demigod that will lead your minions into battle and unleash the dogs of war against your rivals. Your Demigod will do whatever it takes in order to ascend to true godhood.\n\nOnce in the Arena, each Demigod will be joined by support troops that fight to the death as you struggle to seize key control points and slowly turn the tide of war in your favor. And your Demigod will level up during the course of each battle, becoming even more powerful as you unlock new abilities and powers. It's a brutal conflict of Demigod versus Demigod, where the very ground beneath their feet will tremble and quake.\n\nFeatures:\n\n* Revolutionary strategy/action game that combines tactical prowess with role-playing depth.\nYour Demigod is the focus of your power in the arena. Each of the 8 included Demigods has unique powers and abilities.\n\nLike a role-playing game, players can purchase equipment for their Demigod, add new powers to their Demigod as it gains experience, acquire artifacts that remain persistent between games. Each Demigod plays differently enough that it provides a diverse gaming experience.\n\nLike a strategy game, players have strategic objectives in each arena that, when captured, provide resources that give access to better units and some Demigods have the ability to summon their own minions that they can individually control. There are gold mines that can be captured to give more resources, artifact shops that, if captured, make their resources available to your team.\n\n* Battle in a persistent online world in multiplayer or play single player either in a skirmish or in the virtual tournament.\nThe on-line pantheon allows players to &quot;skirmish&quot; against other players of similar skill or take part in the on-line Pantheon tournament where players choose the path of light or darkness and earn favor points to help their faction win the tournament. Players can also play on the LAN or play custom games with friends on the Internet.\n\nPlayers earn favor points through victory with different awards given for different achievements during the game. These favor points can be used to purchase special items that exist from game to game.\n\n* Increase your Demigod's powers and abilities by leveling up during each battle.\nIn each game, your Demigod will start at level 1. As you kill enemy grunts and Demigods and capture flags, you gain experience which will cause your Demigod to gain experience levels. When a new experience level is gained, the player can add new skills and abilities to their Demigod to make him or her more powerful.\n\n* Wage massive, earth-shattering battles across a series of awe-inspiring Arenas.\nDemigod makes use of the same awesome technology as Supreme Commander. However, it has been greatly enhanced with Gas Powered Games' new &quot;mesh&quot; technology that allows the game to have incredible visuals even on older video cards. The arenas in Demigod are not your typical &quot;maps&quot;. Instead, they have each been crafted as a full blown 3D model unto itself in which players battle on the surface of them.\n\n* Seize key, strategic positions on the map and turn the tide against your enemy. Push deep into their base and destroy them once and for all.\nKey resources in an arena are controlled by capturing the flag associated to that resource. When a player controls that resource, the entire team benefits. Controlling flags also generates war points which are added to your team's war score. When enough war points are collected, new upgrades in the team's Citadel become available for purchase. ","torrent":{"xt":"urn:btih:6154020c8e6595011001a49a14c075b9486d773d","amp;dn":"Demigod+1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6154020c8e6595011001a49a14c075b9486d773d","infoHashBuffer":{"type":"Buffer","data":[97,84,2,12,142,101,149,1,16,1,164,154,20,192,117,185,72,109,119,61]},"announce":[],"urlList":[]}}