{"title":"N.O.V.A 2 HD v1.0.1 (webOS - Touchpad)","uid":6897417,"size":708212872,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:644bcb88668c66218ce38e49c2f124e38bbf1daf&amp;dn=N.O.V.A+2+HD+v1.0.1+%28webOS+-+Touchpad%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bob3639","files":1,"time":1324251062,"description":"[GAME] N.O.V.A 2 HD v1.0.1\n\n    The ultimate sci-fi FPS is back! Get ready to step into a whole new level of gaming! 6 years have passed since the events depicted in the first episode. Humanity is now thrown into a bloody civil war fought on one side by the central government of the Terran Orbitals and the self-appointed Human-Alien Alliance; a new organization with a mysterious origin and agenda. Kal Wardin left active service in N.O.V.A. years ago and now lives among the colonists of the desert planet Scorpius. But war never spares even the most peaceful places...\n\n    AN UNPARALLELED SINGLE-PLAYER CAMPAIGN: - 12 chapters taking you through hostile, yet amazing environments of various Orbitals - Over a dozen weapons including the Dual Hand Guns, Assault Rifle, Shotgun, Automatic Shotgun, Sniper Rifle, Rocket Launcher, Grenade Launcher, Alien Plasma Gun, Alien Lightning Gun, Alien Laser Gun, Turrets, Frag Grenades and Mines -\n\n    3 special powers: Freeze, Slow Time and Disc for melee combat -\n\n    A wide range of enemies with improved AI, for even more intense combats\n    INTENSE MULTIPLAYER MODES: - 1 to 10 players online or locally -\n    5 modes: Free for All, Team Deathmatch, Capture the Flag, Freeze Tag and InstaGib - Ranking &amp; Perk systems - 10 maps on which to battle it out - Play against your friends or the entire world through Gameloft LIVE!\n\n    -Worldwide leaderboards in the game &amp; on the official website, www.near-orbit-vanguard-alliance.com EXCLUSIVE REWARDS FOR VETERAN PLAYERS If you played the first episode: - Jump into multiplayer with bonus XP, allowing you access to advanced weaponry - Unlock a special achievement on Gameloft LIVE!\n\n    --------------------------------------------- JOIN THE FIGHT WITH MANY OTHER FANS! Enlist on Twitter @NOVA_fps Visit www.near-orbit-vanguard-alliance.com for more information.\n\n\n    File is kinda big so i decided to try file share for once =s\n    Remember to support the developer, and download this game\n\n    So far there is no multiplayer support yet, like it says in the game description\n    Oh yea and I deleted what i thought was the save files... but i think i forgot to delete some of the trophies and the upgrades (i only bought one upgrade tho)... so if you're really an*l about that you can delete those too... or hopefully selecting a new game will wipe that too","torrent":{"xt":"urn:btih:644bcb88668c66218ce38e49c2f124e38bbf1daf","amp;dn":"N.O.V.A+2+HD+v1.0.1+%28webOS+-+Touchpad%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"644bcb88668c66218ce38e49c2f124e38bbf1daf","infoHashBuffer":{"type":"Buffer","data":[100,75,203,136,102,140,102,33,140,227,142,73,194,241,36,227,139,191,29,175]},"announce":[],"urlList":[]}}