{"title":"The Change Up (2011) [BDRip 720p][DUAL][Eng-Spa]","uid":6922467,"size":6596710787,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:651b53173e38a6e4b96a41b20224c1afaf28bd04&amp;dn=The+Change+Up+%282011%29+%5BBDRip+720p%5D%5BDUAL%5D%5BEng-Spa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1325323756,"description":"El cambiazo (2011) [BDRip 720p][DUAL][Eng-Spa]\n &lt;a href=&quot;\nhttp://www.elcambiazo-lapelicula.es/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elcambiazo-lapelicula.es/&lt;/a&gt;\n\nEnglish:\n--------\nVideo source: Full Blu-ray\nAudio Track 1: MIC-HQ MP3 Castilian\nAudio Track 2: English DTS 1.5 Mbps @\nSubtitles: Castilian Forced and Full\nSize: 6.14 GB\n\nTitle: The Change-Up\nCountry: USA\nUSA release: 05/08/2011\nReleased in Spain: 28/12/2011\nStudio: Universal Pictures\nDirector: David Dobkin\nScreenwriter: Jon Lucas &amp; Scott Moore\nStarring: Ryan Reynolds, Jason Bateman, Leslie Mann, Olivia Wilde, Alan Arkin, Leslie Mann\nRating: Not recommended for children under 12 years\n\nSynopsis:\nMitch (Ryan Reynolds) and Dave (Jason Bateman) were inseparable friends of children and adolescents, but over the years have moved away. Dave is an attorney engaged to work, married and has three children, but Mitch is still a bachelor, a man child who works at times and that was never tied to anything or anyone. Mitch believes that Dave has it all: a beautiful wife named Jamie (Leslie Mann), some kids who worship him and a highly paid job in a prestigious law firm. Dave believes that living as Mitch, no stress or pressure, no obligations, is a real dream come true.\n\nAfter sharing a drunken sounded, the worlds of Mitch and Dave turned upside down when they wake up in the body of the other roles and lose big. Despite being freed from the routine, soon discover that their lives are not as rosy as they seemed. To complicate things further is also Sabrina (Olivia Wilde), the sexy lawyer who works with Dave, and father (Alan Arkin) by Mitch, which has distanced. With time running out, Mitch and Dave must fight to not shatter their lives before they find a way to rejoin themselves.\n\n\n\nEspaÃƒÂ±ol:\n--------\nFuente De Video: Full Blu-ray\nPista De Audio 1: MP3 Castellano MIC-HQ\nPista De Audio 2: DTS Ingles @ 1,5Mbps\nSubtitulos: Castellano Forzados y Completos\nTamaÃƒÂ±o: 6,14 GB\n\nTÃƒÂ­tulo: El cambiazo\nTÃƒÂ­tulo original: The Change-Up\nPaÃƒÂ­s: USA\nEstreno en USA: 05/08/2011\nEstreno en EspaÃƒÂ±a: 28/12/2011\nProductora: Universal Pictures\nDirector: David Dobkin\nGuiÃƒÂ³n: Jon Lucas &amp; Scott Moore\nReparto: Ryan Reynolds, Jason Bateman, Leslie Mann, Olivia Wilde, Alan Arkin, Leslie Mann\nCalificaciÃƒÂ³n: No recomendada para menores de 12 aÃƒÂ±os\n\nSinopsis:\nMitch (Ryan Reynolds) y Dave (Jason Bateman) eran amigos inseparables de niÃƒÂ±os y adolescentes, pero con el paso de los aÃƒÂ±os, se han alejado. Dave es un abogado enganchado al trabajo, se ha casado y tiene tres hijos, pero Mitch sigue soltero, un hombre niÃƒÂ±o que trabaja a veces y que nunca se ha atado a nada ni a nadie. Mitch cree que Dave lo tiene todo: una preciosa esposa llamada Jamie (Leslie Mann), unos niÃƒÂ±os que le adoran y un trabajo muy bien pagado en un prestigioso bufete. Dave cree que vivir como Mitch, sin estrÃƒÂ©s ni presiÃƒÂ³n, sin obligaciones, es un autÃƒÂ©ntico sueÃƒÂ±o hecho realidad.\n\nDespuÃƒÂ©s de compartir una sonada borrachera, los mundos de Mitch y Dave se vuelven del revÃƒÂ©s cuando se despiertan en el cuerpo del otro y pierden los papeles a lo grande. A pesar de verse liberados de la rutina, no tardan en descubrir que sus respectivas vidas no son tan rosadas como parecÃƒÂ­an. Para complicarlo aÃƒÂºn mÃƒÂ¡s tambiÃƒÂ©n estÃƒÂ¡ Sabrina (Olivia Wilde), la abogada sexy que trabaja con Dave, y el padre (Alan Arkin) de Mitch, del que se ha distanciado. Con el tiempo en contra, Mitch y Dave deberÃƒÂ¡n luchar para no hacer aÃƒÂ±icos a sus vidas antes de encontrar la forma de reincorporarse a sÃƒÂ­ mismos.\n\n","torrent":{"xt":"urn:btih:651b53173e38a6e4b96a41b20224c1afaf28bd04","amp;dn":"The+Change+Up+%282011%29+%5BBDRip+720p%5D%5BDUAL%5D%5BEng-Spa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"651b53173e38a6e4b96a41b20224c1afaf28bd04","infoHashBuffer":{"type":"Buffer","data":[101,27,83,23,62,56,166,228,185,106,65,178,2,36,193,175,175,40,189,4]},"announce":[],"urlList":[]}}