{"title":"Spartacus DVD NL (dvd5)(1960)(Nl subs) R5 DVDR TBS B-SAM","uid":6960003,"size":4416181944,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:67ad2bc788abf9faafeb6f0637e838671ec2325f&amp;dn=Spartacus+DVD+NL+%28dvd5%29%281960%29%28Nl+subs%29+R5+DVDR+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":-1,"time":1326728240,"description":"Spartacus (1960) \n\nNederlands\n76 voor Christus.\nSpartacus wordt als slaaf verkocht aan Lentulus Batiatus.\nHij is de rijke eigenaar van een school voor gladiatoren in Capua.\nVolgens de traditie krijgt Spartacus een gezellin toegewezen.\nHet gaat om Virinia. Dit meisje komt uit BrittaniÃƒÂ«.\nOp weg naar Rome wil generaal Marcus Licinius Crassus zijn reisgezellen verstrooien met een gevecht tussen gladiatoren.\nSpartacus wordt \\\\\\\\\\\\\\'gekozen\\\\\\\\\\\\\\' en krijgt de Afrikaanse reus Draba als tegenstander.\nMaar Draba raakt plotseling buiten zichzelf en stormt plotseling op de toeschouwers af.\nCrassus moet hem doden. Enige tijd later ziet Spartacus de kans om een gladiatorenrevolte op te zetten.\nHij vormt nu een regelrechte bedreiging voor de Romeinse overheid...\n\nEnglish\nIn 73 BCE, a Thracian slave leads a revolt at a gladiatorial school run by Lentulus Batiatus.\nThe uprising soon spreads across Italy involving thousand of slaves.\nThe plan is to acquire sufficient funds to hire ships from Silesian pirates who could the transport them to other lands from Brandisium in the south of Italy.\nThe Roman Senator Gracchus schemes to have Marcus Publius Glabrus, Commander of the garrison of Rome, lead an army against the slaves who are living on Vesuvius.\nWhen Glabrus is defeated his mentor, Senator and General Marcus Licinius Crassus is greatly embarrassed and leads his own army against the slaves.\nSpartacus and the thousands of freed slaves successfully make their way to Brandisium only to find that the Silesians have abandoned them.\nThey then turn north and must face the might of Rome...\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : DVDRIB\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Drama / Oorlog\nTime          : 184 minuten","torrent":{"xt":"urn:btih:67ad2bc788abf9faafeb6f0637e838671ec2325f","amp;dn":"Spartacus+DVD+NL+%28dvd5%29%281960%29%28Nl+subs%29+R5+DVDR+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ad2bc788abf9faafeb6f0637e838671ec2325f","infoHashBuffer":{"type":"Buffer","data":[103,173,43,199,136,171,249,250,175,235,111,6,55,232,56,103,30,194,50,95]},"announce":[],"urlList":[]}}