{"title":"Don Cherry Ed Blackwell El Corazon(jazz)(flac)[rogerc]","uid":6932594,"size":204033733,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67e68525f7ceb105c322d294300b17c48bbb62da&amp;dn=Don+Cherry+Ed+Blackwell+El+Corazon%28jazz%29%28flac%29%5Brogerc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":11,"time":1325707086,"description":"DON CHERRY ED BLACKWELL EL CORAZON\nLabel: ECM\nReleasd; Year 1982\nFormat:Flac\n\nThis duo recital begins with a lovely medley of Don Cherry's &quot;Mutron&quot; and Monk's classic &quot;Bemsha Swing.&quot; The radiant, elegant swing these master musicians elicit from the most straightforward of grooves is indicative of a deep spiritual intimacy going back some 20-plus years, when the Californian trumpeter and the New Orleans drummer helped Ornette Coleman to flesh out his innovative style of collective improvisation.\n\nDuring the intervening years, Cherry and Blackwell were recognized as innovators in their own right. The pocket trumpeter/multi-instrumentalist forged a provocative blend of modern jazz and folk music from around the world, while the drummer advanced our notions of rhythm as a form, a musical character as capable of melodic persuasion as any horn.\n\nOn &quot;Solidarity&quot; Cherry announces the theme on piano, and Blackwell responds with a ritualistic beat that echoes the tribal ceremonies of the Crescent City's legendary Congo Square, segueing seamlessly into the near-eastern airs of &quot;Arabian Nightingale.&quot; &quot;Roland Alphonso&quot; finds Cherry on the folksy sounding melodica over Blackwell's no-frills reggae beat, while &quot;Makondi&quot; features Cherry on the aboriginal doussin'gouni, as Blackwell creates a remarkable, multi-layered rhythmic statement on cowbells and drums that is simple, singing and evocative of mother Africa.\n\nBlackwell's mysterious &quot;Street Dancing&quot; incorporates a wooden drum with a low, subterranean resonance into the standard trap kit, weaving supple, dancing snare variations around its deep heartbeat in the manner of a New Orleans parade drummer, then goes on to suggest the African origins of these beats with log drums on &quot;Short Stuff&quot; and &quot;Near-in.&quot; On the title tune, Cherry employs piano and pocket trumpet to evoke the lyric grandeur of Spain and North Africa, as Blackwell's martial rhythms pulse and thunder and bloom into fresh variations, while his tender lyricism on &quot;Voice Of The Silence&quot; sums up Cherry's mystic leanings. In finding cultural connections where most musicians would only acknowledge disparity, Cherry and Blackwell create a joyous rhythmic hybrid that transcends labels.\n\nTracklist:\n\n1 Mutron / Bemsha Swing / Solidarity / Arabian Nightingale  5:13\n2 Roland Alphonso 3;14 \n3 Makondi 3:45 \n4 Street Dancing 2:18 \n5 Short Stuff / El CorazÃƒÂ³n / Rhythm For Runner7:24\n6 Near-In 6:39 \n7 Voice of the Silence 5:33\n\nRecorded at Tonstudio Bauer, Ludwigsburg, Germany in February 1982.\n\nPersonnel:\n\nDon Cherry (pocket trumpet, piano, melodica, doussn' gouni, organ)\nEd Blackwell (drums, wood drum, cowbell).\n\n","torrent":{"xt":"urn:btih:67e68525f7ceb105c322d294300b17c48bbb62da","amp;dn":"Don+Cherry+Ed+Blackwell+El+Corazon%28jazz%29%28flac%29%5Brogerc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e68525f7ceb105c322d294300b17c48bbb62da","infoHashBuffer":{"type":"Buffer","data":[103,230,133,37,247,206,177,5,195,34,210,148,48,11,23,196,139,187,98,218]},"announce":[],"urlList":[]}}