{"title":"Maria Magdalena DVD NL (dvd5)(Nl subs) RETAIL TBS B-SAM","uid":6968005,"size":4438119424,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6b38c5a3f2347e8f09d6007877a5d90dd68d6dc5&amp;dn=Maria+Magdalena+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":-1,"time":1326990199,"description":"Maria Magdalena (2000)\n\nNederlands\nWanneer het huwelijk tussen Maria en Amos kinderloos blijft, verstoot Amos haar en besluit van haar te scheiden.\nMaria wordt daardoor gedwongen om Magdala te verlaten. Kort daarna ontmoet ze de Romeinse prefect Silvano, hij belooft haar een nieuw leven aan zijn zijde.\nEen aantal dagen na haar vorige ontmoeting, komt ze in contact met Johannes de Doper.\nDeze profeet die massaal mensen doopt, wordt door Silvano als opstandig gezien.\nAls Maria toch met Johannes in contact komt, hoort ze over Jezus. De verhalen over deze Messias beginnnen haar erg te interresseren.\nMaria besluit om Silvano niets over Johannes te vertellen in de hoop de profeet zo te kunnen beschermen.\nMaar als Silvano achter haar &quot;verraad&quot; komt verstoot hij haar ook, en staat ze weer op straat. Om te overleven moet ze zich als prostituee aanbieden, waarna ze later een zelfmoordpoging pleegt.\nAls Jezus in haar leven komt veranderen de zaken voorgoed.\n\nEnglish\nWhen the marriage between AMOS and MARY MAGDALENE turns out to be childless, he casts her out and gets a divorce. Mary has to leave Magdala.\nShe befriends SILVANO, a Roman prefect, who promises her a new life at his side.\nA few days after her departure Mary meets the prophet JOHN THE BAPTIST, whom Silvano suspects of being a revolutionary.\nThe prefect tells her to cultivate John more intensively.\nIn this way Mary becomes acquainted with the teaching of the coming Messiah, and it begins to interest her.\nTo protect John from the Romans she pretends to Silvano that he is harmless.\nbut when the prefect finds out that how dangerous John is in the eyes of the tetrarch HEROD ANTIPAS, he feels he was wronged and purposely tricked by Mary.\nHe casts her out as well. After a suicide attempt, Mary lowers herself to prostitution.\nHEROIDAS, the wife of Herod Antipas, invites Mary to come to her because of her knowledge of the healing arts...\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Drama / Geschiedenis\nTijdsduur     : 94 minuten\nJaar \t      : 2000","torrent":{"xt":"urn:btih:6b38c5a3f2347e8f09d6007877a5d90dd68d6dc5","amp;dn":"Maria+Magdalena+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b38c5a3f2347e8f09d6007877a5d90dd68d6dc5","infoHashBuffer":{"type":"Buffer","data":[107,56,197,163,242,52,126,143,9,214,0,120,119,165,217,13,214,141,109,197]},"announce":[],"urlList":[]}}