{"title":"Tinker Tailor Soldier Spy [2011] 500MB BRRip x264-RippeR","uid":6999732,"size":544498208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d60f69c4a44be20666b9887385a8f529a039d27&amp;dn=Tinker+Tailor+Soldier+Spy+%5B2011%5D+500MB+BRRip+x264-RippeR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"etlover","files":5,"time":1327970438,"description":"In the bleak days of the Cold War, espionage veteran George Smiley is forced from semi-retirement to uncover a Soviet agent within MI6's echelons.\nIn the early 1970s during the Cold War, the head of British Intelligence, Control, resigns after an operation in Budapest, Hungary goes badly wrong. It transpires that Control believed one of four senior figures in the service was in fact a Russian agent - a mole - and the Hungary operation was an attempt to identify which of them it was. Smiley had been forced into retirement by the departure of Control, but is asked by a senior government figure to investigate a story told to him by a rogue agent, Ricky Tarr, that there was a mole. Smiley considers that the failure of the Hungary operation and the continuing success of Operation Witchcraft (an apparent source of significant Soviet intelligence) confirms this, and takes up the task of finding him. Through the efforts of Peter Guillam, Smiley obtains information that eventually leads him to Jim Prideaux, the agent at the heart of the Hungary fiasco...\n\nNOTES : RippeR brings to you another high quality release in small size. English Subtitles added. Check sample before downloading :)","torrent":{"xt":"urn:btih:6d60f69c4a44be20666b9887385a8f529a039d27","amp;dn":"Tinker+Tailor+Soldier+Spy+%5B2011%5D+500MB+BRRip+x264-RippeR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d60f69c4a44be20666b9887385a8f529a039d27","infoHashBuffer":{"type":"Buffer","data":[109,96,246,156,74,68,190,32,102,107,152,135,56,90,143,82,154,3,157,39]},"announce":[],"urlList":[]}}