{"title":"Rocky V (5) Directors Cut 1990 Workprint.Linzi1983","uid":6979346,"size":756863798,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e27ecaf08f9d8156e91500927f205b09424296f&amp;dn=Rocky+V+%285%29+Directors+Cut+1990+Workprint.Linzi1983&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFreddy83","files":2,"time":1327348616,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0100507/alternateversions&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0100507/alternateversions&lt;/a&gt;\n\nPLEASE READ CAREFULLY BEFORE DOWNLOADING\n\n\n\nROCKY V (5) DIRECTORS CUT ORIGINAL WORKPRINT\n\nIn 2002, director John G. Avildsen released a work-print version of the film online, under the title &quot;Rocky V: Director's Cut&quot;. In this version, the opening credits are completely different, with different music. Additionally, the music throughout the film is decidedly different then that used in the final version of the film; in particular, there is a lot more Bill Conti music rather than the songs used in the theatrical cut. Several scenes are edited differently in the Director's Cut, and often with different dialogue. There are also a number of deleted scenes in the film, including a scene of Rocky getting drunk at the bar prior to visiting Mighty Mick's Boxing, and a scene where Rocky meets Marie from Rocky (1976) to find that she is a prostitute and has just become homeless. Additionally, the Director's Cut has a completely different edit of the street fight, with new music, and also includes the Mickey hallucination scene.\n\n\n\nThe quality is as you would expect for a workprint made over 20 years ago i guess this is for die hard Rocky fans or people who wanted to see what should have been released in the first place\n\n\n\nAudio has been fixed as it was way out of sync i would advise streaming to a large tv or even to a dvd makes it alot easier to watch\n\nIF YOU ARE EXPECTING A MODERN DAY DVD RIP then this isnt for you otherwise please proceed to download\n\n\n\nHope you enjoy i thought this version was awesome\n\n\n\nPlease SEED\n\nscreen can be seen on my demonoid account \n\n","torrent":{"xt":"urn:btih:6e27ecaf08f9d8156e91500927f205b09424296f","amp;dn":"Rocky+V+%285%29+Directors+Cut+1990+Workprint.Linzi1983","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e27ecaf08f9d8156e91500927f205b09424296f","infoHashBuffer":{"type":"Buffer","data":[110,39,236,175,8,249,216,21,110,145,80,9,39,242,5,176,148,36,41,111]},"announce":[],"urlList":[]}}