{"title":"Anti-Trojan Elite 5.5.7 Portable (registered)","uid":6932333,"size":8489437,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6ee55ed3dcca1bf621028c218d6dc374449a21f9&amp;dn=Anti-Trojan+Elite+5.5.7+Portable+%28registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1325700344,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnassasary regestry changes,\nThis makes a portable version a better version.\n\n\nAnti Trojan Elite(ATE) is a malware remover, it can detect and clean malware in disk or memory.\n\nAnti Trojan Elite provide a real-time malware firewall for user, once a trojan or keylogger would been loaded, the ATE can detect, block and then clean it in time. The ATE can detect more than 55000 trojans, worms and keyloggers currently, and the number of malware ATE could clean is growing up very quickly, we collect world-wide malwares, user can using our auto live update feature to get the power to clean these new malwares in time.\n\nAnti Trojan Elite has some useful utilities especially.[Screenshots] The network utility can been used to disconnect suspicious TCP connections; The process utility can been used to kill suspicious processes even the process has the system priviage, even it has the ability to unload suspicious modules in all processes; The registry repair utility can been used to repair registry altered by malware; The registry monitor utility can been used to repair any change of important registry keys and values with real time.\n\n\n\nReal-time malware firewall, protecting user's computer in real-time.\nDetecting and cleaning binded malware, doesn't hurt normal file and clean the malware.\nDetecting and cleaning no process malware, some malware don't have a EXE file, they are only some DLL files and running as some threads in other process, ATE can detect and clean this type of malware even it's running. \nFree tools. View the information of Tcp/Ip states and processes informations.\n\n\n-Disk and memory scan supported.\n\n-Real-time malware firewall.\n \n-Compressed files (RAR ZIP CAB) scan supported.\n\n-Backup module: Backup trojan files before killing.\n\n-Network Manager. View the tcp/udp states and the processes they belonged to. User can disconnect any tcp connection and stop the opposite process.\n\n-Process manager. View the processes and its DLL modules' information. User can terminate any process and unload any DLL module.\n\n-Internet Explorer and registry repair utility.\n\n-Updating online supported, and auto check updates when ATE starts.\n\n-Real-time registry monitor utility.","torrent":{"xt":"urn:btih:6ee55ed3dcca1bf621028c218d6dc374449a21f9","amp;dn":"Anti-Trojan+Elite+5.5.7+Portable+%28registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ee55ed3dcca1bf621028c218d6dc374449a21f9","infoHashBuffer":{"type":"Buffer","data":[110,229,94,211,220,202,27,246,33,2,140,33,141,109,195,116,68,154,33,249]},"announce":[],"urlList":[]}}