{"title":"Wrath of the Titans. Official Movie Trailer [HD]","uid":6904247,"size":40669696,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:7460d2b1f89fbf7dc597309221e315fb164aee9c&amp;dn=Wrath+of+the+Titans.+Official+Movie+Trailer+%5BHD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"proffcom","files":-1,"time":1324515317,"description":"In theaters: March 30th, 2012\n\nSynopsis:\n\nA decade after his heroic defeat of the monstrous Kraken, Perseus (Worthington) --the demigod son of Zeus (Neeson)--is attempting to live a quieter life as a village fisherman and the sole parent to his 10-year old son, Helius. Meanwhile, a struggle for supremacy rages between the gods and the Titans. Dangerously weakened by humanity's lack of devotion, the gods are losing control of the imprisoned Titans and their ferocious leader, Kronos, father of the long-ruling brothers Zeus, Hades (Fiennes) and Poseidon (Danny Huston). The triumvirate had overthrown their powerful father long ago, leaving him to rot in the gloomy abyss of Tartarus, a dungeon that lies deep within the cavernous underworld. Perseus cannot ignore his true calling when Hades, along with Zeus' godly son, Ares (Edgar Ramirez), switch loyalties and make a deal with Kronos to capture Zeus. The Titans' strength grows stronger as Zeus' remaining godly powers are siphoned, and hell is unleashed on earth. Enlisting the help of the warrior Queen Andromeda (Rosamund Pike), Poseidon's demigod son, Argenor (Toby Kebbell), and fallen god Hephaestus (Bill Nighy), Perseus bravely embarks on a treacherous quest into the underworld to rescue Zeus, overthrow the Titans and save mankind. \n\nGenre: Action and Adventure, Science Fiction, Fantasy\n\nDirector: Jonathan Liebesman\n\nCast: Sam Worthington, Ralph Fiennes, Liam Neeson, Danny Huston, Edgar Ramiez, Bill Nighy, Toby Kebbell, Rosamund Pike\n\nWriters: Dan Mazeau, David Leslie Johnson\n\n\n___________________________________________________________\n\nVideo: Xvid 848x360 23.98fps\n\nAudio: MPEG Audio Layer 3 44100Hz stereo 320kbps\n___________________________________________________________","torrent":{"xt":"urn:btih:7460d2b1f89fbf7dc597309221e315fb164aee9c","amp;dn":"Wrath+of+the+Titans.+Official+Movie+Trailer+%5BHD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7460d2b1f89fbf7dc597309221e315fb164aee9c","infoHashBuffer":{"type":"Buffer","data":[116,96,210,177,248,159,191,125,197,151,48,146,33,227,21,251,22,74,238,156]},"announce":[],"urlList":[]}}