{"title":"The Fabricated Paul: Early Christianity in the Twilight","uid":16024702,"size":483440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74a6cef4adfd410c20523a66492361e8cd8a103c&amp;dn=The+Fabricated+Paul%3A+Early+Christianity+in+the+Twilight&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476370809,"description":"The Fabricated Paul: Early Christianity in the Twilight - Hermann Detering [epub]\r\n\r\nIn theology and church Paul is regarded as the most important and most reliable historical witness to Jesus and early Christianity. This book nevertheless contradicts the common conception and shows that all the Pauline letters are in fact skillful falsifications from the second century.\r\n\r\nThe author solves the numerous unresolved questions that surround the figure and the writings of Paul until today in convincing and scholarly original ways. At the same time, the reader accompanies him on his breath-taking trip through the mysterious world of Gnosticism and the early Christianities.\r\n\r\nNumerous individual observations which have not been considered by theologians until now are brought together to produce an entirely new picture of early Christianity. At the end of the book the puzzle of Paul finds a solution that is as amazing as it is illuminating.\r\n\r\nThis exciting history of the spuriousness of all the Pauline writings allows the time of earliest Christianity to appear in an entirely new light and invites a critical consideration and new evaluation of presumably certain facts of Christian history.\r\n\r\n&quot;Hermann Detering once again proves himself the most keenly insightful New Testament scholar of this generation, worthy to stand among the neglected giants of the radical criticism whose work he has brought to light to stir today's Bible students from their deep dogmatic slumbers. My own debt to his work is profound.&quot;\r\n- Prof. Robert M. Price","torrent":{"xt":"urn:btih:74a6cef4adfd410c20523a66492361e8cd8a103c","amp;dn":"The+Fabricated+Paul%3A+Early+Christianity+in+the+Twilight","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74a6cef4adfd410c20523a66492361e8cd8a103c","infoHashBuffer":{"type":"Buffer","data":[116,166,206,244,173,253,65,12,32,82,58,102,73,35,97,232,205,138,16,60]},"announce":[],"urlList":[]}}