{"title":"El Mentalista - Temp.4 [HDTV][Cap.411][Spanish]","uid":6983120,"size":360334118,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:74b0764997612f01b21508b7a5f8af818c6b0978&amp;dn=El+Mentalista+-+Temp.4+%5BHDTV%5D%5BCap.411%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"IBM00","files":1,"time":1327478133,"description":"De la mano de David Nutter (Sobrenatural, Sin Rastro) nos llega ahora The Mentalist, una serie que gira en torno a Patrick Jane (Simon Baker, El guardiÃƒÂ¡n), un psÃƒÂ­quico muy conocido por sus populares apariciones en televisiÃƒÂ³n quien, despuÃƒÂ©s de ser descubierto como un verdadero fraude, decide empezar a ayudar a la Oficina de InvestigaciÃƒÂ³n de California Bureau a resolver los crÃƒÂ­menes que se les presenta, ya que como mentalista, Patrick puede usar sus extremadamente desarrolladas habilidades para la observaciÃƒÂ³n, la deducciÃƒÂ³n y la manipulaciÃƒÂ³n para conseguir echar una mano a esta unidad criminal.\n\nEs carismÃƒÂ¡tico y le gusta considerarse como un moderno Sherlock Holmes cuyos controvertidos mÃƒÂ©todos a menudo cruzan la lÃƒÂ­nea, pero que siempre se revelan como los adecuados para su trabajo. Dentro de la Oficina de InvestigaciÃƒÂ³n de California (CBI) trabaja como asesor independiente y en los ÃƒÂºltimos tiempos ha logrado acumular un destacable rÃƒÂ©cord de casos solucionados, gracias a sus dotes para la observaciÃƒÂ³n. Su habilidad para leer a la gente, al igual que a todos los que les rodean, ha convertido a Patrick en un valor incalculable para el departamento de policÃƒÂ­a de California, aunque sus propios compaÃƒÂ±eros se nieguen a creer a menudo que las respuestas a crÃƒÂ­menes tan complicados estÃƒÂ©n a la vista de forma tan fÃƒÂ¡cil.\n\nPero a pesar de tener la increÃƒÂ­ble habilidad de conseguir solucionar los casos mÃƒÂ¡s complicados, Patrick es conocido en el cuerpo por su falta de disciplina, ya que raramente actÃƒÂºa segÃƒÂºn las normas y opta por romper constantemente el protocolo marcado, lo que le enfrenta frecuentemente con sus superiores. Y para empeorar aÃƒÂºn mÃƒÂ¡s las cosas, Patrick suele intentar mantener su reputaciÃƒÂ³n como mentalista al tiempo que se esfuerza por ganar un poco mÃƒÂ¡s de la notoriedad que perdiÃƒÂ³ en los ÃƒÂºltimos aÃƒÂ±os, despuÃƒÂ©s de reconocer pÃƒÂºblicamente que simulÃƒÂ³ tener habilidades paranormales.\n\nTeresa Lisbon (Robin Tunney, Prison Break) es una de las mejores agentes del CBI y debido a su experiencia sobre el terreno suele estar destinada a trabajar con Patrick. Se resiste abiertamente a tenerle en su unidad y aunque reconoce su talento a regaÃƒÂ±adientes, estÃƒÂ¡ decidida a resolver los casos con su ayuda o sin ella. Todo ello a pesar de que termine alternando siempre entre el reacio reconocimiento de la utilidad de Patrick y el rechazo que le produce su teatralidad, narcisismo y su peligrosa falta de lÃƒÂ­mites y de disciplina.\n\nEl equipo de Lisbon incluye a los agentes Kimball Cho (Tim Kang, Turno de guardia), un joven con un ÃƒÂ¡cido sentido del ingenio, Wayne Rigsby (Omain Yeoman, Generation Kill), un policÃƒÂ­a no muy espabilado, y la novata Grace Van Pelt (Amanda Righetti, Reunion), que tiene un fuerte y devoto perfil religioso. Todos ellos creen que Patrick es un fraude como mentalista, pero no pueden mÃƒÂ¡s que admirar el encanto personal que desprende y su facilidad para aclarar los casos que investigan. Sin embargo, aunque respetan su habilidad para capturar a los criminales, tambiÃƒÂ©n le ven como alguien externo a su unidad que no duda en poner en peligro a todos rompiendo las normas y haciendo las cosas a su manera.\n\n\n\nReparto:\nSimon Baker: Patrick Jane\nRobin Tunney: Teresa Lisbon\nAmanda Righetti: Grace Van Pelt\nTim Kang: Kendall Cho\nOwain Yeoman: Wayne Rigsby","torrent":{"xt":"urn:btih:74b0764997612f01b21508b7a5f8af818c6b0978","amp;dn":"El+Mentalista+-+Temp.4+%5BHDTV%5D%5BCap.411%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74b0764997612f01b21508b7a5f8af818c6b0978","infoHashBuffer":{"type":"Buffer","data":[116,176,118,73,151,97,47,1,178,21,8,183,165,248,175,129,140,107,9,120]},"announce":[],"urlList":[]}}