{"title":"Stargate Atlantis S05D05 2008-2009 (Eng)(Eng NL sub) TBS B-SAM","uid":6936064,"size":4510455522,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:751bcb03310fd9662bd73c3542dc994f359cbe5a&amp;dn=Stargate+Atlantis+S05D05+2008-2009+%28Eng%29%28Eng+NL+sub%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"longdeer","files":-1,"time":1325833083,"description":"Stargate Atlantis S05D05      (Laatste)\n\nNederlands:\nDisk 5 (van 5) van Seizoen 5 (van 5) van de serie\nStargate Atlantis met o.a. Nederlandse ondertiteling.\n\n\n\nStargate Atlantis is het vervolg op de SF film Stargate\nen de SF serie Stargate SG1.\n\nMet o.a.\nJoe Flanigan, Rachel Luttrel, David Hewlett, Jason Momoa,\nTorri Higginson, Paul McGillion, David Nykl en Chuck Campbell.\n\n\n\nOp disk 5 de afleveringen:\n\n1 Infection -\nEen Wraith ship verschijnt boven Atlantis. Ze ontvangen een beschadigde videoboodschap van Todd de Wraith waar het Atlantis-team weinig mee kan. Onderzoek lijkt uit te wijzen dat het schip geen levenstekenen vertoont.\nNadat ze het schip verkennen blijkt dat er gemuteerde Wraith rondlopen\ndie het op hen gemunt hebben. Met de hulp van Todd proberen ze levend\nvan het schip te komen dat zelf ook geÃƒÂ¯nfecteerd is en niet van plan is\nhen te laten gaan en zich makkelijk laat besturen.\n2. Identity -\nEen bende artefactdieven stuit op een artefact waardoor per ongeluk Dokter Keller en de vrouwelijke bendeleider Neeva Kessal van geest wisselen. Nadat Neeva ontmaskerd is haast het Atlantis team zich naar de planeet van het artefact om Dokter Keller te redden. Dit blijkt hard nodig, omdat ze net veroordeeld is voor Neeva's misdaden en ter dood zal worden gebracht. De rest van Neeva's bende is niet van plan lijdzaam toe te kijken dat hun leider omgebracht wordt, maar de waarheid over de persoonsverwisseling is iets waar\nze veel moeite mee hebben en een nieuw gevaar oplevert. \n3. Vegas -\nIn een alternatieve dimensie blijkt het leven van John Sheppard een andere wending te hebben genomen door een anders gelopen keuze met catastrofale gevolgen. Als verbitterde privÃƒÂ© detective onderzoekt hij vreemde moorden. Het leven lijkt letterlijk uit de slachtoffers gezogen te zijn. Niet zo verwonderlijk is dat hier een Wraith achter zit die zich vermomd onder de mensheid begeeft. Door zijn psychische gaven is hij bijzonder goed in het pokerspel en redt hij zich prima tot John hem op het spoor komt. Dokter McKay die weet hoe John had kunnen zijn neemt hem in vertrouwen en vertelt over de Wraith en hun werkwijze en dat de Wraith in kwestie een machine probeert de bouwen waarvan de functie nog onbekend is. Prioriteit is hem tegen te houden voordat het voltooid is. John weet hem te vinden maar hem tegenhouden blijkt moeilijk. Een paar gevechtsstraaljagers arriveren om de klus te klaren, maar vlak voordat de Wraith omkomt weet hij zijn machine te activeren. De aarde van de dimensie van detective Sheppard blijkt gered, maar die van de aangrenzende dimensies des te minder. Het gevaar bestaat dat de locatie op een brede frequentie is verzonden. \n4. Enemy at the Gate -\n(Tevens laatste aflevering van Stargate Atlantis). Het Stargate team ontvangt een verontrustend bericht van Todd waaruit blijkt dat een Wraith Hive wordt uitgerust om op ZPM energie te draaien. Todd is verraden, verbolgen en zoekt daarom wraak. Het schip is nog niet op volle kracht en het is zaak dit ook niet te laten gebeuren omdat voltooiing de Hive onvernietigbaar zal maken. Wat het nog urgenter maakt is de ontdekking van een Wraith signaal dat de locatie van Aarde verraadt aan de superhive. De enige schepen om de strijd mee aan te gaan zijn niet meer beschikbaar, waardoor alleen Atlantis zelf nog als een laatste linie van verdediging overblijft tussen de aarde en de Wraith. John gaat naar aarde terug om daar de allerlaatste linie te gaan bedienen wat helaas gedwarsboomd wordt. Door een beveiligingslek is de rest van het team op de superhive gekomen waar John ondertussen ook gearriveerd is. Door tussenkomst van Atlantis heeft het team net genoeg tijd om de voorbereidingen te voltooien om veilig weg te komen voordat het gevaar geneutraliseerd wordt.\n\n\nCategorie: Beeld\nFormaat: DVD5\nBron: WEB\nStandaard: PAL\nAudio: Engels, Frans\nOndertiteling: Engels, Frans en Nederlands\nMenu: Ja\nCover: Ja\nGenre: SF\n\n\n\nLink &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Lijst_van_afleveringen_van_Stargate_Atlantis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Lijst_van_afleveringen_van_Stargate_Atlantis&lt;/a&gt;\n\n\n\n\nKom eens kijken bij \n\n\n\n  &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:751bcb03310fd9662bd73c3542dc994f359cbe5a","amp;dn":"Stargate+Atlantis+S05D05+2008-2009+%28Eng%29%28Eng+NL+sub%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"751bcb03310fd9662bd73c3542dc994f359cbe5a","infoHashBuffer":{"type":"Buffer","data":[117,27,203,3,49,15,217,102,43,215,60,53,66,220,153,79,53,156,190,90]},"announce":[],"urlList":[]}}