{"title":"Thomas Bell - Out of This Furnace: Immigrant Labor in America","uid":15948037,"size":4166250,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7671a79500a6b405d0e4007248c86fcc5d63fe0d&amp;dn=Thomas+Bell+-+Out+of+This+Furnace%3A+Immigrant+Labor+in+America&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":57,"uploader":"theonewithboringusername","files":5,"time":1475534209,"description":"Out of This Furnace is Thomas Bell’s most compelling achievement.  Its story of three generations of an immigrant Slovak family -- the Dobrejcaks -- still stands as a fresh and extraordinary accomplishment.\r\n\r\n\r\nThe novel begins in the mid-1880s with the naive blundering career of Djuro Kracha. It tracks his arrival from the old country as he walked from New York to White Haven, his later migration to the steel mills of Braddock, Pennsylvania, and his eventual downfall through foolish financial speculations and an extramarital affair. The second generation is represented by Kracha’s daughter, Mary, who married Mike Dobrejcak, a steel worker. Their decent lives, made desperate by the inhuman working conditions of the mills, were held together by the warm bonds of their family life, and Mike’s political idealism set an example for the children. Dobie Dobrejcak, the third generation, came of age in the 1920s determined not to be sacrificed to the mills. His involvement in the successful unionization of the steel industry climaxed a half-century struggle to establish economic justice for the workers.\r\n\r\n\r\nOut of This Furnace is a document of ethnic heritage and of a violent and cruel period in our history, but it is also a superb story. The writing is strong and forthright, and the novel builds constantly to its triumphantly human conclusion","torrent":{"xt":"urn:btih:7671a79500a6b405d0e4007248c86fcc5d63fe0d","amp;dn":"Thomas+Bell+-+Out+of+This+Furnace%3A+Immigrant+Labor+in+America","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7671a79500a6b405d0e4007248c86fcc5d63fe0d","infoHashBuffer":{"type":"Buffer","data":[118,113,167,149,0,166,180,5,208,228,0,114,72,200,111,204,93,99,254,13]},"announce":[],"urlList":[]}}