{"title":"Vampires must be crazy 1993","uid":6946063,"size":980571583,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:768f1039ae59ebecc0261bbebdaca1f9bf1836a0&amp;dn=Vampires+must+be+crazy+1993&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZnoteCross","files":3,"time":1326232602,"description":"screen1: http://bayimg.com/AalEHAadn\nscreen2: http://bayimg.com/AAleIAAdN\n\n\nThis movie was one of my favourite movies during my childhood, and then, \n15 years later I just happen to remember this movie, tried to remember it.\nHowever, I only remembered small fragments of the movie, so it took me alot\nof research to find it again. Luckily I found the raw format and decided to rip it.\n\nKeep in mind this is a very old movie, and was distributed throught a cassette.\nBecause of this, even tho its a raw copy, you get the good old retro crappy quality.\n(However quality here seem to be alot better than the other rips out there, you wont regret).\n\nChineese and English are hardsubbed into the casette, so just bare with it. You will get used \nto it, its not all that bad. \n\nDue to the nature of the movie being recorded in Africa? With Chineese actors, the audio \nchanges from English to Chineese to some weird african? language depending on the situation\nand who are speaking, so the hardsubs comes in really handy. \n\nThis movie has already reached its prime in economy and I dont think the producer will mind me \nripping this, because there is no economical loss in it for them, they are only getting some\nextra attention which in the end shouldn't mind them. \n\nDownload and play, regular windows media player should be compatible with this video format. \nElse, media player classic with CCCP community codec pack also works like a charm.\nTested with WMP and MPC (cccp codec) on Windows 7 64bit without any problems. \n\nEnjoy, and please help me seed it so this movie stays alive!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0101864/plotsummary&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0101864/plotsummary&lt;/a&gt;","torrent":{"xt":"urn:btih:768f1039ae59ebecc0261bbebdaca1f9bf1836a0","amp;dn":"Vampires+must+be+crazy+1993","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"768f1039ae59ebecc0261bbebdaca1f9bf1836a0","infoHashBuffer":{"type":"Buffer","data":[118,143,16,57,174,89,235,236,192,38,27,190,189,172,161,249,191,24,54,160]},"announce":[],"urlList":[]}}