{"title":"Cyber Update Jan.2012------HT-18118 Ariel X and Gia DiMarco","uid":7004145,"size":649261728,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:77a2b5ca4c61148974bf83a27985561042d7dd40&amp;dn=Cyber+Update+Jan.2012------HT-18118+Ariel+X+and+Gia+DiMarco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1328203341,"description":"From Kink.com  (Hogtied)  + Pics\n\n\n\nWelcome to another installment of the Hogtied feature movie series. These movies are real life fantasies of the girls who appear in the films, played out in a safe and sane environment for your viewing pleasure. This month's installment is &quot;You Own Me&quot; starring Ariel X with special co-top Gia DiMarco. \n\nAriel X is back from a medical leave and pumped to wrestle again for Ultimate Surrender. It's been almost 6 months, the over-all Champion is back and healthy, ready to take on the sexy Gia DiMarco. \n\nRight before the match Ariel gets a disturbing phone call from her agent. Ariel learns the reason she has never gotten a Divine Bitches shoot as a top: she is too nice. The powers that be at Kink have decided since Ariel is helpful and compassionate to new wrestlers then she must be &quot;soft&quot;, not someone who could be called a Divine Bitch.\n\n What transpires next is an affront to good sportsmanship. Ariel X destroys Gia on the mat, to the point where Ariel's actions could be considered criminal. A most brutal, heinous beat down. It is obvious she is trying to physically hurt Gia to prove a selfish point. Gia, being the professional model she is, endures until the end when she is knocked unconscious by an out of control Ariel. \n\nIt turns out that Gia is someone you really don't want to fuck with. Her strict and thorough training at the feet of MaÃƒÂ®tresse Madeline pays off for now it is time for revenge and revenge will be swift and brutal. Gia arranges for Ariel to be &quot;taken out&quot; and when Ariel awakens she is physically helpless, bound &amp; gagged. Gia controls Ariel's body, it won't be much longer until she controls her mind and sexuality to a level that makes Ariel X a common sexual slave... \n\n\nScreens &lt;a href=&quot; http://www.hogtied.com/site/shoot.jsp?shootId=18118&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hogtied.com/site/shoot.jsp?shootId=18118&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:77a2b5ca4c61148974bf83a27985561042d7dd40","amp;dn":"Cyber+Update+Jan.2012------HT-18118+Ariel+X+and+Gia+DiMarco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77a2b5ca4c61148974bf83a27985561042d7dd40","infoHashBuffer":{"type":"Buffer","data":[119,162,181,202,76,97,20,137,116,191,131,162,121,133,86,16,66,215,221,64]},"announce":[],"urlList":[]}}