{"title":"Digital Sentry v. 2.1.6 with Core keygen","uid":6920972,"size":13350933,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:77ed5d2d82da6f44586cc05f0995e735373d9c4b&amp;dn=Digital+Sentry+v.+2.1.6+with+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"polisdavid","files":-1,"time":1325216244,"description":"Official Web Site: &lt;a href=&quot; http://www.koingosw.com/products/digitalsentry.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.koingosw.com/products/digitalsentry.php&lt;/a&gt;\n\nDigital Sentry monitors your system for specific events, and then can perform a vast array of unique actions in response. Use it to automatically cleanse internet history when closing a browser, automate redundant computer tasks, perform covert surveillance, or even protect your sensitive data during unauthorized access or theft!\n\nWatch for such system events as waking from sleep, program launches, closes, or switches, file modifications, incorrect password attempts, mouse and keyboard input, and many more. Then, perform any number of tasks like sending an e-mail, shutting down the computer, starting a simulated self-destruct, pinging a web URL, taking a web cam shot, taking a screenshot, playing a multimedia file, speaking some text, executing a shell script... the list goes on!\n\nCurious who's been using your computer while you make a quick trip out of the room? Turn on the 'incorrect password' attempt monitor, and have Digital Sentry take a picture of them with a web cam, e-mail it to you, and then sending you a notification by text message to your cell phone! Ideal for catching a thief in the event your laptop has been stolen.\n\nAlternatively, use Digital Sentry to organize your life by performing a task such as speaking a line of text on an interval to remind you to get up from the computer and stretch, or to perform a system backup. In the case of a backup, then even get Digital Sentry to do it for you by executing a shell script.\n\nWhat's New:\n\n* Bug Fix: Screenshot on Lion fixed.\n\nSystem Requirements:\n\nIntel Mac, OS X.5 or better\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:77ed5d2d82da6f44586cc05f0995e735373d9c4b","amp;dn":"Digital+Sentry+v.+2.1.6+with+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77ed5d2d82da6f44586cc05f0995e735373d9c4b","infoHashBuffer":{"type":"Buffer","data":[119,237,93,45,130,218,111,68,88,108,192,95,9,149,231,53,55,61,156,75]},"announce":[],"urlList":[]}}