{"title":"Works of Sri Sankaracharya[English Translation][Team Nanban][TPB","uid":6981185,"size":461123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:794cbd8948c790fc0ca173d7a68496b6801bf1e7&amp;dn=Works+of+Sri+Sankaracharya%5BEnglish+Translation%5D%5BTeam+Nanban%5D%5BTPB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"594mgnav","files":2,"time":1327412435,"description":"Works of Sri Sankaracharya[English Translation][Team Nanban][TPB]\n\nEastern Tradition Research Institute | 2007 | English | Religious\n\nSHORT DESCRIPTION ON SRI AADI SANKARAACHARYA:\n\nAdi Sankaracharya (788-821 CE) was a great saint &amp; philosopher who consolidated \nthe doctrine of Advaita Vedanta, a sub-school of Vedanta. His teachings are based on \nthe unity of the soul and Brahman, in which Brahman is viewed as without attributes. \nHe hailed from Kalady of present day Kerala. Sankara travelled across India and other parts of South Asia to propagate his philosophy through discourses and debates with other thinkers. He founded four mathas (monasteries), which helped in the historical development, revival and spread of Advaita Vedanta. Adi Sankara is believed to be the organizer of the Dasanami monastic order and the founder of the Shanmata tradition of worship.\n\nHis works in Sanskrit concern themselves with establishing the \ndoctrine of Advaita (Non-dualism). He also established the importance of monastic life \nas sanctioned in the Upanishads and Brahma Sutra, in a time \nwhen the Mimamsa school established strict ritualism and \nridiculed monasticism. Sankara represented his works as elaborating on ideas found \nin the Upanishads, and he wrote copious commentaries on \nthe Vedic Canon (Brahma Sutra, Principal Upanishads and Bhagavadgita) in support of \nhis thesis. The main opponent in his work is the Mimamsa school of thought, \nthough he also offers some arguments against the views of some other schools like \nSamkhya and certain schools of Buddhism that he was partly familiar with.\n\n\nTHIS TORRENT HAS THE ENGLISH TRANSLATION OF ORIGINAL WORKS OF SRI AADI SANKARAACHAARYA.\n\nPLZ SEED AFTER DOWNLOADING..\n\n&quot;LIVE AND LET LIVE&quot;\n\nI HAVE UPLOADED THE GREAT MAN'S WORKS IN GOD'S OWN LANGUAGE ALREADY...\n\nPLZ READ THAT TOO..THERE IS A DIFFICULT SITUATION NOW AS THE GOD'S OWN LANGUAGE &quot;SANSKRIT&quot; IS GOING TO BE ANNOUNCED AS &quot;DEAD LANGUAGE&quot;.!!\n\nPLZ DONT MAKE THAT HAPPEN...I LEARNT SANSKRIT COZ OF MY INTEREST TO STUDY GREAT EPICS AND ALSO TO SAVE IT..\n\nPLZ DONT LET SANSKRIT DIE..DO UR BIT TO SAVE THE HOLY LANGUAGE WHICH SERVED AS A ROOT CAUSE FOR MANY INDIAN AND EUROPEAN LANGUAGES...\n\nPLZ SEED AS MUCH AS U CAN..ESPECIALLY THE TORRENTS WITH SANSKRIT WORKS..\n\nI AM AGAINST THE DECISION TO ANNOUNCE SANSKRIT AS A DEAD LANGUAGE..ARE YOU?????\n\n\nSpecial thanks to &quot;burt007&quot; and &quot;unnim2&quot;.","torrent":{"xt":"urn:btih:794cbd8948c790fc0ca173d7a68496b6801bf1e7","amp;dn":"Works+of+Sri+Sankaracharya%5BEnglish+Translation%5D%5BTeam+Nanban%5D%5BTPB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"794cbd8948c790fc0ca173d7a68496b6801bf1e7","infoHashBuffer":{"type":"Buffer","data":[121,76,189,137,72,199,144,252,12,161,115,215,166,132,150,182,128,27,241,231]},"announce":[],"urlList":[]}}