{"title":"The Elder Scrolls V: Skyrim MULTI8 [Steam] 2011-12-08","uid":6883482,"size":14389352928,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7a03daf7f1b784b07b414e624561810200a695e8&amp;dn=The+Elder+Scrolls+V%3A+Skyrim+MULTI8+%5BSteam%5D+2011-12-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"givemethis","files":-1,"time":1323732418,"description":"This is The Elder Scrolls V: Skyrim (updated to v1.3.7). Release includes ncf files, game files and no-steam cracks. All validated in CFToolbox.\nAvailable languages: english, russian, german, french, spanish, italian, polish and czech (only subtitles for czech).\n\nFor installation you need:\n1. Installer from https://github.com/ArahnaBytes/SGI/downloads (not included in this release, tested on v1.0.4363.41913) - unpack to directory with downloaded release (MS .NET Framework 3.5 SP1 required).\n2. IF you don't want download whole release you should download (in instruction used names of directories without version numbers ;)):\n   a) AT LEAST &quot;skyrim content&quot;, &quot;skyrim exe&quot; and ONE of language directories.\n   b) IF you will use CZECH or POLISH languages you also should download &quot;skyrim english\\common\\Skyrim\\Data\\Skyrim - Voices.bsa&quot; and &quot;skyrim english\\common\\Skyrim\\Data\\Skyrim - VoicesExtra.bsa&quot; files.\n   c) IF you will use no-steam crack you also should download &quot;_Fixes&quot; directory.\n\nInstallation for NON LEGIT users:\n1. Install game using SteamGamesInstaller.exe: check &quot;Install application&quot;, check &quot;Install fixes&quot;, choose &quot;I will NOT use Steam&quot;, check &quot;Execute installation script&quot;, select any install directory, select language of game and click Install button. Wait when installer write &quot;Done&quot;.\n2. Launch SkyrimLauncher.exe in &quot;your install directory\\common\\Skyrim\\&quot; directory, tweak graphics options and play.\n\nInstallation for LEGIT users:\n1. Launch Steam and log into your Steam account.\n2. Click the Games Menu and choose Activate a Product on Steam...\n3. Enter product key and follow the onscreen instructions to complete the process.\n4. Right-click on the game title under the Library in Steam and select Properties.\n5. Go to the Language tab and select the language you wish to use from the drop-down menu and click OK.\n6. Click the View Menu and choose Downloads.\n7. Click Pause button to stop download game from Steam servers.\n8. Close Steam (close program, not only Steam window).\n9. Install game using SteamGamesInstaller.exe: check &quot;Install application&quot;, choose &quot;I will use Steam&quot;, select SteamApps directory (example: C:\\Program Files (x86)\\Games\\Steam\\SteamApps\\), select language of game and click Install button. Wait when installer write &quot;Done&quot;.\n10. Launch Steam, log into your account, right-click on the game title under the Library in Steam and select Properties.\n11. Go to the Local Files tab and click &quot;Verify integrity of game cache...&quot; button.\n12. Wait when Steam finish verification, close verification and properties windows.\n13. Select game in Library and click Play button, tweak graphics options and play.\n","torrent":{"xt":"urn:btih:7a03daf7f1b784b07b414e624561810200a695e8","amp;dn":"The+Elder+Scrolls+V%3A+Skyrim+MULTI8+%5BSteam%5D+2011-12-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a03daf7f1b784b07b414e624561810200a695e8","infoHashBuffer":{"type":"Buffer","data":[122,3,218,247,241,183,132,176,123,65,78,98,69,97,129,2,0,166,149,232]},"announce":[],"urlList":[]}}