{"title":"Mafia.III.Proper-RELOADED","uid":16002218,"size":43838901725,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7b3e42bff54dce2411fbe38deb345d3a7ca22d5e&amp;dn=Mafia.III.Proper-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ransacker51","files":2,"time":1476141192,"description":"Mafia III *Proper* (c) 2K\r\n    \r\n        10/2016 :..... RELEASE.DATE .. PROTECTION .......: Arxan+Custom+Steam\r\n              1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\r\n   \r\n                   Üßß  ÜßßÜ ÜßÜßÜ Üßß  ß ÜßßÜ ÜßßÜ ÜßßÜ Üß\r\n  ßßßßßßßßßßßßßßßß Û ß² Ûßß² Û   ² ²ß Ü Û Û  ² ²ß   Û  ² ßßßÛ ßßßßßßßßßßßßßßßß\r\n                    ßß  ß    ß   ß ßßßß ß ß    ß     ßß   ßß\r\n\r\n  It's 1968 and after years of combat in Vietnam, Lincoln Clay knows this\r\n  truth: family isn't who you're born with, it's who you die for.\r\n\r\n\r\n  Proper Note:\r\n  ~~~~~~~~~~~~\r\n  So here we are again. Another proper. And by proper we obviously mean\r\n  trolling; harassment.\r\n\r\n  Because this is what it has come to be about. Bitter and jaded old men in a\r\n  sick sort of last man standing contest, demanding that they're right, and\r\n  believing that they're in control. That everybody else is wrong and only\r\n  out to sabotage them. Pretending that their ego is so, so big, to cover that\r\n  it's so tiny as to barely be noticeable. Just waiting for the opportunity to\r\n  hawk on someone else. Desperately trying to make the claim that the other\r\n  groups release is shit: they're the true lamers, and liars to boot!\r\n\r\n  Maybe their release IS shit? Maybe their crack is in fact a potpourri of\r\n  hacked up and badly written code, &quot;inspired&quot; by those they claim to resent,\r\n  or straight up copied from others. Maybe they ARE indeed dishonest. Making\r\n  up rulesets that nobody agreed to, referencing them only when it suits them.\r\n  Trying to manipulate behind the curtains a concept so laughable as a\r\n  nukenet. Using updated versions of a game to make claims of bad cracks, when\r\n  the updated version was a bugfix. Or maybe they're actual shitheads, their\r\n  skulls literally filled to the brim with feces.\r\n\r\n  Or maybe... Oh damn, where was I? Right.\r\n\r\n  The CODEX release doesn't work for everybody. On certain systems and setups\r\n  the game just doesn't launch, whereas with our release, it does. No, we're\r\n  not going to help them by pointing out how and why, aka providing &quot;proof&quot; ;)\r\n\r\n  The updated v1.01 game is included in our pack, but we make no claim to have\r\n  unlocked FPS, nor that this in itself might fix anything release or crack\r\n  related.\r\n  \r\n  But, to top it all off, we present you with a release that contains a crack\r\n  which features an Arxan-rebuilt exe. Make of that what you will.\r\n  \r\n  And most of all: Enjoy and HAVE FUN! :D\r\n\r\n  TEAM RLD 2016\r\n\r\n  --\r\n\r\n\r\n             ß ÜßßÜ Üß   ²ÜÜ  ÜßßÜ ²   ²   ÜßßÜ ÜßßÜ ²ÜÜ  Üßß  Üß\r\n  ßßßßßßßßßß Û Û  ² ßßßÛ Û  Ü Ûßß² Û   Û   Û  ² Û  ² Û  Ü ²ß Ü ßßßÛ ßßßßßßßßßß\r\n             ß ß     ßß   ßßß ß    ßßß ßßß ß     ßß   ßßß ßßßß  ßß\r\n\r\n\r\n  1. Unrar.\r\n  2. Burn or mount the image.\r\n  3. Install the game. \r\n  4. Copy over the cracked content from the /Crack directory on the image to\r\n     your game install directory.\r\n  5. Play the game.\r\n  6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:7b3e42bff54dce2411fbe38deb345d3a7ca22d5e","amp;dn":"Mafia.III.Proper-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3e42bff54dce2411fbe38deb345d3a7ca22d5e","infoHashBuffer":{"type":"Buffer","data":[123,62,66,191,245,77,206,36,17,251,227,141,235,52,93,58,124,162,45,94]},"announce":[],"urlList":[]}}