{"title":"Xhodon Giant World","uid":15815504,"size":6994897,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7c5d2b79ac11d10db9dbf4d645baad120841843d&amp;dn=Xhodon+Giant+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liceoma","files":93,"time":1473677219,"description":"Install Xhodon_Giant_World.apk to smart phone or bluestacks.\r\n\r\n-----\r\n\r\nLight or the cruel darkness? Choose a side and fight with all your strength. Anticipate the \r\n\r\nexciting adventures and tricky tasks that are waiting for you...\r\n\r\nAfter you decide at the beginning of Xhodon whether you want to fight on the side of light \r\n\r\nor dark, your path is already mapped out a whole lot. Now, an enchanted, magical world in \r\n\r\nwhich you have to show a lot of courage is waiting for you.\r\n\r\nXhodon provides for you, depending on which side you've picked, several different tasks \r\n\r\nthat must be overcome. Adventure becomes part of your daily life and magic will always be \r\n\r\non your side. Whether you are a male or female magician, you will certainly never be bored. \r\n\r\nThe essential thing in this browser game is gaining experience: Each action will get you \r\n\r\none step further towards your ultimate goal, namely global dominance.\r\n\r\nOn your way through Xhodon you will constantly meet other players, strange creatures and \r\n\r\nheroes. You cross their path and they will be your constant companion in the dark, scary \r\n\r\nwoods of Xhodon if you play your cards right. This is just a saying of course, as Xhodon is \r\n\r\na real-time strategy game with fantasy elements.\r\n\r\nYour own tree of life will help you so you don’t have to run through the woods of Xhodon \r\n\r\ncompletely ignorant. The tree reveals the secrets of Xhodon and initiates you into the \r\n\r\nwondrous Crystal Cave. Also, you need to know that there is a breeding station. There you \r\n\r\nwill have the opportunity to create mythical creatures and even to influence their \r\n\r\nproduction. But this is not everything. You will be the one who has power over time in \r\n\r\nXhodon. Attempt to find out how you can use this special ability and discover many more \r\n\r\nsecrets.\r\n\r\nXhodon contains many features and adventures. No matter which side you choose, whether \r\n\r\nlight or dark, both sides have their advantages and include exciting tasks. Attempt to be a \r\n\r\ngood trader, explore the many mysteries of Xhodon for yourself and procure phenomenal \r\n\r\nabilities with the help of your magical items","torrent":{"xt":"urn:btih:7c5d2b79ac11d10db9dbf4d645baad120841843d","amp;dn":"Xhodon+Giant+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5d2b79ac11d10db9dbf4d645baad120841843d","infoHashBuffer":{"type":"Buffer","data":[124,93,43,121,172,17,209,13,185,219,244,214,69,186,173,18,8,65,132,61]},"announce":[],"urlList":[]}}