{"title":"access2web","uid":6901063,"size":6996575,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d0687e96a4096c94742739fd161656232b40391&amp;dn=access2web&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"inncs77","files":3,"time":1324389637,"description":"Access2Web simplifies the task of creating websites from data stored in databases. This clever program lets you directly insert fields from a table or query into your existing HTML code.\n\nSimply import your code into Access2Web, connect to your database, and then double-click to insert fields wherever you choose. Once you`ve finished, Access2Web creates an index HTML file linked to a series of detail HTML files -- one for each record in your database.\n\nSpecial tags let you insert index-to-record links, loop through the records, and take care of records containing empty fields. The online help includes very useful samples.\n\nAnd once the site is designed, updating it from new data becomes a single-click operation. That`s what you can do with Access2Web, a stylish Danish program that merges data from your database with your HTML code.\n\n\nNote from uploader:\n\nFor some reason I needed this ancient app and could not find it anywhere on the web. Luckily I remembered it was still on some old computer I had. I upload this here now, so that next time I need this program I can easily find it...\n\nFunny that this program is nowhere available on the web, but it is still easy to find key generators for it. :) I included a working keygenerator in this torrent.\n","torrent":{"xt":"urn:btih:7d0687e96a4096c94742739fd161656232b40391","amp;dn":"access2web","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d0687e96a4096c94742739fd161656232b40391","infoHashBuffer":{"type":"Buffer","data":[125,6,135,233,106,64,150,201,71,66,115,159,209,97,101,98,50,180,3,145]},"announce":[],"urlList":[]}}