{"title":"LOST Complete Season 1 (Retail)(Multi Sub)(DVD9)","uid":6919869,"size":52602683392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7e058b64613a5fa284dc6740cb406d7a04d6fcb5&amp;dn=LOST+Complete+Season+1+%28Retail%29%28Multi+Sub%29%28DVD9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pharaootje","files":-1,"time":1325170606,"description":"Lost Season 1 (2004):\n\nCategorie: Beeld\nFormaat: DVD9\nBron: Retail\nStandaard: PAL\nAudio: English, German, French\nOndertiteling: English, German, French, Dutch, Norwegian, Danish, Swedish, Finnish, \nMenu: yes\nExtra\\'s: Yes\nCovers: Yes\n\n\nNederlands:\n\nDoor een vliegtuigcrash stranden de overlevenden van vlucht 815 van luchtvaartmaatschappij Oceanic op een \nschijnbaar verlaten tropisch eiland. De passagiers worden gedwongen samen te werken om te overleven op het \nmysterieuze eiland waar een monster in de jungle schijnt te leven, een metalen luik iets onbekend afsluit \nin de ondergrond en waar de zogenaamde \\&quot;anderen\\&quot; (de \\&quot;Others\\&quot;) schijnen te leven. Iedere aflevering vertelt \nmeer over de achtergrond van ÃƒÂ©ÃƒÂ©n van de mensen op het eiland aan de hand van flashbacks en toont waarom de \nverschillende personages zich op een bepaalde manier gedragen en hoe relaties zich ontwikkelen op het eiland, \nmet deze mysterieuze verschijnselen op de achtergrond.\n\n\n\nProductie: J.J. Abrams Ã‚Â· Jeffrey Lieber Ã‚Â· Damon Lindelof Ã‚Â· Carlton Cuse \nHoofdpersonages: Sayid Jarrah Ã‚Â· Claire Littleton Ã‚Â· Jack Shephard Ã‚Â· Hugo \\&quot;Hurley\\&quot; Reyes\n\t\t James \\&quot;Sawyer\\&quot; Ford Ã‚Â· Kwon Jin-soo Ã‚Â· Paik Sun-hwa Ã‚Â· Kate Austen Ã‚Â· John Locke\n\t\t Juliet Burke Ã‚Â· Benjamin Linus Ã‚Â· Danielle Rouseau Ã‚Â· Desmond Hume Ã‚Â· Charlotte Lewis\n\t\t Daniel Faraday Ã‚Â· Miles Straume Ã‚Â· Boone Carlyle Ã‚Â· Shannon Rutherford Ã‚Â· Mr. Eko Ã‚Â· Libby\n\t\t Ana LucÃƒÂ­a Cortez Ã‚Â· Charlie Pace Ã‚Â· Walt Lloyd Ã‚Â· Michael Dawson \nNevenpersonages: Tom Ã‚Â· Cindy Chandler Ã‚Â· Danny Pickett Ã‚Â· Rose Ã‚Â· Bernard Ã‚Â· Alex Ã‚Â· Ethan Rom\n\t\t Nikki Fernandez Ã‚Â· Paulo \nHoofdrollen: \t Naveen Andrews Ã‚Â· Nestor Carbonell Ã‚Â· Henry Ian Cusick Ã‚Â· Emilie de Ravin Ã‚Â· Michael Emerson\n\t\t Matthew Fox Ã‚Â· Jorge Garcia Ã‚Â· Josh Holloway Ã‚Â· Malcolm David Kelley Ã‚Â· Daniel Dae Kim\n\t\t Yunjin Kim Ã‚Â· Evangeline Lilly Ã‚Â· Elizabeth Mitchell Ã‚Â· Dominic Monaghan Ã‚Â· Terry O\\'Quinn\n\t\t Harold Perrineau Ã‚Â· Jeremy Davies Ã‚Â· Rebecca Mader Ã‚Â· Ken Leung \n\n\nDisk 1 (Seizoen 1)\n\n(1) \\&quot;Pilot (Deel 1)\\&quot; Jack J.J. Abrams Jeffrey Lieber, J.J. Abrams &amp; Damon Lindelof  22 september 2004 \nTijdens een routinevlucht van Sydney, AustraliÃƒÂ«, naar Los Angeles stort vlucht 815 van Oceanic neer op \neen afgelegen eiland. In de hoop dat ze snel gered zullen worden, slaan de overlevenden op het strand \nhun kamp op en proberen er het beste van te maken.  \n\n(2) \\&quot;Pilot (Deel 2)\\&quot; Charlie J.J. Abrams Jeffrey Lieber, J.J. Abrams &amp; Damon Lindelof  29 september 2004 \nDe passagiers hebben een zendapparaat gevonden en het lukt Sayid, voormalig verbindingsofficier, \nom het ding aan de praat te krijgen. Ze pikken een geheimzinnig bericht op, waarop Charlie de vraag \nstelt die bij iedereen leeft - \\&quot;Waar zijn we?\\&quot;  \n\n(3) \\&quot;Tabula Rasa\\&quot; Kate Jack Bender Damon Lindelof  6 oktober 2004 \nJack en Hurley ontdekken een gevaarlijk geheim over Kate. Michael heeft problemen met de vriendschap van \nzijn zoontje Walt met Locke, maar Walt wil alleen maar zijn hond terugvinden. Ondertussen twijfelen Kate, \nCharlie, Sawyer, Sayid, Boone en Shannon of ze de inhoud van de Franse boodschap moeten openbaren aan de \nanderen.  \n\n(4) \\&quot;Walkabout\\&quot; Locke Jack Bender David Fury  13 oktober 2004 \nDe overlevenden op het eiland schrikken wakker door wilde beesten die het kamp doorrennen. Kate en Michael \ngaan met Locke jagen op voedsel en ze komen erachter wat Locke te verbergen heeft. Ondertussen zijn mensen \nin het kamp geschrokken van wat Jack wil doen met de dode lichamen en ziet Jack in het bos iemand waarvan \nhij niet zeker weet of die wel in het vliegtuig zat.  \n\n\nDisk 2 (Seizoen 1)\n\n(5) \\&quot;White Rabbit\\&quot; Jack Kevin Hooks Christian Taylor  20 oktober 2004 \nBoone komt in levensgevaar als hij een vrouw probeert te redden uit de zee. Jack heeft last van \nhallucinaties door een tekort aan slaap; hij blijft maar denken aan hoe hij op het eiland terecht is gekomen. \nClaires gezondheid gaat achteruit door een tekort aan vocht.  \n\n(6) \\&quot;House of the Rising Sun\\&quot; Sun Michael Zinberg Javier Grillo-Marxuach  27 oktober 2004 \nWalt en de anderen zijn geschrokken als Michael wordt aangevallen. Sun en Jin weten niet precies wat er aan \nde hand is, omdat ze geen Engels spreken. Jack en Kate ruziÃƒÂ«n over waar de mensen moeten gaan \\'wonen\\', aan de \nkust of in het oerwoud. Locke ontdekt het geheim van Charlie.  \n\n(7) \\&quot;The Moth\\&quot; Charlie Jack Bender Jennifer Johnson &amp; Paul Dini  3 november 2004 \nCharlie probeert met veel moeite van zijn drugsverslaving af te komen. Locke helpt hem hierbij, maar het is \nniet duidelijk om welke reden hij Charlie helpt. Ondertussen proberen de andere overlevenden Jack te bevrijden \nuit een ingestorte grot. Sayid, Kate en Boone worden gesaboteerd wanneer zij het signaal van de Franse vrouw \nproberen te traceren.  \n\n(8) \\&quot;Confidence Man\\&quot; Sawyer Tucker Gates Damon Lindelof  10 november 2004 \nShannon blijkt al jaren aan astma te lijden. Tot nu toe heeft ze dit onder controle weten te houden, \nmaar nu is haar inhalator verdwenen. Boone verdenkt Sawyer, maar hij weigert de inhalator af te geven. \nUiteindelijk gaan Jack en Sayid over tot het martelen van Sawyer. Wanneer ook dit niet blijkt te helpen, \nwordt Kate ingeschakeld. Sawyer blijkt de inhalers niet te hebben, en uit pure woede verwond Sayid Sawyer \naan de slagader in zijn arm. Jack weet Sawyer te redden, waarna Sawyer verbonden op zijn bed ligt. \nKate vertelt hem dat ze zijn geheim kent. Sawyer blijkt geen Sawyer te heten, maar dit is de naam van een \nman die zijn familie heeft vernietigd.  \n\n\nDisk 3 (Seizoen 1)\n\n(9) \\&quot;Solitary\\&quot; Sayid Greg Yaitanes David Fury  17 november 2004 \nOp zijn individuele tocht over het eiland ontdekt Sayid een touw op het strand dat leidt naar de jungle. \nGedreven door zijn nieuwsgierigheid besluit hij het touw te volgen. Het lokt hem in een valstrik. Wanneer \nhij terug bij bewustzijn is bevindt hij zich in de schuilplaats van een FranÃƒÂ§aise. Het wordt Sayid al vlug \nduidelijk dat zij de persoon is die de noodoproep heeft uitgezonden. Ondertussen heeft Hurley het perfecte \nontspanningsmiddel gevonden: hij heeft een golfterrein aangemaakt. De bewoners kunnen zich, na dagen in angst \ngeleefd te hebben, eindelijk een beetje ontspannen.  \n\n(10) \\&quot;Raised by Another\\&quot; Claire Marita Grabiak Lynne E. Litt  1 december 2004 \nClaire heeft de afgelopen nachten nachtmerries over haar ongeboren kind gehad. Die zijn zo levendig dat ze \ngelooft dat iemand haar kind pijn wil doen. Jack gelooft haar niet en Claire vlucht terug naar het strand. \nOndertussen doet Hurley de ontdekking dat ÃƒÂ©ÃƒÂ©n van de overlevenden, Ethan Rom, niet op de passagierslijst staat.  \n\n(11) \\&quot;All The Best Cowboys Have Daddy Issues\\&quot; Jack Stephen Williams Javier Grillo-Marxuach  8 december 2004 \nNa de verdwijning van Charlie en Claire volgen Jack, John, Kate en Boone hun sporen. Op een bepaald moment \nwordt Jack aangevallen door Ethan, die de uitgeputte Jack uiteindelijk overmeestert. Iets later vinden Jack \nen Kate Charlies lichaam opgehangen in een boom, terwijl John en Boone stuiten op een geheimzinnig luik.  \n\n(12) \\&quot;Whatever the Case May Be\\&quot; Kate Jack Bender Damon Lindelof &amp; Jennifer Johnson  5 januari 2005 \nKate en Sawyer nemen een frisse duik in een meer, waar ze een koffer aantreffen op de bodem. Het blijkt \nde koffer van de federale agent te zijn, waar hij al zijn pistolen in hield. Sawyer, niet op de hoogte van \nde inhoud van de koffer, weigert het koffertje af te geven. Daarom schakelt Kate de hulp van Jack in. Wanneer \nze uiteindelijk toch de koffer bemachtigen en openen vindt Jack vier pistolen en een envelop die voor Kate \ngrote waarde heeft.  \n\n\nDisk 4 (Seizoen 1)\n\n(13) \\&quot;Hearts and Minds\\&quot; Boone Rod Holcomb Carlton Cuse &amp; Javier Grillo-Marxuach  12 januari 2005 \nHet wordt Boone duidelijk dat er al gauw een relatie zal ontstaan tussen Sayid en Shannon, zijn stiefzus. \nHij heeft moeite dit te aanvaarden en laat hen dat ook weten. Locke merkt hoe afhankelijk Boone van Shannon \nis en besluit hem te helpen. Door middel van een verdovend middel op zijn hoofd begint Boone te hallucineren, \nniet wetende dat alles wat hij nu zal meemaken geen werkelijkheid is.  \n\n(14) \\&quot;Special\\&quot; Michael &amp; Walt Greg Yataines David Fury  19 januari 2005 \nMichael verbiedt zijn zoon Walt om nog langer met Locke om te gaan, en vraagt hem in plaats daarvan te helpen \nmet het bouwen van een vlot, waarop ze kunnen ontsnappen. Walt loopt echter de jungle in, waar hij bijna wordt \nopgegeten door een ijsbeer.  \n\n(15) \\&quot;Homecoming\\&quot; Charlie Kevin Hooks Damon Lindelof  9 februari 2005 \nJohn en Boone vinden Claire terug, en brengen haar terug naar het kamp. Ze blijkt haar geheugen kwijt te zijn. \nDe volgende dag zegt Ethan tegen Charlie en Jin dat ze Claire moeten teruggeven; anders zal hij elke avond \niemand vermoorden. Ondanks de uitgebreide bewaking wordt Scott vermoord. Jack haalt de pistolen uit de koffer \ntevoorschijn, en Claire wordt als lokaas ingezet om Ethan gevangen te kunnen nemen. Charlie kan zich echter \nniet beheersen en schiet Ethan dood voordat ze hem kunnen ondervragen.  \n\n(16) \\&quot;Outlaws\\&quot; Sawyer Jack Bender Drew Goddard  16 februari 2005 \nOp een nacht wordt Sawyer bruut wakker gemaakt door een everzwijn, dat het zeil van zijn beschuttingsplaats \nmeeneemt. Als Sawyer het zwijn achterna gaat hoort hij in de jungle gefluister. Hij herinnert zich dat Sayid \nhetzelfde heeft meegemaakt. De volgende dag besluit hij het everzwijn te gaan zoeken, met Kates hulp. Bij een \ndrinkspelletje bij het kampvuur onthullen de twee een hoop over hun verleden.  \n\n\nDisk 5 (Seizoen 1)\n\n(17) \\&quot;... In Translation\\&quot; Jin Tucker Gates Javier Grillo-Marxuach &amp; Leonard Dick  23 februari 2005 \nOp een avond vat het vlot van Michael vlam. Ondanks de bluspogingen is het vlot te zwaar beschadigd. \nIedereen verdenkt Jin ervan de brand te hebben aangestoken, en Sawyer en Michael vallen hem aan. Sun komt \ntussenbeide en onthult zo dat ze Engels spreekt. Jin weigert haar nog langer aan te kijken, omdat ze hem \nin het openbaar heeft vernederd. Hij wil niet langer bij Sun blijven, en helpt Michael met de bouw van een \nnieuw vlot om zo snel mogelijk te kunnen vertrekken.  \n\n(18) \\&quot;Numbers\\&quot; Hurley Dan Attias Brent Fletcher &amp; David Fury  2 maart 2005 \nHurley heeft vroeger de loterij gewonnen met de nummers 4, 8, 15, 16, 23 en 42, maar eigenlijk zijn het eerder \nongeluksnummers voor de mensen om hem heen. Hij ontdekt dat de nummers ook in de papieren van Rousseau voorkomen. \nHij confronteert haar hiermee, en vraagt hoe zij aan de nummers komt. Aan het einde van de aflevering blijkt dat \ndiezelfde reeks nummers ook op het luik dat Boone en Locke hebben gevonden staan.  \n\n(19) \\&quot;Deus Ex Machina\\&quot; Locke Robert Mandel Carlton Cuse &amp; Damon Lindelof  30 maart 2005 \nBoone verliest de hoop het luik ooit nog open te krijgen, maar John wacht en krijgt een teken van het eiland. \nHij droomt van een vliegtuig dat neerstort, en wanneer ze dat de volgende dag op de rand van een klif vinden \nklimt Boone aan boord. Het vliegtuig zit volgeladen met heroÃƒÂ¯ne, maar Boone vindt wel een werkende radio. Hij \nkrijgt heel even contact, maar door zijn gewicht stort het vliegtuig van de klif af. Boone raakt zwaargewond. \nJohn draagt Boone naar het kamp, maar verdwijnt daarna in de jungle.  \n\n(20) \\&quot;Do No Harm\\&quot; Jack Stephen Williams Janet Tamaro  6 april 2005 \nJack probeert Boones leven te redden, en stuurt Kate naar Sawyer om alcohol te halen voor het ontsmetten van \nde wonden. Onderweg komt Kate Claire tegen, die op het punt staat om te bevallen. Jack, die inmiddels met een \nbloedtransfusie voor Boone bezig is, zegt Kate dat zij de baby ter wereld moet brengen. Met de nodige moeite \nweet ze Claires zoontje ter wereld te brengen. Jack maakt ondertussen aanstalten om Boones been te amputeren, \nmaar Boone vraagt Jack om hem rustig te laten sterven. Vlak voor zijn dood onthult hij nog dat Locke en hij \neen luik hebben gevonden.  \n\n\nDisk 6 (Seizoen 1)\n\n(21) \\&quot;The Greater Good\\&quot; Sayid David Grossman Leonard Dick  4 mei 2005 \nAlle overlevenden zijn geraakt door Boones dood. Vooral Jack en Shannon hebben het er moeilijk mee. \nJack besluit John te gaan zoeken voor tekst en uitleg. Na eindeloos in de jungle te hebben gelopen vindt \nKate Jack terug, en ze vraagt of hij terug wil komen naar het kamp voor Boones begrafenis. Na een korte \nceremonie daagt Jack Locke uit. Locke zegt dat het hem spijt, maar daar neemt Jack geen genoegen mee. Hij \nvalt John aan, maar hij wordt tegengehouden door Michael en Sayid. Uiteindelijk valt Jack uitgeput neer. \nNadat hij wat heeft geslapen, merkt Jack dat er een pistool weg is. Sayid vreest dat Shannon John wil \nvermoorden en hij blijkt gelijk te hebben. Sayid, Jack en Kate treffen Shannon aan terwijl ze Locke onder \nschot houdt. Sayid kan ervoor zorgen dat Shannon mist, maar hun relatie loopt hierdoor wel een forse deuk op.  \n\n(22) \\&quot;Born to Run\\&quot; Kate Tucker Gates Javier Grillo-Marxuach, Edward Kitsis &amp; Adam Horowitz  11 mei 2005 \nTijdens een drinkpauze stort Michael in elkaar van de pijn. Jack onderzoekt hem en ontdekt dat hij vergiftigd is. \nDiverse mensen worden verdacht, en Sawyer onthult dat Kate degene was die door de federale agent werd bewaakt. \nOndertussen ruziÃƒÂ«n Jack, Locke en Sayid over wat ze met het luik moeten.  \n\n(23) \\&quot;Exodus: Deel 1\\&quot; Verschillende Jack Bender Damon Lindelof &amp; Carlton Cuse  18 mei 2005 \nEr stijgt een zwarte rook op uit de jungle, en Rousseau waarschuwt de overlevenden dat de Anderen eraankomen. \nOm iedereen in veiligheid te kunnen brengen worden voorbereidingen getroffen om het luik op te blazen. \nMichael, Walt, Sawyer en Jin vertrekken met het vlot.  \n\n(24) \\&quot;Exodus: Deel 2\\&quot; Verschillende Jack Bender Damon Lindelof &amp; Carlton Cuse  25 mei 2005 \nDe voorbereidingen om naar het luik te verhuizen gaan door. Rousseau ontvoert Claires baby, Aaron, en Charlie \nen Sayid gaan achter haar aan. Ondertussen overvallen de Anderen het vlot, met dramatische gevolgen.  \n\n\nDisk 7 (Seizoen 1) - Bonus\n\n(25) \\&quot;Exodus: Deel 3\\&quot; Verschillende Jack Bender Damon Lindelof &amp; Carlton Cuse  25 mei 2005 \nDe voorbereidingen om naar het luik te verhuizen gaan door. Rousseau ontvoert Claires baby, Aaron, en Charlie \nen Sayid gaan achter haar aan. Ondertussen overvallen de Anderen het vlot, met dramatische gevolgen.  ","torrent":{"xt":"urn:btih:7e058b64613a5fa284dc6740cb406d7a04d6fcb5","amp;dn":"LOST+Complete+Season+1+%28Retail%29%28Multi+Sub%29%28DVD9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e058b64613a5fa284dc6740cb406d7a04d6fcb5","infoHashBuffer":{"type":"Buffer","data":[126,5,139,100,97,58,95,162,132,220,103,64,203,64,109,122,4,214,252,181]},"announce":[],"urlList":[]}}