{"title":"Sticky Password Pro 5.0.6.247 (2012) [Multilanguaje]","uid":7004301,"size":11499074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7eb9e2e04463cb6b58551ef3e2a6a968e07d78b3&amp;dn=Sticky+Password+Pro+5.0.6.247+%282012%29+%5BMultilanguaje%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":-1,"time":1328208229,"description":"Sticky Password Pro 5.0.6.247 (2012) [Multilanguaje]\n\nEnglish:\n--------\nOn the file:\nPlatform: Windows XP and Vista / 7\nLanguage: MULTi / Russian Includes Spanish in Spain\nTablet: Cracked-AyTkACT\nSize: 11.51 MB\n\n\nSticky Password - a unique program that integrates the system remembers and automatically enters the user IDs and passwords in the field site, any program on your computer! Sticky Password oppose keylogeram and other spy program to try to capture your passwords.\n\nA password-protected powerful encryption algorithms, including AES / Rijndael with 256 to date, most reliable.\nSticky Password has been storing passwords and making people more productive since 2001. In addition to managing and encrypting your passwords, Sticky Password provides exceptional one-click online form filling. The small installation package incorporates the industry? S most powerful encryption algorithms and provides effective protection against phishing schemes, concealed key-loggers and identity theft. Furthermore, you will have the possibility to install this application on a portable memory device such a USB flash memory stick.\n\nKey Features:\nÃ‚Â· The database is encrypted with the strongest encryption algorithms in the industry\nÃ‚Â· Creates strong passwords\nÃ‚Â· Auto-fill of logins and passwords for websites and applications\nÃ‚Â· Form-filling capability with Sticky Password &quot;Identities&quot;\nÃ‚Â· All data is stored in the encrypted database\nÃ‚Â· Protection against phishing exploits and key loggers through tools like the new virtual keyboard\nÃ‚Â· Support for multiple access authorization methods like Bluetooth and USB devices\nÃ‚Â· Support for multiple logins and passwords for each account\nÃ‚Â· Increased privacy protection, thanks to enhanced handling of passwords in encrypted format while in memory\nÃ‚Â· An easy first run wizard and great user interface\nÃ‚Â· Easy import of passwords\nÃ‚Â· Expanded support of websites and applications\nÃ‚Â· All Microsoft accounts on the protected computer have their own password database\nÃ‚Â· USB-portability\nÃ‚Â· Portable Sticky Password\nÃ‚Â· Automatic backup of the encrypted password database, ensures that you can restore past passwords if you ever need to\n\n\n\nEspaÃƒÂ±ol:\n--------\nEn el archivo:\nPlataforma: Windows XP y Windows Vista / 7\nIdioma: Multi / Rusia INCLUIDO EspaÃƒÂ±ol de EspaÃƒÂ±a\nTablet: Cracked-AyTkACT\nTamaÃƒÂ±o: 11,51 MB\n\n\nAdherido ContraseÃƒÂ±a - un programa ÃƒÂºnico que integra el sistema recuerda y automÃƒÂ¡ticamente entra en el ID de usuario y contraseÃƒÂ±as en el sitio en el campo, cualquier programa en su computadora! Sticky Password oponerse keylogeram y el programa de espionaje otros para tratar de capturar sus contraseÃƒÂ±as.\n\nUn potentes algoritmos protegidos por contraseÃƒÂ±a de encriptaciÃƒÂ³n, incluyendo AES / Rijndael de 256 al dÃƒÂ­a, mÃƒÂ¡s fiables.\nSticky Password ha sido el almacenamiento de contraseÃƒÂ±as y haciendo que la gente mÃƒÂ¡s productiva desde 2001. AdemÃƒÂ¡s de la gestiÃƒÂ³n y el cifrado de las contraseÃƒÂ±as, Sticky Password ofrece excepcionales con un solo clic formulario en lÃƒÂ­nea de llenado. El paquete de instalaciÃƒÂ³n de pequeÃƒÂ±as incorpora a la industria? S algoritmos de encriptaciÃƒÂ³n mÃƒÂ¡s potente y proporciona una protecciÃƒÂ³n eficaz contra los esquemas de phishing, los registradores de claves ocultas, y el robo de identidad. AdemÃƒÂ¡s, tendrÃƒÂ¡ la posibilidad de instalar esta aplicaciÃƒÂ³n en un dispositivo de memoria portÃƒÂ¡til, una memoria USB de memoria flash.\n\nCaracterÃƒÂ­sticas principales:\nÃ‚Â· La base de datos es encriptada con los algoritmos de cifrado mÃƒÂ¡s potente en la industria\nÃ‚Â· Crea contraseÃƒÂ±as seguras\nÃ‚Â· Auto-llenado de usuario y contraseÃƒÂ±as para sitios web y aplicaciones\nÃ‚Â· Forma de llenado de su capacidad con la pegajosa ContraseÃƒÂ±a &quot;Identidades&quot;\nÃ‚Â· Todos los datos se almacenan en la base de datos cifrados\nÃ‚Â· ProtecciÃƒÂ³n frente a ataques de phishing y los registradores de claves a travÃƒÂ©s de herramientas como el teclado virtual nuevo\nÃ‚Â· Soporte para mÃƒÂºltiples mÃƒÂ©todos de acceso a la autorizaciÃƒÂ³n, como los dispositivos Bluetooth y USB\nÃ‚Â· Soporte para mÃƒÂºltiples logins y contraseÃƒÂ±as para cada cuenta\nÃ‚Â· ProtecciÃƒÂ³n de la intimidad creciente, gracias a la gestiÃƒÂ³n mejorada de las contraseÃƒÂ±as en formato cifrado, mientras que en la memoria\nÃ‚Â· Un asistente fÃƒÂ¡cil de la primera carrera y gran interfaz de usuario\nÃ‚Â· ImportaciÃƒÂ³n sencilla de contraseÃƒÂ±as\nÃ‚Â· Soporte ampliado de sitios web y aplicaciones\nÃ‚Â· Todas las cuentas de Microsoft en el equipo protegido tiene su base de datos propia contraseÃƒÂ±a\nÃ‚Â· USB-portabilidad\nÃ‚Â· ContraseÃƒÂ±a Adherido Portable\nÃ‚Â· Copia de seguridad automÃƒÂ¡tica de la base de datos de contraseÃƒÂ±as encriptadas, se asegura de que puede restaurar contraseÃƒÂ±as pasado, si alguna vez tiene que\n\n","torrent":{"xt":"urn:btih:7eb9e2e04463cb6b58551ef3e2a6a968e07d78b3","amp;dn":"Sticky+Password+Pro+5.0.6.247+%282012%29+%5BMultilanguaje%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eb9e2e04463cb6b58551ef3e2a6a968e07d78b3","infoHashBuffer":{"type":"Buffer","data":[126,185,226,224,68,99,203,107,88,85,30,243,226,166,169,104,224,125,120,179]},"announce":[],"urlList":[]}}