{"title":"Bleach Movies - All Included.","uid":6999498,"size":1931896864,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:81e094201f0cf245623cb2e0fefeec2a296e3a3c&amp;dn=Bleach+Movies+-+All+Included.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GB_Psypher","files":5,"time":1328004326,"description":"High school student Kurosaki Ichigo is unlike any ordinary kid. Why? Because he can see ghosts. Ever since a young age, he's been able to see spirits from the afterlife. Ichigo's life completely changes one day when he and his two sisters are attacked by an evil, hungry and tormented spirit known as a Hollow. Right in the nick of time, Ichigo and his siblings are aided by a Shinigami (Death God) named Kuchiki Rukia, whose responsibility it is to send good spirits (Pluses) to the afterlife known as Soul Society, and to purify Hollows and send them up to Soul Society. But during the fight against the Hollow, Rukia is injured and must transfer her powers to Ichigo. With this newly acquired power, so begins Kurosaki Ichigo's training and duty as a Shinigami to maintain the balance between the world of the living and the world of the dead.\n=========================================================================================\n\nWithin this single torrent you find yourself all Movies released in the Bleach Universe this far. I will update it as more come out, but for now, enjoy them!\n\nAlso, I appologise as a couple of them are not labeled as their respective movie, but I'm sure you'll be able to figure it out from their label (generally its got some information mixed in with the name)\n\nEnjoy! And please, Comment and Seed this when you have completed your download!\n","torrent":{"xt":"urn:btih:81e094201f0cf245623cb2e0fefeec2a296e3a3c","amp;dn":"Bleach+Movies+-+All+Included.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e094201f0cf245623cb2e0fefeec2a296e3a3c","infoHashBuffer":{"type":"Buffer","data":[129,224,148,32,31,12,242,69,98,60,178,224,254,254,236,42,41,110,58,60]},"announce":[],"urlList":[]}}