{"title":"New Mormon Studies ISO (Signature Books)","uid":15920451,"size":695179264,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83c9df7970d0bf5057d56bbbfc9b83f42b8575f9&amp;dn=New+Mormon+Studies+ISO+%28Signature+Books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iamse7en","files":1,"time":1475250462,"description":"2009 EDITION\r\nSMITH RESEARCH ASSOCIATES\r\n960 Works. / 978-1-56085-110-3 / $100.00\r\n\r\nNew Mormon Studies CD RomIn the eleven years since the New Mormon Studies CD-ROM was first released, computers have bulked up to about eight times as much RAM and fifteen times the speed. Taking advantage of these developments, the 2009 edition has greater computational capacity and is faster. It runs on Windows 2000 Pro, Windows XP Home and Pro, Windows 2003 Server, Vista 32- and 64-bit, and Windows 7.\r\n\r\nThe content has not changed—only the software has. You will find that you can enjoy the same ease of installation and functionality as with your original purchase. If you are using this product for the first time, you will discover that you can quickly search by word or phrase through nearly 1,000 books and other items.\r\n\r\nNew features include the ability to search footnotes; the ability to limit searches to a bookshelf, book, or single chapter; and browsing with a scroll wheel. Tabs at the bottom of the screen now get you instantly to the table of contents, hit summaries, preview, search function, or current document. The product can be installed on a hard drive or server or run from a CD-ROM drive.\r\n\r\nThis is a FAST Folio Infobase for use on Windows PCs. (Note that it is no longer available for Macintosh.) It has a total of 960 works: 248 books, 603 periodicals, and 119 documents. The books include the Signature Books library through 1997, LDS titles from the University of Illinois Press, Smith Research Associates publications, original printings of LDS scripture, rare non-LDS books from the 1800s paralleling Mormon doctrines and practices, first editions of LDS classics, early and sometimes controversial works by LDS general authorities, and books by those who were close to Church leaders.\r\n\r\nThe periodicals include the complete run of Dialogue: A Journal of Mormon Thought through 1996, the Journal of Discourses, Sunstone magazine through 1994, and other key serialized publications. The documents include affidavits, diaries, letters, minutes, news articles, speeches, personal histories, revelations, blessings, and other primary sources","torrent":{"xt":"urn:btih:83c9df7970d0bf5057d56bbbfc9b83f42b8575f9","amp;dn":"New+Mormon+Studies+ISO+%28Signature+Books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c9df7970d0bf5057d56bbbfc9b83f42b8575f9","infoHashBuffer":{"type":"Buffer","data":[131,201,223,121,112,208,191,80,87,213,107,187,252,155,131,244,43,133,117,249]},"announce":[],"urlList":[]}}