{"title":"Cure.1997.1080p.BluRay.x264.EAC3-SARTRE","uid":15999380,"size":4038099214,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:848977301692345cf936e5dcf1ab00bf5e737eb3&amp;dn=Cure.1997.1080p.BluRay.x264.EAC3-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sartre7","files":6,"time":1476108535,"description":"Oddball Japanese director Kiyoshi Kurosawa directed this haunting police thriller about murder, mind control, and the power of charisma. Police Detective Takabe (Koji Yakusho) is tracking a series of bizarre murders, all committed in exactly the same manner: a giant X is slashed in the flesh of the victims. But that's where the similarities end. In each case, seemingly well-adjusted people suddenly kill without understanding why. Baffled, Takabe consults his psychologist friend Sakuma (Tsuyoshi Ujiki), who finds no relationships among the perpetrators and rules out any connection with the media. The investigation eventually leads to a young drifter named Mamiya (Masato Hagiwara), who asks everyone he meets the same simple question: &quot;Who are you?&quot; Usually people respond with such stock answers as &quot;doctor&quot; or &quot;police detective,&quot; to which the drifter responds with the same question. Part of Mamiya's reason for this bizarre behavior is that he has been turned inside-out; his interior world is completely empty. He has no memory, no identity, and he does not recognize his own self-image. Yet he does have an insidious, hypnotic ability to get inside the minds of others and unleash their repressed desires to murder. His victims' inability to answer Mamiya's maddeningly simple question shows their own tenuous grasp of their identity. Only Takabe seems to understand the other meaning behind Mamiya's query. His wife Fumie (Anna Nakagawa)'s own personality is slowly being destroyed by mental illness, making her act in increasingly inexplicable ways. Frustrated by Mamiya's sphinx-like ability to fend off the most rigorous interrogation, and yet drawn to his charms, Takabe undergoes a journey into the dark recesses of his own self, while slowly uncovering the secrets of the drifter's power. This film, which first brought international attention to Kurosawa, transcends the boundaries of its genre to become a riveting exploration of the collapse of identity in a postmodern age. It was screened at the 1999 Toronto Film Festival as a part of the Director's Spotlight.\r\n\r\n\r\n\r\n\r\nSTARS.........: Masato Hagiwara, Kôji Yakusho, Tsuyoshi Ujiki\r\nDIRECTOR......: Kiyoshi Kurosawa\r\nWRITERS.......: Kiyoshi Kurosawa\r\nGENRE.........: Crime, Horror, Mystery\r\nMETASCORE.....: 70\r\nIMDB RATING...: 7.4/10  6,423 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0123948\r\nRUNTIME.......: 1h 38mn\r\nSIZE..........: 3.74GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1040\r\nASPECT RATIO..: 1.85:1\r\nBITRATE.......: 4400 Kbps\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: Japanese AC3 5.1 384kbps (Original)\r\nSUBTITLES.....: ENG, SPA \r\nCHAPTERS......: Yes\r\nSOURCE........: Mediatres Estudio Blu Ray\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-10-03\r\nENCODING NOTE.: Poor quality source. Field blended interlaced video with noisy, distorted grain.\r\n\r\n\r\n\r\n\r\nSample Clip","torrent":{"xt":"urn:btih:848977301692345cf936e5dcf1ab00bf5e737eb3","amp;dn":"Cure.1997.1080p.BluRay.x264.EAC3-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"848977301692345cf936e5dcf1ab00bf5e737eb3","infoHashBuffer":{"type":"Buffer","data":[132,137,119,48,22,146,52,92,249,54,229,220,241,171,0,191,94,115,126,179]},"announce":[],"urlList":[]}}