{"title":"Lucky Luciano: Mafia Murderer and Secret Agent","uid":16024618,"size":333808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:854910a007c2c3df8ccf0c1654524cedd58c00cd&amp;dn=Lucky+Luciano%3A+Mafia+Murderer+and+Secret+Agent&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476369757,"description":"Lucky Luciano: Mafia Murderer and Secret Agent - Tim Newark [epub]\r\n\r\nCharles 'Lucky' Luciano was a vicious mobster who rose to become the multimillionaire king of the New York underworld. He was a legend - but also a fake master criminal without real power, his reputation manipulated and maintained by the government agents who had put him behind bars. \r\n\r\nDrawing on secret government documents from archives in America and Europe, this myth-busting biography tells Luciano's real story, from his early days as a top hit man for the mob to his exploits running sex and narcotics empires and revelations about his trip to Nazi Germany to set up a drugs importing racket. His career abruptly halted by imprisonment, Luciano's reputation was enhanced by rumours that he was helping to win the Second World War for the Allies in Sicily and the Mediterranean. Through painstaking research, Newark exposes the truth about what Luciano really did during the war.\r\n\r\nExpelled from the US in 1946, Luciano returned to Italy, where he was reputed to head a massive transatlantic narcotics network. In a complex conspiracy, he became a victim of the far greater powers around him, and Newark provides evidence that, at one time, he was even working as a Cold War agent, helping the US government fight Communism in Sicily. Lucky Luciano: Mafia Murderer and Secret Agent turns accepted Mafia history on its head with an extraordinary story that has never been told before","torrent":{"xt":"urn:btih:854910a007c2c3df8ccf0c1654524cedd58c00cd","amp;dn":"Lucky+Luciano%3A+Mafia+Murderer+and+Secret+Agent","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854910a007c2c3df8ccf0c1654524cedd58c00cd","infoHashBuffer":{"type":"Buffer","data":[133,73,16,160,7,194,195,223,140,207,12,22,84,82,76,237,213,140,0,205]},"announce":[],"urlList":[]}}