{"title":"Satisfaction 1x10 Final T01 DVB Spanish by tony","uid":6941221,"size":579012460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87b95d84a0157a0b5e70a176aab93172486eb75f&amp;dn=Satisfaction+1x10+Final+T01+DVB+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"carambolas","files":3,"time":1326038195,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n                 &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\nAmbientada en el mundo de los burdeles de alto stading, Satisfaction, estÃƒÂ¡ protagonizada por seis mujeres y sus respectivas vidas dentro de un establecimiento de este tipo, llamado Satisfaction. Las tramas examinan el deseo de intimidad que es comÃƒÂºn a todos. Las protagonistas son Chloe (Diana Gleen, Black Water), una de estas chicas, que compagina su trabajo en Satisfaction con la educaciÃƒÂ³n de una hija de catorce aÃƒÂ±os; Mel (Madeleine West, Underbelly) es una acompaÃƒÂ±ante de alto standing, que oculta sus sentimientos y preocupaciones detrÃƒÂ¡s de una intacta fachada.\n\nPor su parte, Heather (Peta Sergeant, All Saints) separa su vida profesional y personal de un modo bastante mÃƒÂ¡s satisfactorio que el resto de las chicas, hasta que de pronto ambas de ven mezcladas sin remedio. Lauren (Alison Whyte, Marshall Law), mÃƒÂ¡s mayor que las demÃƒÂ¡s, era la mÃƒÂ¡s inocente cuando entrÃƒÂ³ en la industria del sexo. Tippi (Bojana Novakovic, Al LÃƒÂ­mite) es la mÃƒÂ¡s joven, y la que irremediablemente va demasiado lejos. Y por ÃƒÂºltimo Nat (Kestie Morassi, Underbelly) la manager del club, de conducta profesional y distante, que actÃƒÂºa bajo estos principios hasta que se encuentra con sus propias fantasÃƒÂ­as y anhelos. ","torrent":{"xt":"urn:btih:87b95d84a0157a0b5e70a176aab93172486eb75f","amp;dn":"Satisfaction+1x10+Final+T01+DVB+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87b95d84a0157a0b5e70a176aab93172486eb75f","infoHashBuffer":{"type":"Buffer","data":[135,185,93,132,160,21,122,11,94,112,161,118,170,185,49,114,72,110,183,95]},"announce":[],"urlList":[]}}