{"title":"Frozen Planet DVD NL (dvd5) (Nl subs) RETAIL TBS","uid":6952514,"size":4680976672,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8cb24f2e286597c088246646386429ab59dd8a15&amp;dn=Frozen+Planet+DVD+NL+%28dvd5%29+%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sammynet","files":28,"time":1326455185,"description":"Frozen Planet dvd 1\n\nNederlands\nDe BBC neemt u mee naar de Noord- en Zuidpool, de grootste ongerepte natuurgebieden ter wereld.\nDeze documentaire in zes delen schetst een adembenemend portret van een spectaculair landschap dat qua omvang, schoonheid en extreme omstandigheden met niets op aarde te vergelijken is.\nNooit eerder werden deze gebieden en de dieren die er leven zo gedetailleerd in beeld gebracht.\nMet een speciale camera, die ijselijke temperaturen kan verdragen, maakte het team verbluffende opnamen vanuit de lucht en onder het oppervlakte van de ijskoude oceaan.\nDe reis start op de Antarctische convergentie, waar koude en warme stromingen botsen en waar de oceaan ruiger is dan waar ook ter wereld.\nOp de eilanden binnen deze natuurlijke begrenzing van Antarctica leven diverse zeldzame dieren.\nIn het noorden trekken we over de toendra's richting de Noordpool.\nDeze ontzagwekkende landschappen ontdekken we door de ogen van de dieren die er leven, zoals de reuzenalbatros, de adÃƒÂ©liepinguÃƒÂ¯n en de ijsbeer.\nTerwijl het poolijs smelt, brengt Frozen Planet een deel van de aarde in beeld dat binnenkort voorgoed kan zijn veranderd...\n\nEnglish\nThe BBC takes you to the North and South Poles, the largest unspoiled natural areas in the world.\nThis documentary in six parts paints a stunning portrait of a spectacular landscape in terms of size, beauty and extreme environments on Earth with nothing to compare.\nNever before have these areas and the animals that live in as much detail mapped.\nWith a special camera that can withstand terrible temperatures, the team made stunning shots from the air and beneath the surface of the icy ocean.\nThe journey starts at the Antarctic Convergence, where cold and warm currents collide and where the ocean is rougher than anywhere else in the world.\nOn the islands within the natural boundary of Antarctica live many rare animals.\nIn the north we draw about the direction of the Arctic tundra.\nThis awesome scenery we discover through the eyes of the animals that live there, such as the giant albatross, the Adelie penguins and the polar bear.\nWhile the polar ice melts, Frozen Planet brings a portion of the earth's surface that can forever change soon ...\n\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Documentaire\nTime          : 63 Minuten","torrent":{"xt":"urn:btih:8cb24f2e286597c088246646386429ab59dd8a15","amp;dn":"Frozen+Planet+DVD+NL+%28dvd5%29+%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb24f2e286597c088246646386429ab59dd8a15","infoHashBuffer":{"type":"Buffer","data":[140,178,79,46,40,101,151,192,136,36,102,70,56,100,41,171,89,221,138,21]},"announce":[],"urlList":[]}}