{"title":"Made in America 2011 (in) Complete - Missing 1 Episode","uid":6946388,"size":2198866706,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8f3dc8c7de7151b822bfaa2f4359445974a711ab&amp;dn=Made+in+America+2011+%28in%29+Complete+-+Missing+1+Episode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"x30001wtm","files":14,"time":1326244718,"description":"\nWell I hate to point fingers at hard working sharers, but the\nMade In America posts here at TPB are a disaster as far as\naccuracy.  They show episode 12 missing but in fact, all the\nepisodes from 6 on up are misnumbered.  Example:\n\nMade.In.America.2011.S01E06.Jack.Daniels.Zero.Motorcycle.and.New Balance.HDTV.XviD-CRiMSON\n\nThat's actually episode 7 according to the IMDB:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2081801/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2081801/episodes&lt;/a&gt;\n\nAnd in my opinion, they should be named in the order the\nsegments appear in the episode even though the IMBD doesn't do\nit that way.  In this case it would be:\n\nNew Balance, Jack Daniels, Zero Motocycle\n\nSo anyway, they're all numbered wrong up to episode 10 which is\nthe last one I can find shared here, and it's an even worse\ndisaster.  Whoever started it shared the sample and the text\nfile but forgot to include the actual episode!  Oh well :)\nThese guys work hard and share a LOT of stuff and I'm not\nslamming them, just stating a few facts to help the collectors\nget things straight.  Such as, it's La-Z-Boy, not Lazy Boy.\nHeck, even the IMDB has Ghirardelli spelled wrong.\n\nOK, enough griping.  I'm trying to get this set straightened\nout, that's all.  For starters I renamed every one I had, both\nto show the correct episode number as well as to fix typos and\nshorten the insanely long original filenames.  I replaced . with\nspaces.because.this.fucking.nonsense.drives.me.batshit.and.I\ncan't see the purpose of it.  I'm not saying there isn't a\npurpose in doing it, just that I can't see one.\n\nHere's what's in this torrent:\n\nMade In America 2011 S01E01 Cadillac, Subzero, Maglite.avi\nMade In America 2011 S01E02 Gibson, Crayola, La-Z-Boy.avi\nMade In America 2011 S01E03 Corvette, Wiffle Ball, Ludwig Drums.avi\nMade In America 2011 S01E04 Tabasco, Silly Putty, Filson Clothes.avi\nMade In America 2011 S01E05 Jelly Belly, Master Lock, Skate One.avi\nMade In America 2011 S01E06 Louisville Slugger, Krispy Kreme, Airstream is MISSING.txt\nMade In America 2011 S01E07 New Balance, Jack Daniels, Zero Motocycle.avi\nMade In America 2011 S01E08 Sage Fly Fishing Rods, Sock Monkey, Kazoo.avi\nMade In America 2011 S01E09 Mervin Snowboards, GE Aviation, Tootsie Roll.avi\nMade In America 2011 S01E10 Ford Mustang, Brooklyn Brewery, Vermont Creamery.avi\nMade In America 2011 S01E11 Mack, Kitchen Aid, Ghirardelli Chocolate.avi\nMade In America 2011 S01E12 Jeep, Channel Island Surfboards, Kodak.avi\nMade In America 2011 S01E13 Boston Whaler, Pink Flamingo, All Clad.avi\n\nNote that the missing episode is number 6 featuring the\nLouisville Slugger, Krispy Kreme, and Airstream.\n\nIF YOU HAVE EP. 6 LOUISVILLE SLUGGER, KRISPY KREME, AIRSTREAM\nPLEASE SHARE IT!\n\nX30001 out.\n\n","torrent":{"xt":"urn:btih:8f3dc8c7de7151b822bfaa2f4359445974a711ab","amp;dn":"Made+in+America+2011+%28in%29+Complete+-+Missing+1+Episode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f3dc8c7de7151b822bfaa2f4359445974a711ab","infoHashBuffer":{"type":"Buffer","data":[143,61,200,199,222,113,81,184,34,191,170,47,67,89,68,89,116,167,17,171]},"announce":[],"urlList":[]}}