{"title":"IconBox v.2.5.4 with NOY keygen","uid":6950741,"size":21448185,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:90bdc892945f2a40a09dc7c99d058d3bdf002287&amp;dn=IconBox+v.2.5.4+with+NOY+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1326392783,"description":"Official Web SIte: &lt;a href=&quot; http://www.iconboxapp.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.iconboxapp.com/&lt;/a&gt;\n\nIconBox is a helpful organizational tool for Macs. When the first version of IconBox was released 8 years ago, it was the first Icon Organizer running on Mac OS X, allowing users to conveniently organize their collection of icons in an iPhoto-like way. With version 2.5, IconBox has been completely rewritten and features a brand new interface.\n\nIconBox is one App featuring 4 modes!\n\nMode 1: Organize\n\nWe have the same convenient organization features with a couple of additions. The libraries are now called &quot;Boxes&quot;. Drag icons from the finder into a box, create as many boxes as you like. Furthermore Boxes can be arranged in folders and subfolders and you can re-drag Boxes and folders to change their order. We also created &quot;Smart Boxes&quot;, like iTunes Smart Playlists, these folders are constantly updated based on given criteria. The search feature has been revamped to search for different criteria and the speed has been improved a lot.\n\nBesides organizing, you can export icons to different formats like ICNS, PNG, TIFF, JPEG, GIF, PDF, even the iContainer format and last but not least as a convenient .zip package, ready to share with others.\n\nMode 2: Customize\n\nSince version 2, IconBox features full icon customization. Users can customize their system icons, dock icons, application icons, volume icons and even their dock in an easy to use drag-and drop way. This means that one can download the well know &quot;iContainers&quot; from different sites all over the web, having them change the look of your system with the click of a single button!\n\nMode 3: Tools\n\nIconBox also features a &quot;Tools&quot; mode. The purpose of this mode is to host different icon related tools. The first tool available for now is &quot;X-Ray Applications&quot;. X-Ray scans your application folder for the apps within and by clicking an app, it shows all the available icons and images within the application package, letting you have a look at them (Even with Preview.app), export them etc...\n\nMode 4: Online\n\nFeatures:\n\n* Icon-Of-The-Day: A new icon from a particular icon designer every\n  day, downloadable directly into IconBox, straight into the\n  &quot;Downloaded&quot; Box, ready to share or customize.\n\n* Icon Sites: A convenient list of major icon sites on the web, more sites\n  will be added on the go. Double-Clicking a site opens it up in your\n  default web browser.\n\n* IconFinder: Perhaps the most underestimated section in IconBox. It\n  uses the iconfinder.com API which let's you search trough over 155.000\n  icons and allows you to instantly download them into IconBox by drag\n  'n drop, conveniently creating all Icon Sizes as needed.\n\nWhat's New:\n\n* Fixed a potential crash on Mac OS X 10.7 when searching for icons via\n  IconFinder.\n\n* Made customizing icons easier with the use of a &quot;Helper Tool&quot;. Your\n  password will only be needed once to customize and restore icons.\n\n* Minor bugfixes and improvements.\n\nMore info: http://www.iconboxapp.com/\n\nSystem Requirements:\n\nIntel Mac, OS X.6 or greater\n\n_-- PLEASE SEED ---","torrent":{"xt":"urn:btih:90bdc892945f2a40a09dc7c99d058d3bdf002287","amp;dn":"IconBox+v.2.5.4+with+NOY+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90bdc892945f2a40a09dc7c99d058d3bdf002287","infoHashBuffer":{"type":"Buffer","data":[144,189,200,146,148,95,42,64,160,157,199,201,157,5,141,59,223,0,34,135]},"announce":[],"urlList":[]}}