{"title":"ARTHUR CHRISTMAS RMVB GLOBE","uid":6902948,"size":185845205,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:91121b7ccc195cebd489e220a46b99bbbd3767ef&amp;dn=ARTHUR+CHRISTMAS+RMVB+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1324467583,"description":"* RMVB CAM  * 01H31M23S  * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* RECOMMENDED PLAYERS :\n\n\n- RMVB PLAYER or - MEDIACOPE \n\nor convert to your prefered video type for any other player\n\n\n\n* INTRO :\n\n\nArthur Christmas is a 2011 British/American 3-D computer animated fantasy comedy film produced by Aardman Animations and Sony Pictures Animation and distributed by Columbia Pictures. It was released on November 11, 2011, in the UK and on November 23, 2011, in the USA. The film was directed by Sarah Smith, and it features voices of James McAvoy, Hugh Laurie, Jim Broadbent, Bill Nighy, Imelda Staunton and Ashley Jensen. Set in the North Pole, the plot tells about Santa\\'s son Arthur Christmas, who must complete a mission before Christmas morning.\n\n\n\n* PLOT :\n\n\nThe story of Arthur Christmas revolves around the current Santa Claus, his wife, his two sons Arthur and Steve, and their grandfather, Grand-Santa. Set on Christmas Eve night, the film opens with a set of elves sitting behind their computers in the command center of Santa\\'s mile-wide, ultra-high-tech sleigh titled the S-1. While Santa and the elves deliver presents to children using fancy advanced equipment and military precision, Santa\\'s oldest son Steve manages the operation at mission control, alongside his obsequious assistant Peter. However, his clumsy younger brother Arthur, who is assigned to handling childrens\\' letters in the mail department, inadvertently disrupts operations when he enters mission control to place some correspondence and a present falls out of the system as a result.\nWith the seventieth annual delivery mission under his official command completed, Santa, being far past his prime and whose role in field operations now is largely symbolic, returns to give a congratulatory speech to the elves. Much to Steve\\'s frustration, who has long anticipated succeeding his father, Santa announces he intends to continue for the foreseeable future.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2011 *\n","torrent":{"xt":"urn:btih:91121b7ccc195cebd489e220a46b99bbbd3767ef","amp;dn":"ARTHUR+CHRISTMAS+RMVB+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91121b7ccc195cebd489e220a46b99bbbd3767ef","infoHashBuffer":{"type":"Buffer","data":[145,18,27,124,204,25,92,235,212,137,226,32,164,107,153,187,189,55,103,239]},"announce":[],"urlList":[]}}