{"title":"Crazy stupid love (2011) psp","uid":6941385,"size":475014203,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:91ca37497eddcdf9a547aaabb147ae54ba522e3f&amp;dn=Crazy+stupid+love+%282011%29+psp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"al8capone","files":1,"time":1326047058,"description":"Cal Weaver (Steve Carell) gets the surprise of his life when he learns that his wife Emily (Julianne Moore) cheated on him with a coworker, David Lindhagen (Kevin Bacon), and wants a divorce. After moving into his own apartment, Cal begins frequenting a bar night after night, talking loudly about his divorce, until he attracts the attention of a young man named Jacob Palmer (Ryan Gosling). Jacob is a womanizer who successfully beds women each night, although a young woman named Hannah (Emma Stone) firmly rejects his advances. It is clear Hannah catches Jacob\\'s eye. However after she leaves, Jacob takes pity on Cal, Jacob agrees to teach him how to pick up women. As they spend their evenings at the bar together, a friendship begins to blossom.\nOn Cal\\'s first attempt to seduce a woman he meets a woman named Kate (Marisa Tomei). She initially rejects his awkward advances, but eventually they sleep together. Cal manages to successfully seduce multiple women, despite this he can\\'t seem to forget his wife. He sees his wife again at his son Robbie\\'s (Jonah Bobo) parent teacher conference. The meeting goes well until they discover Robbie\\'s teacher is Kate who reveals to Emily that Cal had seduced her. Emily leaves in disgust and begins actively dating David.\nMeanwhile, Hannah, a law student, and is studying for the bar exam. After Hannah passes the bar exam, her boyfriend, Richard (Josh Groban) does not propose leaving Hannah hurt. Hannah storms from the restaurant and returns to the bar where she originally rejected Jacob\\'s advances. Upon finding Jacob at the bar, Hannah pulls him into a passionate kiss. The two return to Jacob\\'s home to have sex, but end up staying awake all night talking about themselves. Jacob starts a relationship with Hannah, and ends up distancing himself from Cal. Cal, not understanding why Jacob is avoiding his phone calls, slips back into a lonely and depressive state.\nAt the same time, Robbie makes numerous grand gestures to try to win the heart of his 17-year-old babysitter, Jessica Riley (Analeigh Tipton). Robbie tells Cal that he believes Jessica is his soulmate just like he believes Emily is Cal\\'s soulmate. Unfortunately, Jessica doesn\\'t reciprocate his affection. Instead Jessica, on the advice of a classmate, takes naked photos of herself to send to Cal and tucks them away in an envelope inside her dresser drawer.\nLater, when Emily calls Cal under the guise of needing help, Cal decides to try and win her back.\nJacob returns Cal\\'s calls and apologizes for being unreachable. He tells Cal that he needs advice because he thinks he is falling for a girl (Hannah) and that he is on the way to meet her mother. Cal reassures Jacob, telling him to just be himself.\nJessica\\'s father, Bernie (John Carroll Lynch), discovers Jessica\\'s naked photos addressed to Cal. He rushes to the Weaver residence to confront Cal.\nIn preparation for winning his wife back, Cal and his kids create a makeshift mini golf set in their backyard to remind Emily of their first date. During the gathering, Jacob and Hannah show up at the house unexpectedly and Hannah is revealed to be Cal and Emily\\'s daughter. At that moment, Bernis shows up and attacks Cal. Jessica arrives and desperately tries to stop her father\\'s attacks, telling him that Cal knew nothing of the pictures.\nRobbie is upset his father is Jessica\\'s secret crush. David also arrives to return Emily\\'s jacket from a previous date. Jacob responds by attacking David for stealing Emily away from Cal. Cal, Jacob, David, and Bernie then get into a scuffle which is soon broken up by the police.\nCal starts spending his time at the bar again and receives a visit from Jacob. He confesses that he is in love with Hannah. Cal, however, cannot approve of their relationship because he states Jacob is a womanizer. In spite of Cal\\'s disapproval, Jacob harbors no ill feelings, but rather respects him and praises him for being a great father.\nAt Robbie\\'s eighth grade graduation, Robbie is the Salutatorian and gives a pessimistic speech about how he no longer believes in true love and soulmates. Cal stops him and instead begins to recount his courtship with Emily to the audience, saying that, while he doesn\\'t know if things will work out, he will never give up on Emily. With renewed faith, Robbie reaffirms his love for Jessica to audience applause. After the ceremony, Cal finally approves of Jacob and Hannah\\'s relationship. Jessica, flattered by Robbie\\'s declaration of love, gives him an envelope containing the nude photos of herself to \\&quot;get him through high school\\&quot;. Cal and Emily have a laugh talking about the events that have transpired the past year, as Robbie looks on at them and grins.","torrent":{"xt":"urn:btih:91ca37497eddcdf9a547aaabb147ae54ba522e3f","amp;dn":"Crazy+stupid+love+%282011%29+psp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ca37497eddcdf9a547aaabb147ae54ba522e3f","infoHashBuffer":{"type":"Buffer","data":[145,202,55,73,126,221,205,249,165,71,170,171,177,71,174,84,186,82,46,63]},"announce":[],"urlList":[]}}