{"title":"The Bass That Ate Miami - The Foundation (Portuguese)","uid":15946194,"size":1599555028,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:9319ffc718609b51d1b236f90bff4c3e06c3686d&amp;dn=The+Bass+That+Ate+Miami+-+The+Foundation+%28Portuguese%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":2,"time":1475511658,"description":"Produced by: Alex Weir, Chris Walton, Scott Libengood, and Rick Sosa.\r\nDreamhouse Studios and Cut It Up Def Entertainment are excited to announce the debut of their latest creation, &quot;The Bass That Ate Miami, The Foundation&quot;. This independent documentary is based on the evolution of music in South Florida and the untold story of the hip hop genre known as Miami Bass. South Florida artists, producers and music executives helped evolve this sound into its own unique hip hop dance genre. Miami Bass dominated the airwaves and car speakers from the mid 1980's to the mid 1990's. The Miami Bass sound continues to influence many of today's hottest artists.\r\n\r\nAs hip hop grew and took over different regions of the U.S.; South Florida gave birth to a new style of hip hop that most people don't realize evolved there. The fast, bass heavy drum beats that are used in pop culture today were created on the street corners of South Florida with huge speakers and massive street parties.\r\n\r\nThe documentary features segments on Kraftwerk, Electro-Funk, breakdancing, turntableism, drum machine programming (the 808 &amp; the SP1200), the process of record making, car audio exhibitions and of course high energy dance moves.\r\n\r\nSome of the main creators of this genre are interviewed including; Afrika Bambaataa (The God Father of Hip Hop), Pretty Tony (The Inventor of Freestyle), Mr. Mixx (One of the Forefathers of Bass), Jim Jonsin, Afro-Rican, Dynamix II and many more producers, deejay's &amp; artists from the old school to new school","torrent":{"xt":"urn:btih:9319ffc718609b51d1b236f90bff4c3e06c3686d","amp;dn":"The+Bass+That+Ate+Miami+-+The+Foundation+%28Portuguese%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9319ffc718609b51d1b236f90bff4c3e06c3686d","infoHashBuffer":{"type":"Buffer","data":[147,25,255,199,24,96,155,81,209,178,54,249,11,255,76,62,6,195,104,109]},"announce":[],"urlList":[]}}