{"title":"Rambo Collection With Extras DVDRiP XviD AC-3-DEFiANCE","uid":6931470,"size":6603355606,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:938b28c290983d67a2654efa1a32f3004c943701&amp;dn=Rambo+Collection+With+Extras+DVDRiP+XviD+AC-3-DEFiANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":41,"time":1325676281,"description":"Video Information\n\nFormat : AVI\nCodec ID : XVID\nCodec ID/Hint : XviD\nBit rate : 1 000 Kbps\nWidth : 720 pixels\nHeight : 314 pixels\nDisplay aspect ratio : 16:9\nFrame rate : 29.970 fps\n\nAudio Information\n\nFormat : AC-3\nCodec ID/Hint : 2000\nBit rate mode : Constant\nBit rate : 384 Kbps (Rambo 4 - 448 Kbps)\nSampling rate : 48.0 KHz\nChannel(s) : 6 channels\n\nRipper/Encoder: hartlepoolunitedfc\nFile Source: DVD Retaill\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0083944/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0083944/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0089880/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0089880/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0095956/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0095956/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0462499/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0462499/&lt;/a&gt;\n\nPlot:\n\nRambo: First Blood - John J. Rambo is a former United States Special Forces soldier who fought in Vietnam and won the Congressional Medal of Honor, but his time in Vietnam still haunts him. As he came to Hope, Washington to visit a friend, he was guided out of town by the Sheriff William Teasel who insults Rambo, but what Teasel does not know that his insult angered Rambo to the point where Rambo became violent and was arrested, as he was at the county jail being cleaned, he escapes and goes on a rampage through the forest to try to escape from the sheriffs who want to kill him. Then, as Rambo's commanding officer, Colonel Samuel Trautman tries to save both the Sheriff's department and Rambo before the situation gets out of hand.\n\nRambo: First Blood Part II - John Rambo is removed from prison by his former superior, Colonel Samuel Troutman, for a top-secret operation to bring back POW's still held in Vietnam. Rambo's assignment is to only take pictures of where the POWs are being held, but Rambo wants to get the POWs out of Vietnam. Teamed up with female Vietnamese freedom fighter Co Bao, Rambo embarks on a mission to rescue the POWs, who are being held by sadistic Vietnamese Captain Vinh and his Russian comrade, Lieutenant Colonel Padovsky. Rambo starts killing every enemy in sight while still focusing on his intentions to rescue the POWs. There are also corrupt American officials involved in the mission, including Marshall Murdock, one of Rambo's superiors.\n\nRambo III - John Rambo's former Vietnam superior, Colonel Samuel Trautman, has been assigned to lead a mission to help the Mujahedeen rebels who are fighting the Soviet invasion of Afghanistan, but the Buddhist Rambo turns down Trautman's request that Rambo help out. When the mission goes belly up and Trautman is kidnapped and tortured by Russian Colonel Zaysen, Rambo launches a rescue effort and allies himself with the Mujahedeen rebels and gets their help in trying to rescue Trautman from Zaysen.\n\nRambo (a.k.a John Rambo) - John Rambo has retreated to a simple life in a rural Thai village near the Burmese border, capturing snakes for local entertainers, and transporting roamers in his old PT boat. Following repeated pleas, Rambo helps ferry a group of Christian aid workers into war-torn Burma, where the local Karen villagers are regularly tortured and massacred by Major Tint's sadistic soldiers. The humanitarian mission is going well, until the village is attacked and the missionaries are kidnapped, and Rambo is once again asked to transport - but this time a group of mercenaries, assembled by the missionaries' minister on a deadly rescue mission. This time he doesn't stay behind.\n\nAll extras from all discs, plus bonus disc from 4th movie, are included except for featurettes. These include alternate endings and openings, deleted scenes, documentaries and more","torrent":{"xt":"urn:btih:938b28c290983d67a2654efa1a32f3004c943701","amp;dn":"Rambo+Collection+With+Extras+DVDRiP+XviD+AC-3-DEFiANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"938b28c290983d67a2654efa1a32f3004c943701","infoHashBuffer":{"type":"Buffer","data":[147,139,40,194,144,152,61,103,162,101,78,250,26,50,243,0,76,148,55,1]},"announce":[],"urlList":[]}}