{"title":"Theremin An Electronic Odyssey (span subs) [1994]","uid":6982937,"size":774948356,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94fd7556f8271d1db64f4017c6e7aa9a998a0f74&amp;dn=Theremin+An+Electronic+Odyssey+%28span+subs%29+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1327467614,"description":" &lt;a href=&quot;http://bayimg.com/damFmaadC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/damFmaadC&lt;/a&gt;\n\nTheremin: An Electronic Odyssey (1994) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108323/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108323/&lt;/a&gt;\n\nENGLISH LANGUAGE WITH HARD SPANISH SUBTITLES  FULL SCREEN VHS \n\nTheremin: An Electronic Odyssey is a 1993 documentary film directed by Steven M. Martin about the life of Leon Theremin and his invention, the theremin, a pioneering electronic musical instrument.\n\nTHEREMIN: An Electronic Odyssey tells the life story of Lev Sergeivich Termen, known in the West as Leon Theremin, a Russian physicist who invented the entire field of electronic music with his remarkable musical instrument, originally called the aetherphone, but soon simply referred to as a Theremin, or Thereminvox(voice of Theremin). It follows his life, including being imprisoned in a Soviet gulag, and the influence of his instrument, which came to define the sound of eerie in 20th Century movies, and influenced popular music as it searched for and celebrated electronic music in the 1960's.\n\nTheremin: An Electronic Odyssey won the Documentary Filmmakers Trophy at the 1994 Sundance Film Festival. It was also nominated for an International Emmy as well as a BAFTA, the Huw Wheldon Award for the Best Arts Programme, one of the British Academy Television Awards. Theremin was named to the Top Ten Films of the Year lists in Los Angeles, Boston, and Washington DC, and was invited to almost every important film festival in the world, including The New York Film Festival, set a record for the longest question and answer period at the National Gallery in Washington, and was shown by invitation of the Russian Ministry of Culture to top scientists in St. Petersburg.\n\nJanet Maslin of The New York Times called the film a &quot;fascinating, offbeat documentary that stands as a fine job of detective work.&quot;\n\nIn a December 1995 review, Roger Ebert wrote: Watching Theremin: An Electronic Odyssey is a curious experience. You begin with interest, and then you pass through the stages of curiosity, fascination and disbelief, until in the last 20 minutes, you arrive at a state of dumbfounded wonder. It is the kind of movie that requires a musical score only the Theremin possibly could supply. \n","torrent":{"xt":"urn:btih:94fd7556f8271d1db64f4017c6e7aa9a998a0f74","amp;dn":"Theremin+An+Electronic+Odyssey+%28span+subs%29+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94fd7556f8271d1db64f4017c6e7aa9a998a0f74","infoHashBuffer":{"type":"Buffer","data":[148,253,117,86,248,39,29,29,182,79,64,23,198,231,170,154,153,138,15,116]},"announce":[],"urlList":[]}}