{"title":"The Great Famine (TV) {2011] PBS","uid":6967535,"size":577011990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:953939bc8725fb895bfd0ceadff15194a92f5a79&amp;dn=The+Great+Famine+%28TV%29+%7B2011%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1326933303,"description":" &lt;a href=&quot;http://bayimg.com/CALMpAaDN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CALMpAaDN&lt;/a&gt;\n\nThe American Experience \n\nThe Great Famine \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1803591/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1803591/&lt;/a&gt;\n\nOriginal Air Date:11 April 2011 \n\nThe little-known story of the American effort to relieve starvation in the new Soviet Russia in 1921, The Great Famine is a documentary about the worst natural disaster in Europe since the Black Plague in the Middle Ages. Five million Russians died. Half a world away, Americans responded with a massive two-year relief campaign, championed by Herbert Hoover, director of the American Relief Administration known as the ARA.\n\nSupplies awaiting transport to RussiaIn July of 1921, Herbert Hoover, received a plea for international aid by Russian novelist Maxim Gorky. &quot;Gloomy days have come for the country of Tolstoy, Dostoyevsky, Mendeleyev,&quot; Gorky warned. He made a similar request to other Western nations, but it was Hoover who responded immediately with a promise of support.\n\nThe first American relief ships arrived in Petrograd in September 1921, as the embers of the 1917 Russian revolution still smoldered. American relief workers were among the first outsiders to break through Russia's isolation and to witness and record the impact of the Bolshevik Revolution. They would be tested by a railroad system in disarray, a forbidding climate, a ruthless government suspicious of their motives, and the enormous scale of death and starvation.\n\nThe initial plan called for feeding one million children by delivering bread, rice, grits, sugar, corn and milk to the most hard hit regions. Almost immediately, Hoover encountered formidable obstacles. Vladimir Lenin's new communist government was skeptical of American aid and sabotaged the relief effort by planting spies in local American Relief Administration offices. When trains stuck on the tracks prevented food from being transported, Russian officials were uncooperative, resulting in delays that contributed to an estimated 50,000 deaths. New estimates in the fall of 1921 revealed that at least 16 million Russians would be impacted by the famine. Hoover's initial plan to feed just the children would not be sufficient.\n\nThat winter, cannibalism became widespread across Russia as the people continued to starve. In the U.S., Hoover managed to double the project's funding, arguing that by providing food famine relief, Americans could demonstrate the strength, kindness and efficiency of American society to a Communist culture.\n\nAfter a spring thaw, hundreds of American relief workers -- nicknamed &quot;Hoover's boys&quot; -- were finally able to deliver food. In August 1922, a full five months after the initial shipments of corn were sent to Russia, American Relief Administration officials were still feeding almost 11 million Soviet citizens each day in 19,000 kitchens. By the end of the famine that fall, five million Russians had starved to death, but the toll would have been significantly higher without Hoover's unprecedented humanitarian commitment.\n\nKnown as &quot;the Great Humanitarian&quot; for his relief work during and after World War I, Hoover is said to have saved more lives than any person in history.\n\n&quot;Lenin's government never recognized America's humanitarian motives,&quot; says producer Austin Hoyt (George H. W. Bush, Victory in the Pacific, Reagan). The Soviets always saw the relief workers as exploiters and spies.&quot; The Cheka, Lenin's secret police, kept a watchful eye on the Americans and especially on the 120,000 Russians the ARA hired to do the work. White Russians and aristocrats, the losers in Russia's brutal civil war, were hired because they were educated. The Bolsheviks feared the ARA was training them as counter-revolutionaries. The tensions the Americans experienced in the early 1920s would come to dominate U.S. Soviet relations for much of the century.\n\nBased on The Big Show in Bololand by Bertrand M. Patenaude, The Great Famine tells a riveting story of American engagement with a distant and desperate people -- an engagement hailed for its efficiency, grit, and generosity -- within the larger story of the Russian Revolution and the roots of the U.S.-Soviet rivalry that would dominate the second half of the 20th century.\n\n","torrent":{"xt":"urn:btih:953939bc8725fb895bfd0ceadff15194a92f5a79","amp;dn":"The+Great+Famine+%28TV%29+%7B2011%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953939bc8725fb895bfd0ceadff15194a92f5a79","infoHashBuffer":{"type":"Buffer","data":[149,57,57,188,135,37,251,137,91,253,12,234,223,241,81,148,169,47,90,121]},"announce":[],"urlList":[]}}