{"title":"Tierra de Lobos - Season 1 (2010)","uid":6997426,"size":9896066348,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95776ce767f26a59b4acccda3bfa07d8ba96af7e&amp;dn=Tierra+de+Lobos+-+Season+1+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lescougar","files":-1,"time":1327934787,"description":"Cesar (Alex Garcia) and Roman (Junio Valverde) Bravo return to the land where they were born, after fleeing from an attempted bank robbery in Portugal, where all of their men get killed. The only resource they have to break from their past and start a new life now, is a broken down shack where they grew up, located at the ravine (La Quebrada). However, their good intentions are hampered by Antonio Lobo (Juan Fernandez), the local landowner who controls the impoverished people of the town and sees the strangers as a threat to his maintained oligarchy. Lobo is a widower who lives with his four daughters, Almudena (Silvia Alonso), Isabel (Adriana Torrebejano), Nieves (Dafne Fernandez) and Rosita (Carla Diaz); all of whom he treats with authority and paternalism. He and his henchmen, led by his foreman Anibal (Antonio Velazquez), try to make the two foreigners leave but can\\'t prevent the emerging love between Lobo\\'s eldest daughter Almudena and Cesar. The livelihood of the Bravo brothers seems impossible: Lobo hates them and none of the towns people except Elena (Maria Castro), supports them. But everything changes when they meet Jean Marie Raymond (Jordi Rico), a flamboyant character who arrives from Switzerland and convinces them that their land lies on a medicinal spring with which they could earn much money. So the Bravo\\'s decide to stay and fight for what\\'s theirs, and along the way, discover dark secrets buried within the collective memory of the \\'Land of Wolves\\'.\n\nEnglish Subtitles are In Progress: http://crisabel.jumpwiki.com/wiki/Translations","torrent":{"xt":"urn:btih:95776ce767f26a59b4acccda3bfa07d8ba96af7e","amp;dn":"Tierra+de+Lobos+-+Season+1+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95776ce767f26a59b4acccda3bfa07d8ba96af7e","infoHashBuffer":{"type":"Buffer","data":[149,119,108,231,103,242,106,89,180,172,204,218,59,250,7,216,186,150,175,126]},"announce":[],"urlList":[]}}