{"title":"Smash Cops v1.00.08","uid":6948550,"size":108954930,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:96a5a4222dd74747235d6cddf020ef370470b62f&amp;dn=Smash+Cops+v1.00.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mobile-warez","files":2,"time":1326317907,"description":"Be the Police in Americas wildest chases!\n\n PURSUE: Takedown runaway felons whilst avoiding civilian traffic and buddy police as you chase and weave through traffic.\n\n ESCAPE: Escape under time pressure from felon attack and get to a call out location as quickly as possible.\n\n LARGE DRIVABLE CITY: Huge city with high quality visuals creates a fun and rich environment for different attack and escape routes spread over 20 missions and 5 vehicles.\n\n CHAOS AND MAYHEM: Smash, crush and flip felon vehicles. Obliterate the street scenery.\n\n GROUND BREAKING CONTROLS: By placing your finger behind the car you can steer, weave, defend and attack runaway felons with full control of your vehicle, never before used in touch racing games.\n\n CHALLENGE: 4 different mini games, smash a load of cars illegally parked in a car park, weave through a course laid out by cones, dodge traffic on a high way and collect evidence through out the city.\n\n **iPhone 3GS and iPod Touch 3 users, Smash Cops will play but will be slower in parts as uses extensive physics optimised for more powerful iOS devices**\n **Optimised for iPhone 4 and iPad 1**\n **Enhanced for iPhone 4S and iPad2. Enjoy more physics and more visual FX that take advantage of that extra power!**","torrent":{"xt":"urn:btih:96a5a4222dd74747235d6cddf020ef370470b62f","amp;dn":"Smash+Cops+v1.00.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96a5a4222dd74747235d6cddf020ef370470b62f","infoHashBuffer":{"type":"Buffer","data":[150,165,164,34,45,215,71,71,35,93,108,221,240,32,239,55,4,112,182,47]},"announce":[],"urlList":[]}}