{"title":"Bonanza Platinum Collection 2 Dvd 5 van 5 (NLsubs) TBS B-SAM","uid":7007073,"size":4564697493,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:97ecb93874c94b7b04cd5d622f8e043c34dbd7ab&amp;dn=Bonanza+Platinum+Collection+2+Dvd+5+van+5+%28NLsubs%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1328307222,"description":"\n\nBonanza Platinum Collection 2  (5 Dvd's) Dvd 5\n \n\n Beschrijving\n\n\nDvd 1\n\n\nThe Mill: Tom Edwards is in een rolstoel beland en hij houdt Ben Cartwright daarvoor verantwoordelijk.\nDe Cartwrights besluiten hem te helpen.\n\nDenver McKee: Voormalig sheriff McKee viert de terugkeer van zijn dochter Connie. \nMcKee wordt gevraagd om een bende op te sporen, maar niemand vermoedt dat hij zelf bij de bendebetrokken is.\n\nDay Of Reckoning: Matsou, een verstoten indiaan, redt het leven van Ben. Ben geeft hem daarvoor een stukje land en een huis.\n\nDvd 2\n\n\nThe Last Viking: Gunnar Borgstrom komt op bezoek bij zijn familie, de Cartwrights. Ze hebben geen idee dat Borgstrom deel uitmaakt \nvan een bende.\n\nThe Savage: Op weg naar Nevada City komt Adam een vrouw tegen die bedreigd wordt door Shoshone-indianen. Adam wil haar beschermen.\n\nThe Ape: Een vriend van Hoss, Arnie heeft hetzelfde postuur als Hoss, maar is iets minder snel van begrip en te goed van vertrouwen. \nDaardoor komt hij in allerlei problemen.\n\nDvd 3\n\n\nThe Courtship: Joe en Hoss reizen naar Sacremento om op bezoek te gaan bij de weduwe van Ben's vriend Josh Layton.\nHoss wordt verliefd op de weduwe Helen.\n\nThe Spitfire: Een brandstichter wordt betrapt en neergeschoten door Joe. Maar de man laat een dochter na waarvoor iemand moet zorgen.\n\nBreed Of Violence: Dooly Kincaid, dochter van de sherrif, valt altijd voor de verkeerde man. \nAls zij kennis krijgt met Vince Dagen, probeert Joe haar op andere gedachten te brengen.\n\nDvd 4\n\n\nSilent Thunder: Op reis komt Joe een doofstom meisje tegen. Joe leert haar gebarentaal. \nDe vader is sceptisch en vermoedt dat Joe andere bedoelingen heeft.\n\nThe Stranger: Ben \nwil gouverneur van Nevada worden. Maar dat wordt niet gemakkelijk als hem een fout uit het verre verleden wordt aangerekend.\n\nEscape To The Ponderosa: Adam wordt in elkaar geslagen door ontsnapte gevangenen. \nBen gaat met legerkapitein Bolton op jacht naar de gevangenen.\n\nDvd 5\n\n\nThe Avenger: \nAdam en Ben staan op het punt opgehangen te worden wegens moord. \nHoss en Joe doen er alles aan om hun onschuld te bewijzen.\n\nBitter Water: Mijnbouwer Lem Keith wil grond kopen van eigenaar Andy McKaren. \nLem vraagtdat niet aan Andy, omdat deze nooit zal verkopen, maar hij probeert diens zoon Todd om te praten.\n\nFeet Of Clay: Als de jongen Billy Allen zijn moeder verliest kan hij tijdelijk terecht op de Ponderosa Ranch. \nDaar wacht hij op zijn vader.\n\n\nSpotinformatie \n\nCategorie     : Beeld 4X3\nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Engels DD 2.0\nExtra's       : Nee\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Ja\nGenre         : Western\n\n\n\n\n\n\n\n\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:97ecb93874c94b7b04cd5d622f8e043c34dbd7ab","amp;dn":"Bonanza+Platinum+Collection+2+Dvd+5+van+5+%28NLsubs%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ecb93874c94b7b04cd5d622f8e043c34dbd7ab","infoHashBuffer":{"type":"Buffer","data":[151,236,185,56,116,201,75,123,4,205,93,98,47,142,4,60,52,219,215,171]},"announce":[],"urlList":[]}}