{"title":"DB42 Full Version v1.2 Android","uid":6951228,"size":3546034,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:997a4823cf92fc7bd13d6db844911cc36ddaf30d&amp;dn=DB42+Full+Version+v1.2+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":-1,"time":1326411850,"description":"DB42 Full Version v1.2\nRequirements: 1.6+\nOverview: DB42 is a 2D platformer game that uses mechanics similar to Portal and Portal 2.\n\n\n\nMake your way through the Cynobotic Army's Advanced Robotic Training grounds. These will test your wits and resourcefulness to the UTMOST! Jump, run, swing, GRAPPLE and TELEPORT your way to the top!! Learn the ropes as you explore the introductory levels that slowly introduce you to the components of the game. From there, you BLAST OFF into many more levels of fun and brain-teasing craziness!!!\n\nAlong the way you will pick up UPGRADES that enhance your capabilities. Find things like:\n- The JUNK BUDDY. This is a short range tractor beam for pulling objects towards you. Very useful for obtaining things that are just... out.. of... REACH!\n- The REPUGNICATOR. This is a repulsor ray that allows you to push remote switches and do things like... SHOOT HOOPS. Yes. Seriously!!\n- The Infinite Reality Interstitial Surface (IRIS). Use your IRIS enhancements to TELEPORT around a level. Folding space has NEVER been so EASY!\n\nAs you travel through the environments, you'll encounter things like water HAZARDS, ANTI-GRAVITY fields, and object field SUPPRESSORS.\n\nDB42 is a CASUAL PLATFORM / PUZZLE GAME that puts you on the path to robotic GREATNESS! This game is Swarm enabled and supports LEADERBOARDS, \n\nACHIEVEMENTS, and CLOUD STORAGE! With cloud storage, your scores will follow you across all your devices! Note: You *must* be logged into Swarm to record high scores, earn achievements, and utilize cloud storage!\n\nNearly 60 Achievements to acquire!!!\n\nThis FULL VERSION contains 100 brain-teasing levels. We highly recommend you try the LITE version before purchasing the FULL version to verify compatibility with your device.\n\nIf you love games like Portal or Portal 2, you will love DB42!\n\nWhat's in this version:\n-Button sizes now scale based on screen size. This addresses problems with them being too small on devices with a high pixel density.\n-Fixed a compatibility problem with the Galaxy Nexus.\n-Fixed a texture problem with 1-9. Tweaked 2-12 layout.\n-Fixed an intent receiver problem.\n","torrent":{"xt":"urn:btih:997a4823cf92fc7bd13d6db844911cc36ddaf30d","amp;dn":"DB42+Full+Version+v1.2+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"997a4823cf92fc7bd13d6db844911cc36ddaf30d","infoHashBuffer":{"type":"Buffer","data":[153,122,72,35,207,146,252,123,209,61,109,184,68,145,28,195,109,218,243,13]},"announce":[],"urlList":[]}}