{"title":"The.Unauthorised.Star.Wars.Story.1999.DVDRip.XviD-aAF.","uid":6992535,"size":747949738,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99e72fe6d534037ddc1ea92c9b28ecc5ba6b4b6b&amp;dn=The.Unauthorised.Star.Wars.Story.1999.DVDRip.XviD-aAF.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moviesp2p","files":2,"time":1327711820,"description":"TITLE: The Unauthorized 'Star Wars' Story\n\n\n\nYEAR: 1999\n\n\n\nGENRE: Documentary | Sci-Fi\n\n\n\nIMDB RATE: 4.9/10 (155 Votes)\n\n\n\nSTARS: Kenny Baker, Jeremy Bulloch and Michael Carter\n\n\n\nIMDB: http://www.imdb.com/title/tt0219372/\n\n\n\n\n\n\n\nThe Unauthorized Star Wars Story is everything you'd expect an unauthorized video to be: fun and full of gossip. In 1977, Star Wars took the world by surprise and this documentary traces its history (Lucas had trouble obtaining funding for &quot;the big sci-fi-space-adventure-Flash-Gordon thing,&quot; as it was called), interviews the actors, and looks at the cultish fandom that sprang up around the movie (Japanese fans traveled to the U.S. on Star Wars tours merely to see the film before it opened in their own country). The dish is plentiful and entertaining: Carrie Fisher hated Princess Leia's hair, pranksters would paste pictures of naked women in R2D2's costume, the actors thought the film was &quot;rubbish&quot; as they were making it. The many interview clips include discussions with Charles Lippincott, former vice president of Lucasfilm; Anthony Daniels, who played C3PO; Harrison Ford; Peter Mayhew, who played Chewbacca; Kenny Baker, better known as R2D2; Carrie Fisher; Mark Hamill; Rick McCallum, producer of The Phantom Menace; and George Lucas. Occasionally the documentary gives a bit too much information (do we really need to see George Lucas's hometown and listen to his neighbors?), but no matter--it doesn't detract from the overall voyeuristic nature of the video. The later films are touched on (Samuel L. Jackson is interviewed), but the concentration is on the original, Episode IV: A New Hope. Whether you're a casual fan or one of the devoted who wait all night in line for tickets to the next installment, The Unauthorized Star Wars Story is an interesting, fun, behind-the-scenes look at one the best-loved films of all time.\n\n\n\n\n\nGeneral\n\n\n\n\n\nContainer : AVI\n\nRuntime : 1h 2mn\n\nSize : 700 MiB\n\n\n\n\n\nVideo\n\n\n\n\n\nCodec : XviD\n\nResolution : 576x432\n\nAspect ratio : 4:3\n\nFrame rate : 25.000 fps\n\nBit rate : 1 413 Kbps\n\n\n\n\n\nAudio\n\n\n\n\n\n2.0ch MP3 @ 129 Kbps","torrent":{"xt":"urn:btih:99e72fe6d534037ddc1ea92c9b28ecc5ba6b4b6b","amp;dn":"The.Unauthorised.Star.Wars.Story.1999.DVDRip.XviD-aAF.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e72fe6d534037ddc1ea92c9b28ecc5ba6b4b6b","infoHashBuffer":{"type":"Buffer","data":[153,231,47,230,213,52,3,125,220,30,169,44,155,40,236,197,186,107,75,107]},"announce":[],"urlList":[]}}