{"title":"LOST_Season2_DVD2_(Retail)(MultiSub)(DVD9)","uid":6926153,"size":7313853181,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:99f4012f436ffbcf41f93a2b07ac59972af34388&amp;dn=LOST_Season2_DVD2_%28Retail%29%28MultiSub%29%28DVD9%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pharaootje","files":-1,"time":1325464967,"description":"Lost Season 2 (DVD 2):\n\nCategorie: Beeld\nFormaat: DVD9\nBron: Retail\nStandaard: PAL\nAudio: English, Spanish, French\nOndertiteling: English, Spanish, French, Dutch, Norwegian, Danish, Swedish, Finnish, Icelandic\nMenu: yes\nExtra's: Yes\nCovers: Yes\n\n\nNederlands:\n\nVerscheidene nieuwe personages, zoals Ana-Lucia Cortez, Libby en de Afrikaanse Mr. Eko doen hun intrede wanneer blijkt dat er op een andere plaats op het eiland eveneens overlevenden zijn uit het staartgedeelte van het vliegtuig. Ook het Dharma-initiatief (The Dharma Initiative) en de financierder The Hanso Foundation doen hun intrede. Zij zouden verantwoordelijk kunnen zijn voor de mysterieuze gebeurtenissen op het eiland. In ÃƒÂ©ÃƒÂ©n van de bunkers van 'The Dharma Initiative' vinden zij een film waarin uitleg wordt gegeven wat ze moeten doen om 'de wereld te redden'. Mr.Eko vindt nog een stukje film dat ertussenuit is geknipt waarin de losties zien dat ze met de computer niet mogen communiceren met de buitenwereld. John Locke begint te twijfelen over de knop waar ze om de 108 minuten op moesten drukken na het intikken van een code. Aan het einde van het seizoen drukt hij de knop niet in en ontstaat er een magnetisch veld door de overbelaste elektromagneet, die om de 108 minuten ontladen moet worden. De bunker implodeert waarbij de lucht paars wordt en de hele bunker wordt vernield.\n\n\nProductie: J.J. Abrams Ã‚Â· Jeffrey Lieber Ã‚Â· Damon Lindelof Ã‚Â· Carlton Cuse \nHoofdpersonages: Sayid Jarrah Ã‚Â· Claire Littleton Ã‚Â· Jack Shephard Ã‚Â· Hugo &quot;Hurley&quot; Reyes\n\t\t James &quot;Sawyer&quot; Ford Ã‚Â· Kwon Jin-soo Ã‚Â· Paik Sun-hwa Ã‚Â· Kate Austen Ã‚Â· John Locke\n\t\t Juliet Burke Ã‚Â· Benjamin Linus Ã‚Â· Danielle Rouseau Ã‚Â· Desmond Hume Ã‚Â· Charlotte Lewis\n\t\t Daniel Faraday Ã‚Â· Miles Straume Ã‚Â· Boone Carlyle Ã‚Â· Shannon Rutherford Ã‚Â· Mr. Eko Ã‚Â· Libby\n\t\t Ana LucÃƒÂ­a Cortez Ã‚Â· Charlie Pace Ã‚Â· Walt Lloyd Ã‚Â· Michael Dawson \nNevenpersonages: Tom Ã‚Â· Cindy Chandler Ã‚Â· Danny Pickett Ã‚Â· Rose Ã‚Â· Bernard Ã‚Â· Alex Ã‚Â· Ethan Rom\n\t\t Nikki Fernandez Ã‚Â· Paulo \nHoofdrollen: \t Naveen Andrews Ã‚Â· Nestor Carbonell Ã‚Â· Henry Ian Cusick Ã‚Â· Emilie de Ravin Ã‚Â· Michael Emerson\n\t\t Matthew Fox Ã‚Â· Jorge Garcia Ã‚Â· Josh Holloway Ã‚Â· Malcolm David Kelley Ã‚Â· Daniel Dae Kim\n\t\t Yunjin Kim Ã‚Â· Evangeline Lilly Ã‚Â· Elizabeth Mitchell Ã‚Â· Dominic Monaghan Ã‚Â· Terry O'Quinn\n\t\t Harold Perrineau Ã‚Â· Jeremy Davies Ã‚Â· Rebecca Mader Ã‚Â· Ken Leung \n\n\nDisk 2 (Seizoen 2)\n\n2-05 (30) &quot;...And Found&quot; Jin &amp; Sun Stephen Williams Carlton Cuse &amp; Damon Lindelof  19 oktober 2005 \nMichael, Sawyer en Jin worden nog altijd gevangen gehouden door de tweede groep overlevenden, die slechts uit vijf mensen meer bestaat: Eko, Bernard (de echtgenoot van de treurende Rose), Ana-Lucia en twee vrouwen. Nadat Michael, Sawyer en Jin vrij zijn gelaten uit de kooi ontsnapt Michael bij een zoektocht naar eten en rent de jungle in op zoek naar Walt. Jin en Mr. Eko proberen hem in te halen. Ze vinden het lijk van ene Goodwin die deel uitmaakte van de tweede groep overlevenden en ze horen en zien een groep volwassenen en kinderen, mogelijke gevangenen, passeren.  \n2-06 (31) &quot;Abandoned&quot; Shannon Adam Davidson Elizabeth Sarnoff  9 november 2005 \nJin en Eko slagen erin Michael terug te vinden en overtuigen hem ervan, terug te keren. Er wordt meer duidelijk over de tweede groep: ze werden de eerste nacht door de &quot;Others&quot; aangevallen en die ontvoerden drie mensen. Twee weken later wordt de groep opnieuw overvallen, deze keer worden negen mensen ontvoerd. De verwondingen van Sawyer, opgelopen tijdens de aanval van de &quot;Others&quot; op het vlot, verergeren en daarom beslist de groep naar de eerste groep overlevenden te gaan. Tijdens hun tocht worden ze achtervolgd door de &quot;Others&quot;. Cindy wordt door hen meegenomen en Shannon wordt neergeschoten.  \n2-07 (32) &quot;The Other 48 Days&quot; Mr. Eko, Ana Lucia &amp; Libby Eric Laneuville Damon Lindelof &amp; Carlton Cuse  16 november 2005 \nIn deze aflevering zien we, hoe de overlevenden van de crash in de staart van het vliegtuig de eerste 48 dagen doorbrachten. Ana-Lucia, Libby, Bernard, Cindy en Eko kennen we al, maar in het begin waren ze met meer. De &quot;Others&quot; hebben in het begin drie mensen van hen gepakt en daarna nog negen, daarom zijn ze zo bang voor de &quot;Others&quot;.  \n2-08 (33) &quot;Collision&quot; Ana Lucia Stephen Williams Javier Grillo-Marxuach &amp; Leonard Dick  23 november 2005 \nWe pikken het verhaal weer op, nadat Shannon werd neergeschoten door Ana-Lucia. Sayid is furieus en loopt vastberaden met een geweer naar Ana-Lucia. Mr. Eko kan nog net een tweede dodelijk slachtoffer vermijden als hij Sayid op de grond krijgt en zo zijn geweer kan afnemen. Ana-Lucia besluit om Sayid vast te binden aan de boom. Mr. Eko vreest voor Sawyers leven en besluit op eigen houtje naar het kamp van de andere overlevenden te gaan. Ana-Lucia maakt Michael duidelijk, dat ze van plan is alleen in de jungle te leven en ze beveelt hem achter munitie en kleren aan te gaan van het andere kamp. \nTerug bij de overlevenden van de ramp, wordt een romantisch partijtje golf tussen Jack en Kate verstoord door de komst van Eko met de zwaargewonde Sawyer. Jack brengt Sawyer onmiddellijk naar de hatch voor verdere verzorging en ondertussen arriveert Michael in de hatch. Nadat hij Jack inlicht, wil Jack onmiddellijk overgaan tot actie. Eko probeert Jack wat te kalmeren en hij beweert dat &quot;Ana-Lucia een fout heeft begaan&quot;. Nadat Jack die naam hoort vallen, denkt hij onmiddellijk terug aan zijn ontmoeting met Ana-Lucia op de luchthaven, juist voor de crash. Jack besluit alleen te gaan, zonder wapens. Wat verderop in de Jungle bij Ana-Lucia, worden de overlevenden wat ongeduldig en ze besluiten ook naar het kamp te gaan. Bernard wil graag zijn vrouw Rose zien en Jin kan niet wachten om Sun weer in zijn armen te hebben. Wanneer ze aankomen worden ze vriendelijk onthaald. Ana-Lucia blijft alleen achter met Sayid en ze vertelt wat over haar leven. Ze besluit Sayid vrij te maken. Op dat ogenblik arriveert Jack. Ana lijkt blij te zijn, Jack te zien, maar ze schaamt zich wanneer ze Jacks uitdrukking ziet.\n\nFlashback: In de eerste flashback wordt duidelijk gemaakt dat Ana-Lucia een politieagente was. Ze was in therapie omdat ze een ongeluk tegenkwam toen een student haar neerschoot. Na een lange revalidatieperiode besluit Ana-Lucia's moeder, die ook bij de politie werkt, dat Ana weer klaar is om haar werk als politieagente voort te zetten. Toch blijkt Ana-Lucia niet koelbloedig wanneer ze een vrouw en een man ziet discussiÃƒÂ«ren, terwijl een baby huilt. Ana-Lucia reageert heftig en pakt direct haar revolver. Na dit incident wordt Ana-Lucia geconfronteerd met de student die haar neerschoot op het politiebureau. De moeder van Ana vraagt om de dader, Jason genaamd, te identificeren. Ook al had Jason al bekend, dat hij Ana neerschoot, toch weigert ze om hem aan te duiden als de dader. Diezelfde avond gaat Ana-Lucia naar een bar. Het blijkt dat Jason ook in die bar was. Nadat Jason de bar verlaat en naar de parkeerplaats gaat, volgt Ana-Lucia hem. Wanneer ze merkt dat ze alleen is zegt ze: &quot;HÃƒÂ© Jason, ik was zwanger&quot;. Daarna schiet ze hem meerdere keren in de borst.  \n  \n","torrent":{"xt":"urn:btih:99f4012f436ffbcf41f93a2b07ac59972af34388","amp;dn":"LOST_Season2_DVD2_%28Retail%29%28MultiSub%29%28DVD9%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f4012f436ffbcf41f93a2b07ac59972af34388","infoHashBuffer":{"type":"Buffer","data":[153,244,1,47,67,111,251,207,65,249,58,43,7,172,89,151,42,243,67,136]},"announce":[],"urlList":[]}}