{"title":"Macworld (UK) - February 2012","uid":6967839,"size":32901636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b4a1f7f4662b482cfab2cddefdb3d89a655f96b&amp;dn=Macworld+%28UK%29+-+February+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MsB1982","files":-1,"time":1326986134,"description":"Many magazines devoted to Macintosh computing have come and gone over the years, but Macworld has aged gracefully and become the premier resource for news, reviews, tips, and chatter for the Apple crowd. But far from being a stale grande dame, Macworld continues to pepper its articles and monthly columns by Andy Ihnatko and Christopher Breen with zest, humor, and unbiased viewpoints. The magazine also regularly attracts some of the best writers in the Mac universe, including Photoshop and prepress wizard Bruce Fraser, Quark guru David Blatner, and Adam Engst, editor of the popular TidBits e-newsletter. Their insight and invaluable step-by-step tips help you get the most out of your Mac. But Macworld's bread and butter comes from its heaping helping of reviews on the latest hardware systems, software, monitors, add-on gadgets, and more. They cut to the chase without a lot of fluff, offering review summaries with pros and cons, buying advice, and a rating scale of one to five mice (computer mice, that is).","torrent":{"xt":"urn:btih:9b4a1f7f4662b482cfab2cddefdb3d89a655f96b","amp;dn":"Macworld+%28UK%29+-+February+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4a1f7f4662b482cfab2cddefdb3d89a655f96b","infoHashBuffer":{"type":"Buffer","data":[155,74,31,127,70,98,180,130,207,171,44,221,239,219,61,137,166,85,249,107]},"announce":[],"urlList":[]}}