{"title":"[DivX ac3 Ita Eng] Independence Day -  (nautilus-bt.org)","uid":6967125,"size":1856407552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9de1d1727099addb922685abdb95f00ee3bd451e&amp;dn=%5BDivX+ac3+Ita+Eng%5D+Independence+Day+-++%28nautilus-bt.org%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Collerom","files":-1,"time":1326967983,"description":"DUAL AUDIO\nITALIANO\nENGLISH\n\n &lt;a href=&quot;\nhttp://img810.imageshack.us/img810/3424/independencedayavisnaps.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img810.imageshack.us/img810/3424/independencedayavisnaps.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img838.imageshack.us/img838/3424/independencedayavisnaps.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img838.imageshack.us/img838/3424/independencedayavisnaps.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img31.imageshack.us/img31/3424/independencedayavisnaps.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img31.imageshack.us/img31/3424/independencedayavisnaps.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img208.imageshack.us/img208/3424/independencedayavisnaps.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img208.imageshack.us/img208/3424/independencedayavisnaps.png&lt;/a&gt;\n\nIndependence Day\n\n\n\nPlot\n\nOn July 2, an enormous alien mothership enters orbit around Earth and deploys 36 saucer-shaped destroyers, each of which is at least 24 km wide, over major cities around the globe. In New York City, David Levinson (Jeff Goldblum) discovers transmissions that he believes the aliens are using as a countdown to coordinate an attack. David and his father Julius (Judd Hirsch) travel to the White House and warn U.S. President Thomas J. Whitmore (Bill Pullman) of the attack. The President, portions of his Cabinet and the Levinsons narrowly escape aboard Air Force One as the alien spacecraft destroy Washington D.C., New York City, Los Angeles, and other major cities around the world with energy-based weapons.\n\nMeanwhile, USMC Captain Steven Hiller (Will Smith) is called to take part in a counterattack against the aliens. His girlfriend Jasmine, her son, and their pet dog survive the attack by hiding in a workmen's shed in a Los Angeles freeway tunnel. The next day, on July 3, Jasmine uses a maintenance truck in an effort to reach Hiller's base and finds several survivors. She also finds the injured First Lady (Mary McDonnell), who had been in Los Angeles and whose helicopter was brought down by the alien attack.\n\nOn the same day, as part of a U.S. counterattack, Captain Hiller leads a squadron of F/A-18 Hornets on a mission to engage with a destroyer near the remains of Los Angeles. The destroyers are revealed to be guarded by force fields, which repel projectiles and nuclear detonations, and it releases scores of smaller &quot;attacker&quot; ships armed with similar shields and weaponry. After a one-sided dogfight ensues, resulting in the destruction of Hiller's base, Hiller survives by luring an attacker to the Grand Canyon,[4] where he causes it to crash and then subdues the alien pilot. Hiller is picked up in the desert by a refugee group that includes Russell Casse (Randy Quaid), an alcoholic crop-duster who has claimed that he was abducted by the aliens ten years previously. They take the captured alien to Area 51, where Air Force One has already landed. Area 51 conceals a top secret facility housing a repaired attacker ship and alien bodies recovered from Roswell in 1947. The captured alien regains consciousness at an Area 51 lab, kills the scientists examining it, and attempts a psychic attack against Whitmore, but is shot and killed by his entourage, although not before Whitmore gains an idea of the species' goals, describing them as locusts that travel from planet to planet, harvesting a planet's resources before moving on......\n\n\n\nDirected by Roland Emmerich\nProduced by Dean Devlin\nWritten by Dean Devlin\nRoland Emmerich\nStarring Will Smith\nJeff Goldblum\nBill Pullman\nMargaret Colin\nVivica A. Fox\nMary McDonnell\nJudd Hirsch\nRobert Loggia\nRandy Quaid\nJames Rebhorn\n\n\n\n\n\n\n\n\n\nCast\n\nWill Smith as Captain Steven Hiller: An assured United States Marine Corps F/A-18 pilot. Devlin and Emmerich had always envisioned an African-American for the role, and specifically wanted Smith after seeing his performance in Six Degrees of Separation.\nJeff Goldblum as David Levinson: An MIT-educated computer expert, chess enthusiast and environmentalist, working as a satellite technician in New York City.\nBill Pullman as President Thomas J. Whitmore: President of the United States, a former Persian Gulf War fighter pilot. To prepare for the role, Pullman read The Commanders by Bob Woodward and watched the documentary film The War Room.\nMargaret Colin as Constance Spano: White House Communications Director, David's ex-wife.\nRobert Loggia as General William Grey: A United States Marine Corps general who is the Chairman of the Joint Chiefs of Staff. Loggia modeled the character after generals of World War II, particularly George S. Patton.\nRandy Quaid as Russell Casse: A widowed, alcoholic crop duster and veteran Vietnam War pilot who claims to have been an alien abductee ten years prior to the events of the film.\nJames Duval as Miguel Casse, Russell's eldest son.\nJudd Hirsch as Julius Levinson: David Levinson's father. The character was based on one of Devlin's uncles.\nMary McDonnell as First Lady Marilyn Whitmore.\nVivica A. Fox as Jasmine Dubrow: A single mother, Steve's girlfriend and exotic dancer.\nJames Rebhorn as Albert Nimzicki: The Secretary of Defense and former director of the CIA. Rebhorn described the character as being much like Oliver North. The character's eventual firing lampoons Joe Nimziki, MGM's head of advertising and reportedly accounted for unpleasant experiences for Devlin and Emmerich when studio executives forced recuts of Stargate.\nHarvey Fierstein as Marty Gilbert: David's boss.\nAdam Baldwin as Major Mitchell: A United States Air Force officer who is the commanding officer at Area 51.\nBrent Spiner as Dr. Brackish Okun: The unkempt and highly excitable scientist in charge of research at Area 51. Devlin, who is open to the idea of bringing Dr. Okun back in the event of a sequel, later implied the character is merely in a coma. The character's appearance and verbal style are based upon those of visual effects supervisor Jeffrey A. Okun, with whom Emmerich had worked on Stargate.\nHarry Connick, Jr. as Captain Jimmy Wilder: Steve's best friend and fellow pilot. Connick took over the part for Matthew Perry, originally cast in the role.[15]\nKiersten Warren as Tiffany: Jasmine's exotic dancer friend.\nMae Whitman as Patricia, the President's daughter. She is called 'Munchkin' by her parents.\nFrank Welker as Alien vocal effects\n\n\n\n[ Info sul file ]\n\nNome: Independence day.avi\nData: 18/01/2012 11:10:36\nDimensione: 1,856,407,552 bytes (1770.408 MB)\n\n[ Info generiche ]\n\nDurata: 02:27:16 (8836.44 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 3\nTipo stream n. 0: video\nTipo stream n. 1: audio\nTipo stream n. 2: audio\nAudio streams: 2\nISFT: VirtualDubMod 1.4.13\nINAM: Independance day\nISBJ: Independance day\nIART: Colleromito\nICOP: nautilus-bt.org\nJUNK: VirtualDub build 14328/release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: MEDIA (640 x 272)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 16 (BENE)\nQualitÃƒÂ  DRF medio: ALTA (2.905526)\nQualitÃƒÂ  deviazione standard: ALTA (0.684726)\nMedia pesata dev. std.: ALTA (0.500221)\n\n[ Traccia video ]\n\nFourCC: divx/DX50\nRisoluzione: 640 x 272\nDisplay aspect ratio: 40:17 = 2.352941 (~2.35:1)\nFramerate: 25 fps\nFrames totali: 220911\nBitrate: 1154.209298 kbps\nQf: 0.265213\nMax key int: 250\n\n[ Traccia audio n. 1 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 256 kbps CBR\nCanali: 5\nFrequenza: 48000 Hz\nStream size: 282,765,088 bytes\nRitardo: 0 ms\n\n[ Traccia audio n. 2 ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 256 kbps CBR\nCanali: 5\nFrequenza: 48000 Hz\nStream size: 282,765,344 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b2816p\nPacked bitstream: SÃƒÂ¬\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 220911\nFrames corrotti: 0\n\nI-VOPs: 6057 ( 2.742 %) #\nP-VOPs: 132075 ( 59.787 %) ###############\nB-VOPs: 82779 ( 37.472 %) #########\n\nMax consecutive B-VOPs: 1\n\n[ Analisi DRF ]\n\nDRF medio: 3.277921\nDeviazione standard: 1.820635\nDRF max: 16\n\nDRF=1: 44 ( 0.020 %)\nDRF=2: 59432 ( 26.903 %) #######\nDRF=3: 108927 ( 49.308 %) ############\nDRF=4: 40251 ( 18.220 %) #####\nDRF=5: 1529 ( 0.692 %)\nDRF=6: 1110 ( 0.502 %)\nDRF=7: 387 ( 0.175 %)\nDRF=8: 1689 ( 0.765 %)\nDRF=9: 3019 ( 1.367 %)\nDRF&gt;9: 4523 ( 2.047 %) #\n\n[ Analisi DRF (corretta) ]\n\nInizio titoli di coda: 02:18:48 (8327.84 s) - frames ignorati: 12715\n\nDRF medio: 2.905526\nDeviazione standard: 0.684726\nDRF max: 6\n\nDRF=1: 44 ( 0.021 %)\nDRF=2: 59426 ( 28.543 %) #######\nDRF=3: 108889 ( 52.301 %) #############\nDRF=4: 39833 ( 19.132 %) #####\nDRF=5: 0 ( 0.000 %)\nDRF=6: 4 ( 0.002 %)\nDRF&gt;6: 0 ( 0.000 %) ","torrent":{"xt":"urn:btih:9de1d1727099addb922685abdb95f00ee3bd451e","amp;dn":"%5BDivX+ac3+Ita+Eng%5D+Independence+Day+-++%28nautilus-bt.org%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de1d1727099addb922685abdb95f00ee3bd451e","infoHashBuffer":{"type":"Buffer","data":[157,225,209,114,112,153,173,219,146,38,133,171,219,149,240,14,227,189,69,30]},"announce":[],"urlList":[]}}