{"title":"Merger 3D","uid":15914191,"size":7928127,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a05d63f7652ada8e9184845653a5eb6d258af306&amp;dn=Merger+3D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1475178897,"description":"2048AD - the year in which humanity was faced with bio-terrorism. The desire to reach the next stage of evolution, which ran contrary to the facts of nature, formed the study of illegal modification to human cells. Because of this, a special unit was formed by mercenaries who opposed human experimentation. One of the major terrorist groups created a secret base in the jungle and started the project &quot;Confluence&quot;, combining plant cells with human cells. The group of scientists that worked on this experimental process also raised an army of soulless bio-soldiers to guard the project. But during the final experiment, &quot;Confluence&quot; went out of control and began taking over its surroundings. You, as one of the best mercenaries, will have to stop the project in the only way possible: break into its epicenter and blast it to smithereens!\r\n\r\n\r\n\r\nThe game takes its roots from classic first-person shooters, a series of games such as Wolfenstein 3D, Spear Of Destiny, Operation Bodycount, Blake Stone and many others. The color palette is taken from Operation Bodycount, while the game uses a unique graphical style, approximately similar to Wolfenstein 3D. In Merger 3D, you'll need to pass through long levels, breaking through many crowds of enemies","torrent":{"xt":"urn:btih:a05d63f7652ada8e9184845653a5eb6d258af306","amp;dn":"Merger+3D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05d63f7652ada8e9184845653a5eb6d258af306","infoHashBuffer":{"type":"Buffer","data":[160,93,99,247,101,42,218,142,145,132,132,86,83,165,235,109,37,138,243,6]},"announce":[],"urlList":[]}}