{"title":"Cyber Update Jan 2012/------WP-17374 Dana Vespoli and Aiden Star","uid":6970859,"size":2850000963,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a132f127ac8c8faf1cf68074227310713027f682&amp;dn=Cyber+Update+Jan+2012%2F------WP-17374+Dana+Vespoli+and+Aiden+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":-1,"time":1327086861,"description":"From Kink.com    (Wiredpussy)  + Pics\n\n\n\n&quot;The Terrifying Nature of Electricity&quot; A Reality Film\n  \n Wired Pussy takes a turn for reality in this update, but don't worry, this is the furthest thing from the prim and proper middle-aged housewives with husbands that are too permissive that you see on TV. Instead we have Aiden Starr starting out by talking about wanting to introduce Dana Vespoli into the mysteries of electro sex. Dana, on the other hand, has never heard of Aiden and is not impressed by the diminutive blonde Dom. \nAiden, noticing she's not getting the respect she demands, turns what was to be an initiation into an hate-fueled all-anal fuckfest of lesbian bondage. Aiden delights watching Dana squirm and receive shocks while locked inside an electric cage. But that's not the end of Dana's lesson in humility, Aiden takes the metal electric butt plug and the zapper for additional behavioral reinforcement. You can not only see but you can feel Dana's debilitating fear! \nTo ensure the lesson sticks, Aiden ups the electro BDSM on Dana with the copper pipe predicament, applying sticky pads to her and letting her muscles wear out under the constant constriction and relaxation they induce. Aiden makes sure Dana's discomfort doesn't end there, with even more anal ass fucking with an acrylic plug. \nJust when Dana thinks that there can't possibly be more, Aiden's twisted mind is just getting started with the lesbian BDSM possibilities. Aiden takes out the sticky pads again and applies them to Dana's ass, while giving her fist, the whole fist and nothing but the fist into her quivering stinkflower.\n \n\n\nScreens &lt;a href=&quot; http://www.wiredpussy.com/site/shoot.jsp?shootId=17374&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.wiredpussy.com/site/shoot.jsp?shootId=17374&lt;/a&gt;\n\n\nCheers","torrent":{"xt":"urn:btih:a132f127ac8c8faf1cf68074227310713027f682","amp;dn":"Cyber+Update+Jan+2012%2F------WP-17374+Dana+Vespoli+and+Aiden+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a132f127ac8c8faf1cf68074227310713027f682","infoHashBuffer":{"type":"Buffer","data":[161,50,241,39,172,140,143,175,28,246,128,116,34,115,16,113,48,39,246,130]},"announce":[],"urlList":[]}}