{"title":"Kors and Silverglate - The Shadow University (mobi, epub)","uid":6941730,"size":1324936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1555f8057765ad241eb5418affcde5b3d92a832&amp;dn=Kors+and+Silverglate+-+The+Shadow+University+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":2,"time":1326066989,"description":"The Shadow University: The Betrayal Of Liberty On America's Campuses\n\nUniversities once believed themselves to be sacred enclaves, where students and professors could debate the issues of the day and arrive at a better understanding of the human condition. Today, sadly, this ideal of the university is being quietly betrayed from within. Universities still set themselves apart from American society, but now they do so by enforcing their own politically correct worldview through censorship, double standards and a judicial system without due process. Faculty and students who threaten the prevailing norms may be forced to undergo &quot;thought reform.&quot;In a surreptitious about-face, universities have become the enemy of a free society, and the time has come to hold these institutions to account.\n\nThe Shadow University is a stinging indictment of the covert system of justice on college campuses, exposing the widespread reliance of n kangaroo courts and arbitrary punishment to coerce students and faculty into conformity. Alan Charles Kors and Harvey A. Silverglate, staunch civil libertarians and active defenders of free inquiry on campus, lay bare the totalitarian mindset that undergirds speech codes, conduct codes, and &quot;campus life&quot; bureaucracies, through which a cadre of deans and counselors indoctrinate students and faculty in an ideology that favors group rights over individual rights, sacrificing free speech and academic freedom to spare the sensitivities of currently favored groups. \n\nFrom Maine to California, at public and private universities alike, liberty and fairness are the first casualties as teachers and students find themselves in the dock, presumed guilty until proven innocent and often forbidden to cross-examine their accusers. Kors and Silverglate introduce us to many of those who have firsthand experience of The Shadow University, including: \n\nThe student at the center of the 1993 &quot;Water Buffalo&quot; case at the University of Pennsylvania who was brought up on charges of racial harassment after calling a group of rowdy students &quot;water buffalo&quot;--even though the terms has no racial connotations. \n\nThe Catholic residence adviser who was fired for refusing, on the grounds of religious conscience, to wear a symbol of lesbian and gay causes \n\nThe professor who was investigated for sexual harassment when he disagreed with campus feminists about curriculum issues \n\nThe student who was punished for laughing at a statement deemed offensive to others and who was ordered to undergo &quot;sensitivity training&quot; as a result.\n\nThe Shadow University unmasks a chilling reality for parent who entrust their sons and daughters to the authority of such institutions, for thinking people who recognize that vigorous debate is the only sure path to truth, and for all Americans who realize that when even one citizen is deprived of liberty, we are all diminished.\n\nAuthor: Alan Charles Kors and Harvey A. Silverglate\nPublisher: Harper Perennial\nPublication Date: September 22, 1999\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:a1555f8057765ad241eb5418affcde5b3d92a832","amp;dn":"Kors+and+Silverglate+-+The+Shadow+University+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1555f8057765ad241eb5418affcde5b3d92a832","infoHashBuffer":{"type":"Buffer","data":[161,85,95,128,87,118,90,210,65,235,84,24,175,252,222,91,61,146,168,50]},"announce":[],"urlList":[]}}