{"title":"Brain Guzzler","uid":15828877,"size":56794702,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a6ca7c0dc82d9651a48d35db7146cd911842c57a&amp;dn=Brain+Guzzler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1473889902,"description":"Ever wondered what it would be like if you suddenly got cravings to guzzle delicious brain matter? Ever wanted to cause complete carnage, terrorise the living, control the undead or even form a zombie chicken conga? Well, in Brain Guzzler you get to chow down in 'Chow Town'. Be prepared to get addicted to this skill based undead fest!\r\nAt the start of each level you change from human to zombie and suddenly develop an insatiable appetite to guzzle all other humans (and animal). The game works similar to the 70’s classic Snake and is just as addictive! The more humans you guzzle, the longer you’re chain of Zombies becomes which makes avoiding the various obstacles and edges ever more challenging. Controls are easy using simple swipes to negotiate the levels. Each level also contains individual missions giving players a break from the guzzling. Three towns, Brainington, Guzzleford and Guzzleborough together boast 30 fantastically varied, colourful levels! Brain Guzzler truly is a game you will find hard to put down! Happy Guzzling!","torrent":{"xt":"urn:btih:a6ca7c0dc82d9651a48d35db7146cd911842c57a","amp;dn":"Brain+Guzzler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6ca7c0dc82d9651a48d35db7146cd911842c57a","infoHashBuffer":{"type":"Buffer","data":[166,202,124,13,200,45,150,81,164,141,53,219,113,70,205,145,24,66,197,122]},"announce":[],"urlList":[]}}