{"title":"WAR HORSE XVID GLOBE","uid":6942856,"size":1472147686,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6f1be775eb0d6d3dcc4ab3609a77b67ad14f58e&amp;dn=WAR+HORSE+XVID+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1326070041,"description":"* XVID     * 02H26M37S    * ~ 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* Intro :\n\nWar Horse is a 2011 war drama film directed by Steven Spielberg. It is based on both War Horse, a children's novel set before and during World War I, by British author Michael Morpurgo, first published in the United Kingdom in 1982, and the 2007 stage adaptation of the same name.\n\n\n* Plot :\n\nIn Devon, England, Albert Narracott admires a young thoroughbred foal. Much to his mother Rose's dismay, Albert's father, Ted, buys the colt at auction, though he was intending to buy a plough horse for his farm. The purchase is also to spite his landlord, Lyons, who tried to outbid him for the colt. Albert names the horse Joey and devotes much time to training him. Albert's best friend, Andrew Easton, watches as Joey teaches his colt many things, such as to come when he whistles.\n\nTed, who has a bad leg and is an alcoholic, has fallen behind on the rent. He promises to pay Lyons after the family sells its turnip crop. Rose shows Albert his father's medals from the Second Boer War in South Africa, where Ted served with the Imperial Yeomanry. Ted was severely wounded in action, and received the Distinguished Conduct Medal for bravery under fire. She gives Albert his father's regimental pennant, telling Albert that his father was not proud about what he did during the war, and that he had thrown the flag and medals away, though Rose saved and kept them hidden. Albert trains Joey for the plough and, to his neighbours' astonishment, prepares a stony hillside field to plant with turnips. But a rainstorm destroys the turnip field and, to pay the overdue rent (and without telling Albert), Ted sells Joey to Captain Nicholls as World War I breaks out. When Albert finds out, Nicholls promises him he will take care of Joey and hopefully return him after the war. Albert tries to enlist in the army, but is too young. Before the captain leaves with Joey, Albert ties his father's pennant to Joey's bridle.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n* GLOBE FILES 2012","torrent":{"xt":"urn:btih:a6f1be775eb0d6d3dcc4ab3609a77b67ad14f58e","amp;dn":"WAR+HORSE+XVID+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f1be775eb0d6d3dcc4ab3609a77b67ad14f58e","infoHashBuffer":{"type":"Buffer","data":[166,241,190,119,94,176,214,211,220,196,171,54,9,167,123,103,173,20,245,142]},"announce":[],"urlList":[]}}