{"title":"Ricky_Laurent-Inside_Out-Digipak-2010-UTP","uid":6955410,"size":91610296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a70aa48c1fe4c6af8a6891973f601cae52e4ee00&amp;dn=Ricky_Laurent-Inside_Out-Digipak-2010-UTP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":14,"time":1326559320,"description":"UTP.PRESENTS\n\nRicky_Laurent-Inside_Out-Digipak-2010-UTP\n\nRELEASE.iNFO\n\nARTiST......: Ricky Laurent\nALBUM.......: Inside Out\nTYPE........: Digipack\nGENRE.......: Rock\nLABEL.......: Unsigned\n\nYEAR........: 2010            SOURCE...: CDDA\nRiP.DATE....: 01-02-2012      GRABBER..: EAC\nSTREET.DATE.: 00-00-2010      ENCODER..: LAME v3.98.4 -V0 --vbr-new\nCATALOG.....:                 QUALiTY..: 266kbpsavg/44.1kHz/Joint Stereo\n\nTRACK.LiST\n\n01  Baby Baby                                           3:03\n02  Voodoo                                              3:46\n03  Feeling Dirty                                       4:02\n04  Digging My Grave                                    4:33\n05  Hell And Back                                       4:09\n06  The Silence Is Killing Me                           4:12\n07  My Life On Earth                                    3:52\n08  Faceblaster                                         4:32\n09  Pudding Pie                                         4:06\n10  The Party Song                                      3:10\n\nTOTAL SiZE.: 10 Files/90.46MB/39:25 min\n\nRELEASE.NOTES\n\nFrom his early age, the career of Ricky Laurent, a young blues and\nrock guitarist and singer, takesoff quite swiftly. Ricky was born on\nNovember 7 th, 1990 in Gatineau Quebec . At age nine, he picks up his\nfirst guitar and magic happens: Ricky and guitar are made for one\nanother. Within a year, the young marvel already displays an amazing\nability to master the instrument at an unprecedented pace. From then\non, Ricky carefully studies the techniques of all his guitar heroes\nand soon develops his own style that combines his love for the blues\nwith classic rock. Being quite versatile, he also studied classical\nguitar at the Gatineau Music Conservatory for 3 years. By the time he\nwas thirteen, the Ottawa blues community was endorsing Rickys rare\ntalent. The Junkyard Dogs, Trevor Finlay, Fernando Jones(Chicago),\nPaul Deslauriers, Mud Boys and many more were inviting Ricky to sit in\nat local blues spots. It is during this period that he started to\nsing, rounding off his exceptional guitar abilities. Ricky is now an\nexcellent blues rock singer that can carry a song with surprising\nenergy and emotion. Even though he now spent a lot of time refining\nhis technique, Ricky waste anytime to start performing with his band\nRicky and the Soulbenders when Quebec blues veterans started to\nrecognize the young artists talents. He has since been invited to\nperform either as a first act or on stage with the likes of Steve\nHill, Bob Walsh, Jimmy James, Nanette Workman, Trudy Lynn ( Texas ),\nBreen Leboeuf (of Offenbach), ric Lapointe, Jean Millaire, Jim\nZeller, Bob Stagg, Paul Deslauriers, Guy Blanger and other\nestablished Montreal and Quebec artists aswell as International bands\nmusicians and artists such as CCR, Buddy Guy, James Cotton, Colin\nLinden,  Simple Plan, Finger Eleven, Crash karma and Frank Marino. In\nApril of 2005 , while only 14 years old, Ricky Laurent started his\nsolo career (as Ricky paquette) and signed a contract with\nPreservation Music Inc. from Montreal for 2 Albums. Early for the show\nand live at le festival International de Jazz de Montreal led him\nto touring around in Festivals, Concert halls and clubs in the\nProvince of Quebec,  Ontario, The USA, and It even brought him as far\nas Afghanistan, twice, to entertain our Canadian Soldiers . Over the\npast 4 years, Ricky has been on numerous TV shows; Belle et Bum, Bons\nBaisers de France, a manque  ma Culture, Musique Plus During this\ntime, He has also Been working hard on his own original material,\ncollaborating with different songwriters and has been experimenting\nwith his music a whole lot. Over the last year or so, He decide he was\nready to put out a new record! Inside Out is compiled of great\nsongs,  Riffs, Hooks, Psychedelia, Rock, Blues, with Just the right\namount of Pop appeal and fun!  So Stay tuned to see what 2011 holds\nfor Ricky Laurent. This is just a start\n\nURL:   &lt;a href=&quot; http://www.rickylaurent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.rickylaurent.com&lt;/a&gt;\n\nLoyal Rippers In Heat Since 2007 @2011\n\nStripped by HeXagon's Advanced NFO Stripper: http://www.stripnfo.com","torrent":{"xt":"urn:btih:a70aa48c1fe4c6af8a6891973f601cae52e4ee00","amp;dn":"Ricky_Laurent-Inside_Out-Digipak-2010-UTP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a70aa48c1fe4c6af8a6891973f601cae52e4ee00","infoHashBuffer":{"type":"Buffer","data":[167,10,164,140,31,228,198,175,138,104,145,151,63,96,28,174,82,228,238,0]},"announce":[],"urlList":[]}}