{"title":"Video Nasties: The Definitive Guide","uid":6940252,"size":7428730856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad0945f442bdb3a77eb4a5581cc465464f3bdf71&amp;dn=Video+Nasties%3A+The+Definitive+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kat190191","files":-1,"time":1325981919,"description":"Description:\n\nEvery Video Nasty critiqued and explored, followed by the original trailers, for the first time ever on DVD! Prepare to be corrupted and depraved once more with this definitive guide to the Video Nasties phenomenon - one of the most extraordinary and scandalous eras in the history of British film. For the first time ever on DVD, TRAILERS to all 72 films that fell foul of the Director of Public Prosecutions are featured with specially filmed intros for each title in a lavish three-disc collector's edition box-set, alongside a brand new documentary - VIDEO NASTIES: MORAL PANIC, CENSORSHIP AND VIDEOTAPE. \n\nDisc One The era-defining and critically acclaimed documentary VIDEO NASTIES: MORAL PANIC, CENSORSHIP AND VIDEOTAPE directed by Jake (Doghouse) West and produced by Marc Morris features interviews with filmmakers Neil Marshall ('The Descent', 'Doomsday'), Christopher Smith ('Severance', 'Black Death') and MP Graham Bright as well as rare archive footage featuring James Ferman (director of the BBFC 1975-1999) &amp; Mary Whitehouse. Taking in the explosion of home video, the erosion of civil liberties, the introduction of draconian censorship measures, hysterical press campaigns and the birth of many careers born in blood and videotape, West's documentary also reflects on the influence this peculiar era still exerts on us today. \n\nDisc Two presents the 39 titles that were successfully prosecuted in UK courts and deemed liable to deprave and corrupt. These included: 'Absurd', 'Cannibal Holocaust', 'The Driller Killer', 'I Spit on Your Grave', 'Nightmares in a Damaged Brain', 'Snuff' &amp; 'Zombie Flesh-Eaters'. \n\nDisc Three presents the 33 titles that were initially banned, but then subsequently acquitted and removed from the DPP's list. These included: 'Death Trap', 'Deep River Savages', 'The Evil Dead', 'Human Experiments', 'The Toolbox Murders' &amp; Zombie Creeping Flesh. Discs 2 &amp; 3 can be viewed either as a non-stop trailer show, or with newly-filmed introductions from a wide range of acclaimed media academics and notable genre journalists. Each disc is preceded by a brief introduction by cult horror presenter Emily Booth.\n\nPlease note that the aspect ratio can be changed in vlc in neccessary and that unfortunatley there is no subtitles available with this.\n\nEnjoy and Seed :)","torrent":{"xt":"urn:btih:ad0945f442bdb3a77eb4a5581cc465464f3bdf71","amp;dn":"Video+Nasties%3A+The+Definitive+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0945f442bdb3a77eb4a5581cc465464f3bdf71","infoHashBuffer":{"type":"Buffer","data":[173,9,69,244,66,189,179,167,126,180,165,88,28,196,101,70,79,59,223,113]},"announce":[],"urlList":[]}}