{"title":"Hitler's Home Front: Memoirs of a Hitler Youth","uid":16024556,"size":6784005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae7f0585e987f7c4f45c222b91aacd6856dc1837&amp;dn=Hitler%27s+Home+Front%3A+Memoirs+of+a+Hitler+Youth&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marty14","files":1,"time":1476369434,"description":"Hitler's Home Front: Memoirs of a Hitler Youth - Wilhelm R. Gehlen, Don A. Gregory [epub]\r\n\r\nTwelve years of rule by Hitler and the Nazi Party could have made Germany a third world country after the end of the war, and according to some highly placed Allied officials of the time; that would not have been such a bad idea. Whatever treatment the Allies had in mind for the Germans could not have been much worse than the conditions already in existence for them just before and just after the end of the war. The German economy and infrastructure was already a wreck and the inflation continued after the surrender with prices of essentials (if they could be bought) rising to double and triple that of 1943. Only the war industry continued to function reasonably well right up to the end. He has never voted for any political party and does not support one now, saying that the only honest politician he remembers is Adolf Hitler. “Hitler said, ‘Give me five years and you won’t recognize Germany’.\r\n\r\nThese are the memoirs of Wilhelm Reinhard Gehlen, a member of the Hitler Youth, a helper on a 20mm quad flak gun, and a part-time gardener during his childhood in Nazi Germany. In 1942, at the tender age of nine, Gregory took the 'Jungvolk' oath and along with other boys of a similar age vowed to give his life for Hitler. This candid and revealing memoir shows a normal boy and a family at war and in its aftermath, determined to do what it took to survive","torrent":{"xt":"urn:btih:ae7f0585e987f7c4f45c222b91aacd6856dc1837","amp;dn":"Hitler%27s+Home+Front%3A+Memoirs+of+a+Hitler+Youth","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7f0585e987f7c4f45c222b91aacd6856dc1837","infoHashBuffer":{"type":"Buffer","data":[174,127,5,133,233,135,247,196,244,92,34,43,145,170,205,104,86,220,24,55]},"announce":[],"urlList":[]}}