{"title":"MacJournal v. 6.0.1 with Core keygen","uid":6935951,"size":28389722,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:aecbc013b45d77da044c8745def15a3734fa4aa8&amp;dn=MacJournal+v.+6.0.1+with+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1325826158,"description":"Official Web Site: &lt;a href=&quot; http://www.marinersoftware.com/products/macjournal/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.marinersoftware.com/products/macjournal/&lt;/a&gt;\n\nMacJournal is the world's most popular journaling software for the Mac. MacJournal 6 adds a calendar mode that show entries from any journal, geo-location, word count and progress tracking, as well as additional blogging support. A Timeline mode has been added to gig the journaler the ability to see their writing activity in chronological order. MacJournal 6 even introduces a feature for creating books from journals specially formatted for publishing. \n\nAdd any kind of content, not just text. Drag PDFs, QuickTime movies, images, audio and more. Record audio and video, even publish to a blog account on Blogger, WordPress, LiveJournal, Posterous, and Tumblr. Dropbox support added as well.\n\nWhat's New:\n\n* Added a new Timeline View Mode showing a visual timeline of entries\n  in any or all journals\n\n* Added a Calendar View Mode that shows entries (and their titles) from\n  any or all journals\n\n* Added sidebar Navigation Modes, that allow you to display entries in \n your sidebar organized by Date, Tags, Priority, Status, Mood, Rating or\n Label\n\n* Added support for Posterous blogs\n\n* Added support for Tumblr blogs\n\n* Added support for uploading images to Imgur and Dropbox\n\n* Added a Trash where deleted entries go instead of being deleted right\n  away\n\n* Added a Books feature for creating books specially formatted for\n  publishing (online ordering of hard copy versions of your book will be\n  available in a forthcoming update)\n\n* Added word count goals and progress tracking\n\n* Added geolocation to new and existing entries\n\n* Added custom icons for entries and journals (choose from a built-in list\n  or use your own file)\n\n* Added a timer/stopwatch\n\n* Added zooming support for images and PDF files\n\n* Added &quot;New entry from Web Page&quot;\n\n* Added support to turn web archives into editable rich text files using the\n  &quot;Make Rich Text&quot; menu item\n\n* Added a way to edit textual entries in another application from the Edit\n  menu\n\n* Added a way to insert a picture taken directly from iSight\n\n* Added Blockquote toolbar item\n\n* Added Mood field for entries\n\n* Added Due Date for entries\n\n* Added a &quot;Link&quot; field for entries\n\n* Added browser window for backups with the ability to restore selected\n  entries or all data\n\n* Added simple mbox exporting\n\n* Added EPub exporting\n\n* Added support for import droplets for non-main documents\n\n* Added support for Lion full screen, and renamed the existing Full \n\n* Screen feature to Focused Editing\n\n* Adding importing of Web Archives by dragging a URL into the sidebar\n\n* Added automatic Picasa configuration for uploading images when auto\n -configuring a blogger.com blog\n\n* Redesigned the Info Bar to allow for customizing field layouts\n\n* Redesigned the Inspector to show only one section at a time, allowing\n  more information to be in each section, such as the various dates for \n  Journals\n\n* Added support for tags and annotation in HTML exporting\n\n* Added a bunch of easy links to sign up for free blogs when setting up a\n  blog\n\n* Added support for copy and paste of whole entries or journals between\n  documents\n\n* Added &quot;Back Up&quot; menu item to the File menu\n\n* Added an Image Properties window in the Format-&gt;Text menu for\n  controlling image sizes\n\n* Before synchronizing a mobile device, a backup is also made of the\n  remote device contents\n\n* Re-implemented encryption support to keep everything in memory and\n  avoid any decrypted content hitting the hard disk\n\nSystem Requirements:\n\nIntel Mac, OS X.6.8 or better\n\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:aecbc013b45d77da044c8745def15a3734fa4aa8","amp;dn":"MacJournal+v.+6.0.1+with+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aecbc013b45d77da044c8745def15a3734fa4aa8","infoHashBuffer":{"type":"Buffer","data":[174,203,192,19,180,93,119,218,4,76,135,69,222,241,90,55,52,250,74,168]},"announce":[],"urlList":[]}}