{"title":"iMediaShare Premium Full v3.65","uid":6993470,"size":1129097,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:af42bdd07557cd3143631d2d9b85dae79c664543&amp;dn=iMediaShare+Premium+Full+v3.65&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"StoneBoyTony","files":-1,"time":1327783714,"description":"iMediaShare Premium Full v3.65\n\nRequires Android: 1.6+\n\nRelease Date: 22 December 2011\n\n\nDescription\n\nFind and play personal and online video, music and photos\n\nEnjoy watching multimedia on your large-screen TV. iMediaShare transforms your smartphone into a remote control, allowing you to seamlessly stream and watch online media on the big screen TV. It also streams videos, music and photos stored locally on your phone directly on the connected TV.\n\nAdvantages over iMediaShare Lite:\n\n- Ad-free experience\n- More online video channels in HD\n- Video playback from YouTube links\n- Video playback of arbitrary mpeg files from the internet and other apps\n\niMediaShare requires no additional hardware and no cables. All you need is your Android phone, internet-enabled TV and a WiFi network. iMediaShare also supports connected audio systems, blu-ray players, game consoles (Playstation 3, XBox360), as well as other DLNA/UPnP media players.\n\niMediaShare lets you take your favorite content everywhere with you making it easy to share it with friends at any time on any connected screen.\n\nSupported online content channels: Animal Planet, Bild, Beet TV, Break.com, CBS News, CNBC, CNET (SD&amp;HD), CNN, COIN-OP TV, College Humor,Deutsche Welle, Driving Sports, Earth Touch, Engadget, Euronews, Facebook, France 24, Funny or Die, G4, Harvard Business Review, HDNet, Les Debiles, MaYoMo, Motorz (SD&amp;HD), NASA TV, NY Times, Picasa, PR Newswire, PSN, Revision3 (SD&amp;HD), Showtime, Spiegel Online, TED Talks (SD&amp;HD), The Onion, TWiT TV, VideoBASH, Vimeo, White House, YDN Design, YouTube and more to come.\n\nWith iMediaShare you can play your digital media on a variety of media devices:\n\n1) Televisions from Samsung (w/ AllShare), LG, Sony BRAVIA (experimental video support), Philips, Panasonic Viera (experimental video support), Toshiba\n2) Game consoles: Sony PlayStation 3, Microsoft XBox360\n3) Network Media Players: Sony Blu-ray, LG Blu-ray, WD TV Live,Hour, Xtreamer, Marantz, DirecTV, Logitech Revue (Google TV), etc.\n4) Audio/music players: Denon, Sonos, Onkyo, Linn, Philips Streamium, Yamaha, etc.\n5) Apple TV or other AirPlay-enabled devices\n6) Other DLNA/UPnP compliant media players.\n7) PC/Mac media servers: Twonky, Skifta, Windows Media Player, etc.\n\nNOTE (1): For best playback performance on PS3, please, ensure that your PS3 is WIRED and not WIRELESS.\n\nNOTE (2): Videos recorded with the phone's camera are not playable on some TVs and game consoles.\n\n\n*I don't know if it is 100% working but give it a try I'm psihicaly unable to check everything right now*\n*Working or not just reply so other people can see and provide your phone model*\n\n\nWhat's in this version:\n\n- MIUI ROM support enabled\n- Music playlists ordering issue fixed\n- Enabled support for Android 4.0 powered devices (Beta)\n- Improved performance of browsing channels and streaming online videos\n\nEnjoy and Please SeeD :)","torrent":{"xt":"urn:btih:af42bdd07557cd3143631d2d9b85dae79c664543","amp;dn":"iMediaShare+Premium+Full+v3.65","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af42bdd07557cd3143631d2d9b85dae79c664543","infoHashBuffer":{"type":"Buffer","data":[175,66,189,208,117,87,205,49,67,99,29,45,155,133,218,231,156,102,69,67]},"announce":[],"urlList":[]}}