{"title":"Twilight Zone - Season 4 - Original Series - MKV High Profile","uid":15901491,"size":9706687313,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:afa784bc8d730146056777924211cb80326bd8cd&amp;dn=Twilight+Zone+-+Season+4+-+Original+Series+-+MKV+High+Profile&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"OddioVizyule","files":18,"time":1475016265,"description":"&quot;There is a fifth dimension beyond that which is known to man. It is a dimension as vast as space and as timeless as infinity. It is the middle ground between light and shadow, between science and superstition, and it lies between the pit of man`s fears and the summit of his knowledge. This is the dimension of imagination. It is an area which we call...The Twilight Zone.&quot; \r\n\r\nThose were the first words greeting viewers when The Twilight Zone debuted in 1959. \r\n\r\nThe Twilight Zone is an American science-fiction, fantasy, psychological-supernatural horror anthology television series created by Rod Serling, which ran for five seasons on CBS from 1959 to 1964. The series consists of unrelated dramas depicting characters dealing with paranormal, futuristic, Kafkaesque, or otherwise disturbing or unusual events; characters who find themselves dealing with these strange, sometimes inexplicable happenings are said to have crossed over into &quot;The Twilight Zone&quot;. Each story typically features a moral and a surprise ending.\r\n\r\nThe series is notable for featuring both established stars (Joan Blondell, Ann Blyth, Art Carney, William Demarest, Buddy Ebsen, Jack Elam, Buster Keaton, Kevin McCarthy, Burgess Meredith, Agnes Moorehead, Ed Wynn) and younger actors who would become more famous later on (Bill Bixby, Charles Bronson, Donna Douglas, Robert Duvall, Anne Francis, Mariette Hartley, Earl Holliman, Dennis Hopper, Elizabeth Montgomery, Leonard Nimoy, Robert Redford, Burt Reynolds, Don Rickles, William Shatner, Telly Savalas, Alan Sues, George Takei, and Lee Van Cleef). Serling served as executive producer and head writer; he wrote or co-wrote 92 of the show's 156 episodes. He was also the show's host and narrator, delivering monologues at the beginning and end of each episode. Serling's opening and closing narrations usually summarize the episode's events encapsulating how and why the main character(s) had entered the Twilight Zone.\r\n\r\nIn 2013, the Writers Guild of America ranked it as the third best-written TV series ever","torrent":{"xt":"urn:btih:afa784bc8d730146056777924211cb80326bd8cd","amp;dn":"Twilight+Zone+-+Season+4+-+Original+Series+-+MKV+High+Profile","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa784bc8d730146056777924211cb80326bd8cd","infoHashBuffer":{"type":"Buffer","data":[175,167,132,188,141,115,1,70,5,103,119,146,66,17,203,128,50,107,216,205]},"announce":[],"urlList":[]}}