{"title":"HAYWIRE XVID cam GLOBE","uid":6986188,"size":846144325,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b052bf5b71c2581994bce4685af2595269737b36&amp;dn=HAYWIRE+XVID+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"globeplus","files":-1,"time":1327538936,"description":"* XVID     * 01H26M46S    * ~ 1200 Bitrate    * Worked with the Dub plugins\n\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n\n* Intro :\n\nHaywire is an action film directed by Steven Soderbergh, starring Gina Carano, Antonio Banderas, Michael Douglas, Ewan McGregor, Channing Tatum and Michael Fassbender.\n\n\n\n* Plot :\n\nAt a diner in Upstate New York, a woman called Mallory Kane (Gina Carano) is approached by a man called Aaron (Channing Tatum), who orders her to get in his car. She refuses, and they fight, with Aaron nearly capturing Mallory before the intervention of a customer called Scott (Michael Angarano) allows her to break Aaron's arm, knock him unconscious, and escape with Scott in Scott's car.\n\nMallory tells Scott that both she and Aaron are contractors with a private firm that is employed by the American government for covert operation assignments. One week before, the firm's director and Mallory's ex-boyfriend Kenneth (Ewan McGregor) was hired by governmental agent Coblenz (Michael Douglas) and his contact, Rodrigo (Antonio Banderas) to rescue a man called Jiang (Anthony Brandon Wong), who was captured in Barcelona. Mallory and her team, which includes Aaron, succeed in rescuing Jiang and delivering him to Rodrigo.\n\nShortly thereafter, Mallory is approached by Kenneth, who offers her what he claims is an easy mission: pose as the wife of a British agent called Paul (Michael Fassbender) during a mission in Dublin. Mallory agrees and accompanies Paul to a party at Russborough House, where they meet with his contact, Studer (Mathieu Kassovitz). Paul meets with Studer again as Mallory watches from afar. She sees Paul going into a barn and enters it after he leaves to find Jiang dead, clutching in his hand a brooch which Paul and Kenneth required her to wear as a recognition signal for her initial contact with Paul.\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *","torrent":{"xt":"urn:btih:b052bf5b71c2581994bce4685af2595269737b36","amp;dn":"HAYWIRE+XVID+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b052bf5b71c2581994bce4685af2595269737b36","infoHashBuffer":{"type":"Buffer","data":[176,82,191,91,113,194,88,25,148,188,228,104,90,242,89,82,105,115,123,54]},"announce":[],"urlList":[]}}