{"title":"Tomb Raider- Anniversa-alforo","uid":15813223,"size":2767263217,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b31ef9b286b1e8c1ea03db3d905625460518f480&amp;dn=Tomb+Raider-+Anniversa-alforo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alfrg72","files":1,"time":1473650177,"description":"La historia comienza en 1945 con la detonación nuclear de un artefacto desconocido en Los Álamos, Nuevo México. De la explosión se salió un ser con alas que se fue volando al cielo con un grito desgarrador. 51 años después en 1996, la historia nos sitúa en Calcuta, capital del estado indio de Bengala Occidental, un desconocido llamado Larson, desde su suite en el Hotel Imperial, envía un mensaje para concertar una cita con la arqueóloga Británica Lara Croft. Jacqueline Natla, Presidenta de Natla Technologies, se entrevista con Lara para ofrecerle la oportunidad de recuperar un antiguo artefacto llamado el Scion.\r\n\r\nLara acepta el trabajo. Su primera misión comienza en Perú. Lara se adentra en la Ciudad de Vilcabamba, una antigua ciudad Inca, para encontrar la &quot;Tumba de Qualopec&quot; donde está la primera pieza del Scion. Pero Lara pronto descubre que todo ha sido una trampa de Natla, al sorprender a Larson intentando robarle la parte del Scion e intentando matarla, tras interrogar a Larson, Lara descubre que, una vez que encontrase los artefactos, Natla habría decidido matarla. Larson le dice a Lara que Natla ha enviado a Pierre, un arqueólogo francés, para encontrar las otras dos piezas del Scion en el Monasterio de St. Francis folly en Grecia. Lara encuentra la segunda pieza en la &quot;Tumba de Tihocan&quot;, donde, al unir las dos piezas descubre que la tercera parte está en la Ciudad de Khamoon en Egipto. Lara encuentra la tercera parte, pero dos mercenarios de Natla le roban sus armas el Scion restaurado. Lara consigue escapar y sigue la pista hasta la ciudad perdida de la Atlántida, donde se desencadena la lucha final entre Lara y Natla","torrent":{"xt":"urn:btih:b31ef9b286b1e8c1ea03db3d905625460518f480","amp;dn":"Tomb+Raider-+Anniversa-alforo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b31ef9b286b1e8c1ea03db3d905625460518f480","infoHashBuffer":{"type":"Buffer","data":[179,30,249,178,134,177,232,193,234,3,219,61,144,86,37,70,5,24,244,128]},"announce":[],"urlList":[]}}