{"title":"Meltdown at Three Mile Island (TV) [1999] PBS","uid":6941843,"size":418857362,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b65f171709a7acd45c94e986e8e52e82b3883858&amp;dn=Meltdown+at+Three+Mile+Island+%28TV%29+%5B1999%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ThorntonWilde","files":-1,"time":1326072026,"description":" &lt;a href=&quot;http://bayimg.com/dAllJaADm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/dAllJaADm&lt;/a&gt;\n\nThe American Experience  \n\nMeltdown at Three Mile Island\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0285712/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0285712/&lt;/a&gt;\n\nOriginal Air Date:22 February 1999\n\nIt was never supposed to happen. In the predawn hours of March 28, 1979, a pressure valve suddenly malfunctioned at the Three Mile Island nuclear power plant near Harrisburg, Pennsylvania. What occured next--a combination of technical failure, human error, and bad luck--would result in the worst nuclear accident in American history. For five nerve-wracking days, engineers struggled to control a runaway reactor, government officials debated whether to evacuate the area, and residents contemplated the ultimate horror of a nuclear meltdown.\n\nMeltdown at Three Mile Island carefully re-examines step-by-step this national disaster which still haunts many Americans, and which dealt a crippling blow to the nation's nuclear power industry. Meltdown at Three Mile Island is produced by Chana Gazit (Surviving the Dust Bowl and Chicago 1968) and David Steward, and narrated by Liev Schreiber.\n\nFor nearly a year the nuclear plant had been quietly generating electricity in the middle of the Susquehanna River. Located just ten miles from the state capital of Harrisburg, Three Mile Island was within 100 miles of Philadelphia, Baltimore, and Washington, DC. People in the surrounding communities had grown accustomed to the concrete fortress with its giant cooling towers. &quot;I was just amazed, wide-eyed looking at the thing, and it was just neat,&quot; says Mike Pintek, a local resident and journalist. &quot;It was high technology and this was going to be power that was too cheap to meter.&quot;\n\nThe accident started at the plant's Unit 2 reactor when a small valve failed to close, causing cooling water to drain from the nuclear core. The core quickly began to overheat. Confronted by baffling and contradictory information, plant operators shut off the emergency water system that would have cooled the core. Within minutes, the mammoth control console was &quot;lit up like a Christmas tree,&quot; one operator recalls. Hundreds of flashing lights were accompanied by piercing horns and sirens. \n\nBy early morning Wednesday, March 28, the exposed part of the core was beginning to cook as temperatures in the reactor reached 4,300 degrees Fahrenheit--dangerously close to meltdown. Yet operators remained convinced that the core was covered and safe. &quot;We had a mindset that said we had these marvelous safety systems which had back-ups of back-ups,&quot; says Bob Long, a supervising engineer at Three Mile Island. &quot;It was hard for people to really come to grips with the reality that severe damage had occurred.&quot;\n\nBut when contaminated water leaked into an adjoining building and started to release radioactive gases inside the plant, Three Mile Island's supervisor declared the first general emergency ever to arise at a nuclear power plant in the United States. \n\nWord of the accident first reached the public in a radio report. Lieutenant Governor William Scranton assured everyone that the owner of the plant, Metropolitan Edison, had the situation under control, and no radiation had been released outside the plant. As Scranton left the podium, he learned that a release had in fact occurred; he had been misled. &quot;It was at that point I realized,&quot; says Scranton, &quot;that we could not rely on Metropolitan Edison for the kind of information we needed to make decisions.&quot; \n\nFrightened residents didn't know whom to believe either. Just days earlier, Hollywood had released The China Syndrome, a film about a potential meltdown at a nuclear power plant. In it, an area the size of Pennsylvania is threatened with annihilation. For residents, life was now imitating art. &quot;My sister called from LA,&quot; remembers Robin Stuart, &quot;saying `Get out, hurry up and get out.'&quot; More than 500,000 people now faced a decision: pack up and evacuate the area, or stay and stick it out.\n\nThe evacuation plans that Governor Dick Thornburgh had inherited were almost useless; one would have sent residents of two counties racing toward each other across a bridge. Thornburgh feared setting off public hysteria, but by Friday, March 30, he felt he had no choice but to advise pregnant women and school-age children to leave the area. His announcement unleashed a wave of panic as residents tossed a few belongings into their cars and sped off. More than 140,000 would eventually flee.\n\nFriday also brought a new, more terrifying revelation: a hydrogen bubble had formed above the reactor core. Over the weekend, scientists from the Nuclear Regulatory Commission argued about whether the bubble might explode at any minute. Now even the journalists covering the story were on the verge of hysteria. During Sunday Mass, one Roman Catholic priest offered general absolution. &quot;This is a sacrament reserved when death is imminent,&quot; recalls Victor Stello, a senior NRC engineer who was in the congregation. &quot;What we had done to these people was just outrageous. We had frightened them so bad, they thought they were going to die.&quot; \n\nA few hours later, President Jimmy Carter arrived. As his motorcade made its way to Three Mile Island, emotionally drained residents lined the street. &quot;They stood there and cheered,&quot; relates journalist Mike Gray, &quot;because he was with them.&quot;\n\nCarter's visit would mark the end of the crisis. That afternoon, scientists finally determined that the hydrogen bubble posed no immediate threat, and that the reactor core had stabilized. Gradually, residents began returning to their homes. Although they were told that an insignificant amount of radiation had been released during the accident, they would be plagued by doubts for years to come. \n\nThree years after the accident, a robotic camera was lowered into the Unit 2 core, providing the first look at what really had happened. Roger Mattson, a senior NRC engineer, describes what was revealed: &quot;We had a meltdown at Three Mile Island. Fifty percent of the core was destroyed or molten and something on the order of twenty tons of uranium found its way to the bottom head of the pressure vessel. That's a core meltdown. No question about it.&quot; \n\n","torrent":{"xt":"urn:btih:b65f171709a7acd45c94e986e8e52e82b3883858","amp;dn":"Meltdown+at+Three+Mile+Island+%28TV%29+%5B1999%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65f171709a7acd45c94e986e8e52e82b3883858","infoHashBuffer":{"type":"Buffer","data":[182,95,23,23,9,167,172,212,92,148,233,134,232,229,46,130,179,136,56,88]},"announce":[],"urlList":[]}}