{"title":"Ida Sand - The gospel truth 2011","uid":6903972,"size":282777571,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b79e4b6d418dcc86acc0000d38ec17a038c92bb8&amp;dn=Ida+Sand+-+The+gospel+truth+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"barber9","files":-1,"time":1324506902,"description":"The Gospel Truth presents the Swedish singer following on musically from her 2007 ACT debut, Meet Me Around Midnight, which captivated listeners with a sound which was distinctively earthy, soaked with the blood of the blues, saturated by gospel, weathered by jazz and infected by soul. (exystence.net)\n\nIda Sand's career began with the church choir. Her father was a well known Swedish opera singer and her mother is still a church organist. As such, Ida learnt to play not only the cello and piano but also sang in several choirs from the age of eight. It was not only Scandinavian choir music that influenced her but also America's gospel choirs. With the world hit Oh Happy Day by the Edwin Hawkins Singers, a gospel craze swept across Sweden in the early seventies which in turn led to gospel queen Mahalia Jackson becoming one of Ida's very earliest influences alongside the Swedish gospel pianist Per-Erik Hallin. Captivated by this music, Ida soon discovered the world of soul and fell in love with its masters, such as Ray Charles and Aretha Franklin.\nI grew up with a clear idea of religion, says Ida Sand. This has changed a bit now that I'm an adult but I still carry the belief with me, deep in my heart. Her latest album, The Gospel Truth, is the musical expression of this sentiment and many of the songs on it have been with the singer for a long time. For example, I have never sung Nina Simone's I Wish I Knew How It Would Feel to Be Free, before but it is one of the songs of my childhood. However, the album doesn't only feature the soul heroes of her childhood like Sam Cooke, Donnie Hathaway and Stevie Wonder (with a brilliant version of Have a Talk With God). Genuine surprises are also included, such as Madonna's Like A Prayer, John Hiatt's Have A Little Faith and I Wanna Know What Love Is, by the band Foreigner, which were part of her teenage years and twenties. It was a challenge to transfer also these songs from my wilder teenage years to the soul cosmos, explains Sand. And, of course, I didn't want it to be solely a gospel album which would have been too one-sided.\nVitality, suspense and considerable musical scope are provided not only by Sand's earthy and variable piano playing but also by select guest stars - in particular Nils Landgren who produced the album together with Siggi Loch, and who plays not only the trombone but also the trumpet. As Landgren has also been a member of the famous US band Jazz Crusaders for some time, he was also able to get Joe Sample to join in with his grooving, murmuring playing of the Fender Rhodes, and the great drummer Steve Gadd on A Change Is Gonna Come. Sand's husband, Ola Gustafsson, is also featured on the lap steel guitar as is her friend of many years, woodwind player Magnus Lindgren. A very special track is the magnificent vocal duet with blind singer and guitarist Raul Midon, who is extremely prominent back home in the USA. (ukstore.harmoniamundi.com)\n\n- - -\n\nIda Sand - The Gospel Truth 2011 \n(ACT Music)\n\n 1. Eyes On The Prize\n 2. Ain't No Sunshine\n 3. He Ain't Heavy, He's My Brother\n 4. A Change Is Gonna Come\n 5. Have A Talk With God\n 6. I Wanna Know What Love Is\n 7. Until The End\n 8. I Wish I Would Know How\n 9. Have A Little Faith In Me\n10. It Is To Know\n11. Like A Prayer\n12. God Only Knows\n","torrent":{"xt":"urn:btih:b79e4b6d418dcc86acc0000d38ec17a038c92bb8","amp;dn":"Ida+Sand+-+The+gospel+truth+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79e4b6d418dcc86acc0000d38ec17a038c92bb8","infoHashBuffer":{"type":"Buffer","data":[183,158,75,109,65,141,204,134,172,192,0,13,56,236,23,160,56,201,43,184]},"announce":[],"urlList":[]}}