{"title":"Tirukkural of Tiruvalluvar - English Translation[Complete]","uid":6931297,"size":4363008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8f6ca4490c1ef32df5dcff9a96649abf5fddf35&amp;dn=Tirukkural+of+Tiruvalluvar+-+English+Translation%5BComplete%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"594mgnav","files":-1,"time":1325672410,"description":"Tirukkural of Tiruvalluvar - English Translation[Complete][Team Nanban][TPB]\n\n\n\n\nTirukkural, sometimes spelt 'Thirukkural, is a classic of couplets or Kurals (1330 rhyming Tamil couplets) or aphorisms celebrated by Tamils.\n\nIt was authored by Thiruvalluvar, a poet who is said to have lived anytime between the 2nd and 6th centuries AD. \n\nAlthough the exact period of its composition is still disputed, scholars agree that it was produced in the late Tamil Sangam period. \n\nThe Thirukkural expounds on various aspects of life and is one of the most important works in the Tamil language. \n\nThis is reflected in some of the other names by which the text is known: Tamil marai (Tamil Vedas); poyyamozhi (words that never fail); and Daiva nool (divine text).\n\nThe book is considered to precede Manimekalai and Silapathikaram since they both acknowledge the Kural text.\n\nThirukkural (or the Kural) is a collection of 1330 Tamil couplets organised into 133 chapters. \n\nEach chapter has a specific subject ranging from &quot;ploughing a piece of land&quot; to &quot;ruling a country&quot;. It preaches simplicity and truth thorugh out its verses . \n\nAccording to the LIFCO Tamil-Tamil-English dictionary, the Tamil word Kural literally means &quot;short verse&quot;, and is typified by the Venpa metre that consists of two lines. \n\nIn the aspect of metre &amp; brevity, and the profoundity of expression,Thirukkural comes under one of the four categories of Venpas (Tamil verses) called Kural Venpa. \n\nThe 1330 couplets are arranged into 3 main sections and 133 chapters. Each chapter contains 10 couplets. \n\nA couplet consists of seven cirs, with four cirs on the first line and three on the second. A cir is a single or a combination of more than one Tamil word. \n\nFor example, Thirukkural is a cir formed by combining the two words Thiru and Kural, i.e. Thiru + Kural = Thirukkural. \n\nIt has been translated to various other languages.\n\nThere are claims and counter claims as to the authorship of the book and to the exact number of couplets written by Thiruvalluvar. \n\nThe first instance of the author's name mentioned as Thiruvalluvar is found to be several centuries later in a song of praise called Garland of Thiruvalluvar in Thiruvalluva Malai.\n\nMost of the Researchers and great Tamil Scholars like George Uglow Pope or \nG.U. Pope who had spent many years in Tamil Nadu and translated many Tamil texts into English, which includes Thirukkural.\n\n\nThis is one of the GREATEST TAMIL WORK WHICH HAS REDEFINED THE HUMAN SOULS..!!\n\nPLZ SEED THIS TORRENT AFTER DOWNLOADING...DONT LET DOWN THIRUVALLUVAR AND HIS GREAT THAMIZH...\n\nSO PLZ SEED THIS GOOD TORRENT...THANK YOU..","torrent":{"xt":"urn:btih:b8f6ca4490c1ef32df5dcff9a96649abf5fddf35","amp;dn":"Tirukkural+of+Tiruvalluvar+-+English+Translation%5BComplete%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f6ca4490c1ef32df5dcff9a96649abf5fddf35","infoHashBuffer":{"type":"Buffer","data":[184,246,202,68,144,193,239,50,223,93,207,249,169,102,73,171,245,253,223,53]},"announce":[],"urlList":[]}}