{"title":"Shellblast","uid":6912578,"size":22276267,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b977c89456e7eac5120c4b612d2ed746789d8057&amp;dn=Shellblast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"opaleg","files":2,"time":1324895927,"description":"Disarm bombs, and create your own.. Several types and unlimited replay value puzzler!\n\nThe commercial sequel to Acidbomb (voted 1up.com's Best 101 Free Games and Gamespy's &quot;Download This&quot; pick of December 2007) and Acidbomb 2: Rearmed delivers a unique mind-bending action puzzle experience. Described as a cross between Minesweeper and Picross, ShellBlast is a game that offers something most puzzle games out there lack: a unique experience.\n\nThe objective of ShellBlast is simple: using a series of tools, defuse the bomb before it blows up. Of course, the further you progress, the more advanced the bombs get...\n\nThis version is jam-packed with features never seen on both Acidbomb and Acidbomb 2: Rearmed. The full version includes the following:\n\nClassic Mode- Play the fifty-level campaign as you tour the world defusing bombs. From prank bombs to nuclear superweapons, this mode will give you the grand tour of what ShellBlast is all about.\n\nSimulation Chamber- Choose from eighteen empty bomb shells and fill it to your specifications. Want a massive Biological bomb with a short timer? Or a small Oxidation bomb with plenty of extra helper tools like Chaff Grenades? You got it!\n\nBlast Editor- Simulation Chamber too limiting for you? Build your own bomb from scratch using the editor or play custom levels built by others. Create the ultimate superweapon!\n\nEndurance Mode- Take on this massive bomb one layer at a time. How many quadrants can you unlock?\n\nShell-Drop- A unique randomly generated bomb mode that puts you to the ultimate test. Can you beat the top ranking bomb solvers? This mode is almost a game in itself!\n\nPuzzled- Take on the bomb from another angle...this time, using preset grids and an unlimited timer. Only true masterminds can solve the harder challenges...\n\nNuke- Team up with another agent working on the field to tackle one of the hardest bombs in the game!\n\nAlong with all these modes, ShellBlast carries a unique blend of gameplay, including always-randomized solutions to bombs in any mode (ensuring unlimited replay value!) \n\n\n===============================================================================\n\nJust install and play. If you want to buy this game just read the info file for more information. It's cheap and from a great indie developer.","torrent":{"xt":"urn:btih:b977c89456e7eac5120c4b612d2ed746789d8057","amp;dn":"Shellblast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b977c89456e7eac5120c4b612d2ed746789d8057","infoHashBuffer":{"type":"Buffer","data":[185,119,200,148,86,231,234,197,18,12,75,97,45,46,215,70,120,157,128,87]},"announce":[],"urlList":[]}}