{"title":"King Sunny Ade The Best Of The Classic Years","uid":6983206,"size":474258098,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:baf3a362f2a9021436b8336b58dc06c51956ab67&amp;dn=King+Sunny+Ade+The+Best+Of+The+Classic+Years&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"akasyliphone","files":-1,"time":1327482931,"description":"Shanchie 66034\n\nThis is a rare gem for fans of Nigerian juju music. The genres most enduring and prolific artist is revealed in his giddy youth, through tracks recorded with his band the African Beats between 1969 and 74, some ten years before American audiences got their first live taste of KSAs incomparable sound--and how sweet it is. The opener, &quot;Sunny Ti De,&quot; is an 18-minute extravaganza, actually five songs run together in the &quot;non-stop&quot; mode AdÃƒÂ© favored at that time. The groove is so relaxed, and so deep, that the interplay of guitars and drums seems to be taking place in an enchanted African dream space. Front and center are two, slow, dueling guitars, one reverb drenched and bluesy, the other crisp and jamming with chippy-chop counter riffs that clearly identify this instrument as Ades. In the easy way of old-time juju, we go nearly five minutes before there's any singing. But when AdÃƒÂ©s silky voice does emerge from the mix, the amazing thing is that he sounds just as he does today, a bona fide puer eternis!\n\nThe band, on the other hand, had something unique going back then, a special energy and freshness, a way of wielding an electric guitar that suggested it was the coolest damn thing that ever came along. The pedal steel guitar that would become so identified with Ades sound appears only on one track, the 18-minute original version of &quot;Synchro System,&quot; a track AdÃƒÂ© rerecorded for Island Records in the mid-1980s. This too is a masterpiece, shifting from one slow, sly groove to the next with serpentine poise and cool. These two tracks are as thrilling as anything on any of AdÃƒÂ©s many releases.\n\nThe remaining four tracks here suffer from murkier mixes, and occasionally an out-of-tune guitar, but the grooves, the band energy, and the arranging are consistently inspirational. 1999 saw the Nigerian MasterDisc releases of five CD volumes from AdÃƒÂ©s 1980s work, most of it never before available on the international market. These releases are worthwhile, but hit or miss. This new volume of earlier work is far more satisfying, the deepest view we've had yet, or are likely to get, into the origins of one of Africas greatest modern bands. Passionate and informative sleeve notes by Shanachies Randall Grass, who saw AdÃƒÂ© and the band play in Nigeria in 1974, are a plus. \n\n\nEAC log,cue,m3u and images","torrent":{"xt":"urn:btih:baf3a362f2a9021436b8336b58dc06c51956ab67","amp;dn":"King+Sunny+Ade+The+Best+Of+The+Classic+Years","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baf3a362f2a9021436b8336b58dc06c51956ab67","infoHashBuffer":{"type":"Buffer","data":[186,243,163,98,242,169,2,20,54,184,51,107,88,220,6,197,25,86,171,103]},"announce":[],"urlList":[]}}