{"title":"Thomas Campbell  The Monroe Institute Lecture","uid":6910290,"size":424370232,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bd1f5d11d52b40cdeea017fb12a4ef22c5c8c468&amp;dn=Thomas+Campbell++The+Monroe+Institute+Lecture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"mtvawards","files":12,"time":1324767241,"description":" &lt;a href=&quot;http://www.mybigtoe.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.mybigtoe.com&lt;/a&gt; http://www.monroeinstitute.org\nPhysicist and author Thomas Campbell giving a keynote speech at the Monroe Institute's 22nd Professional Seminar.\n\nCampbell was one of the original consciousness explorers at The Monroe Institute (TMI) in Virginia in the 1970s and the explorer identified as &quot;TC Physicist&quot; in Bob Monroe's book Far Journeys. Campbell, working alongside electrical engineer Dennis Mennerich, discovered what is now known as Hemi-Sync, the binaural-beat approach to inner exploration that came to be almost synonymous with TMI.\n\nAs Bob Monroe's protÃƒÂ©gÃƒÂ©, Campbell worked in the TMI lab and participated in explorer sessions as a subject. He was one of the first trainers and finished his tenure at TMI as an advisory-board member.\n\nUsing his mastery of the out-of-body experience as a springboard, he dedicated his research to discovering the outer boundaries, inner workings, and causal dynamics of the larger reality system. In February of 2003, Campbell published the My Big TOE trilogy, which represents the results and conclusions of his scientific exploration of the nature of existence. This overarching model of reality, mind, and consciousness merges physics with metaphysics, explains the paranormal as well as the normal, places spirituality within a scientific context, and provides direction for those wishing to personally experience an expanded awareness of All That Is.\n\nMy Big TOE speaks to each individual reader about his or her innate capabilities. Readers will learn to appreciate that their human potential stretches far beyond the limitations of the physical universe. The acronym TOE is a standard term in the physics community that stands for Theory Of Everything and has been the Holy Grail of that community for fifty years. My Big TOE delivers the solution to that scientific quest at the laymans level with precision and clarity.","torrent":{"xt":"urn:btih:bd1f5d11d52b40cdeea017fb12a4ef22c5c8c468","amp;dn":"Thomas+Campbell++The+Monroe+Institute+Lecture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd1f5d11d52b40cdeea017fb12a4ef22c5c8c468","infoHashBuffer":{"type":"Buffer","data":[189,31,93,17,213,43,64,205,238,160,23,251,18,164,239,34,197,200,196,104]},"announce":[],"urlList":[]}}