{"title":"American Reunion. Official Movie Trailer [HD]","uid":6969861,"size":26297856,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:bd4983ba994e97852af026144696994121d393a0&amp;dn=American+Reunion.+Official+Movie+Trailer+%5BHD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"proffcom","files":-1,"time":1327056395,"description":"In theaters: April 6th, 2012\n\nSynopsis:\n\nIn the comedy American Reunion, all the American Pie characters we met a little more than a decade ago return to East Great Falls for their high-school reunion. In one long-overdue weekend, they will discover what has changed, who hasn't and that time and distance can't break the bonds of friendship. It was summer 1999 when four small-town Michigan boys began a quest to lose their virginity. In the years that have passed, Jim and Michelle married while Kevin and Vicky said goodbye. Oz and Heather grew apart, but Finch still longs for Stifler's mom. Now these lifelong friends have come home as adults to reminisce about--and get inspired by--the hormonal teens who launched a comedy legend. In the comedy American Reunion, all the American Pie characters we met a little more than a decade ago return to East Great Falls for their high-school reunion. In one long-overdue weekend, they will discover what has changed, who hasn't and that time and distance can't break the bonds of friendship. It was summer 1999 when four small-town Michigan boys began a quest to lose their virginity. In the years that have passed, Jim and Michelle married while Kevin and Vicky said goodbye. Oz and Heather grew apart, but Finch still longs for Stifler's mom. Now these lifelong friends have come home as adults to reminisce about--and get inspired by--the hormonal teens who launched a comedy legend. \n\nGenre: Comedy\n\nDirector: Jon Hurwitz, Hayden Schlossberg\n\nCast: Jason Biggs, Alyson Hannigan, Chris Klein, Thomas Ian Nicholas, Tara Reid, Seann William Scott, Mena Suvari, Eddie Kaye Thomas, Jennifer Coolidge, Eugene Levy, Natasha Lyonne, Shannon Elizabeth\n\nWriters: \n\n\n___________________________________________________________\n\nVideo: Xvid 848x360 23.98fps\n\nAudio: MPEG Audio Layer 3 44100Hz stereo 320kbps\n___________________________________________________________","torrent":{"xt":"urn:btih:bd4983ba994e97852af026144696994121d393a0","amp;dn":"American+Reunion.+Official+Movie+Trailer+%5BHD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd4983ba994e97852af026144696994121d393a0","infoHashBuffer":{"type":"Buffer","data":[189,73,131,186,153,78,151,133,42,240,38,20,70,150,153,65,33,211,147,160]},"announce":[],"urlList":[]}}