{"title":"That's What I Call Sweet Music: American Dance Orchestras of th","uid":6912291,"size":181022729,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bddec3022d4c48790cfa49f37287ca8140d3e2a9&amp;dn=That%5C%27s+What+I+Call+Sweet+Music%3A+American+Dance+Orchestras+of+th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":24,"time":1324880512,"description":"&quot;That's What I Call Sweet Music: American Dance Orchestras of the 1920s&quot; Selected for this collection by cartoonist and string-band musician R. Crumb, from his 78 rpm record collection. He supplied charming artwork for the booklet included with this CD, but only the cover is included here.\n\nMP3 (320k)\n\n1 That's What I Call Sweet Music - Paul Specht and His Orchestra\n2 Make My Cot Where The Cot-Cot-Cotton Grows - Red Nichols' Stompers\n3 Be My Baby - Blue Steele and His Orchestra\n4 I'm The Last Of The Red Hot Mamas - Herman Kenin and His Ambassador Hotel Orchestra\n5 My Honey's Lovin' Arms - Ray Miller and His Orchestra\n6 'Leven-Thirty Saturday Night - Fess Williams and His Royal Flush Orchestra\n7 I'm Bringing A Red, Red Rose - George Olsen and His Music\n8 Do Something - McKinney's Cotton Pickers\n9 Wedding Bells - Fred Rich and His Orchestra\n10 St. Louis Blues - Leroy Smith and His Orchestra\n11 Sing Song Girl - Leroy Shield and the Victor Hollywood Orchestra\n12 Sweet Ella May - Earl Hines and His Orchestra\n13 The One That I Love Loves Me - Rudy Vallee and His Connecticut Yankees\n14 Aristocratic Stomp - Paul Tremaine and His Aristocrats\n15 Buy, Buy For Baby - Ben Pollack and His Park Central Orchestra\n16 Hum And Strum - 'Doc' Cook and His 14 Doctors of Syncopation\n17 Give Your Little Baby Lots Of Lovin' - Anson Weeks and His Hotel Mark Hopkins Orchestra\n18 That's What Puts the Sweet In Home Sweet Home - Jean Goldkette and His Orchestra\n19 Singin' in the Rain - Gus Arnheim and His Orchestra\n20 The Pay Off - California Ramblers\n21 My Little Old Home Down In New Orleans - Tal Henry and His Orchestra\n22 Oh, You Have No Idea! - Paul Whiteman and His Orchestra\n23 She's A Great, Great Girl - Hal Kemp and His Orchestra\n24 Happy Days and Lonely Nights - Charlie Fry and His Million Dollar Pier Orchestra","torrent":{"xt":"urn:btih:bddec3022d4c48790cfa49f37287ca8140d3e2a9","amp;dn":"That%5C%27s+What+I+Call+Sweet+Music%3A+American+Dance+Orchestras+of+th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bddec3022d4c48790cfa49f37287ca8140d3e2a9","infoHashBuffer":{"type":"Buffer","data":[189,222,195,2,45,76,72,121,12,250,73,243,114,135,202,129,64,211,226,169]},"announce":[],"urlList":[]}}