{"title":"Sintel (2010)DVD5 nl subs NLT-Release","uid":6890242,"size":785666923,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c0da62bdfdb9ea44b2fab15b281e33ff72d4b4e7&amp;dn=Sintel+%282010%29DVD5+nl+subs+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":14,"time":1323984195,"description":"Sintel (2011)DVD5 nl subs NLT-Release\n\n\nVerenigde Staten\nAnimatie/Fantasy\n14 minuten\n\n\nDirector: Colin Levy\nWriters: Martin Lodewijk\n\nDe film volgt een meisje genaamd Sintel die zoekt naar een babydraak die ze Scales noemt.\nEen flashback onthult dat Sintel Scales vindt met een gewonde vleugel en helpt ervoor te zorgen.\nDat brengt een hechte band teweeg.\nSintel begint daarna aan een tocht om Sclaes te redden, weert onderweg beesten en krijgers af.\nUiteindelijk komt ze bij een grotwoning waar een volwassen en eenbabydraak woont. Ze denkt dat dit Scales is.\nDe volwassen draak ontdekt Sintel en valt aan, maar aarzelt om haar te doden.\nSintel verslaat de draak, herkent het litteken op zijn vleugel en realiseert zich dat de draak\neen volwassen Scales is, en dat ook zij volwassen is geworden.\nSintel verlaat de grot, haar hart is gebroken. Onwetend dat Scale's baby haar volgt.\n\n\nSintel, the Durian Open Movie Project \n\nDirector: Colin Levy\n \nWriter: Esther Wouda\n \nGenres:Animation | Short | Fantasy \n\nCountry:Netherlands \n\nLanguage:English \n\nFan van actie, avontuur, spanning en fantasie? Dan hebben we goed nieuws, want enkele dagen na de premiÃƒÂ¨re op het Nederlands Film Festival is hij er eindelijk: Sintel, de nieuwe kortfilm van het Amsterdamse Blender Institute.\n Precies vier maanden nadat we de epische trailer voor Sintel plaatsten, staat het volledige avontuur online. Ook achter de schermen was het vast een heel avontuur, want een internationaal team van maar liefst veertien 3D-animators en -kunstenaars werkte een jaar lang aan de korte film. Daarvoor maakten ze gebruik van de nieuwste versie van het open-sourceprogramma Blender.\n \nDe Rotterdamse striptekenaar Martin Lodewijk (bekend van Storm en Agent 327) bedacht het concept voor het fantasievolle verhaal, dat later werd uitgewerkt door scriptschrijver Esther Wouda.\n \nSintel (een Nederlands woord voor een stukje steenkool) draait rond de vriendschap tussen een heldhaftige meid en een eenzaam draakje.\n \nOprichter van het Blender Institute en producent Ton Roosendaal ? die als een van de weinige aan alle filmpjes meewerkte ? kan weer opgelucht ademhalen. Zijn laatste Blenderbaby is namelijk een knap filmpje geworden dat de lat voor volgende producties weer een stuk hoger legt.\n \nZowel inhoudelijk als visueel is Sintel een meer dan waardige opvolger van Elephant?s Dream (2006) en Big Buck Bunny (2008). Dat kwam door het veel grotere budget (400.000 euro) dat de makers dit jaar ter beschikking hadden. Ruim een vierde daarvan kwam van het Nederlands Fonds voor de Film, de rest werd bij elkaar gesprokkeld via sponsors, bedrijven en fans die de dvd met vele extra?s op voorhand konden bestellen.\n \nHet produceren van Sintel heeft in totaal vier ton gekost en is het werk van veertien animators uit diverse landen. Sintel kreeg een subsidie van 125.000 euro van het Nederlands Fond voor de Film, terwijl ook fans en bedrijven geld konden geven. Een van de hoofdsponsors was DivX; de firma doneerde 40.000 euro.\n \n================================================================================\n\nMovie..............: Sintel (2010) \nGenre..............: Animatie/Fantasy\nSource.............: Sintel 2010 1080p DM x264-EbP\nFormat.............: DVDR\nRuntime............: 14 min.\nMenu...............: Nope\nVideo..............: UNTOUCHED\nAudio..............: English DD 5.1\nSubtitles.NL.......: Vertaald door Aegis, Thanx great job !!\nControle...........: Suurtje\nBewerking+Resync...: Suurtje, Thanx m8innetje :)\n\n\n\n================================================================================\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1727587/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1727587/&lt;/a&gt;\n\nStoryline\n\nThe film follows a girl named Sintel who is searching for a baby dragon she calls Scales. A flashback reveals that Sintel found Scales with its wing injured and helped care for it, forming a close bond with it. By the time its wing recovered and it was able to fly, Scales was caught by an adult dragon. Sintel has since embarked on a quest to rescue Scales, fending off beasts and warriors along the way. She eventually comes across a cave housing an adult and baby dragon, the latter of which she believes to be Scales. The adult dragon discovers and attacks Sintel, but hesitates to kill her. Sintel slays the dragon, only to recognize the scar on its wing and realize the dragon is an adult Scales, and that she too has aged considerably. Sintel leaves the cave heartbroken, unknowingly followed by Scales's baby.\n \n\nHashcode:\nC0DA62BDFDB9EA44B2FAB15B281E33FF72D4B4E7\n\nNLT-RELEASE IS TERUG KOM SNEL NAAR DE SITE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:c0da62bdfdb9ea44b2fab15b281e33ff72d4b4e7","amp;dn":"Sintel+%282010%29DVD5+nl+subs+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0da62bdfdb9ea44b2fab15b281e33ff72d4b4e7","infoHashBuffer":{"type":"Buffer","data":[192,218,98,189,253,185,234,68,178,250,177,91,40,30,51,255,114,212,180,231]},"announce":[],"urlList":[]}}