{"title":"POtHS - Wars &amp; Rumors of Wars - 2 - Beyond Treason","uid":6901358,"size":3799567835,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c23bcc320c27d18a36da6afd2ef9b535dd11ecfe&amp;dn=POtHS+-+Wars+%26amp%3B+Rumors+of+Wars+-+2+-+Beyond+Treason&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":78,"time":1324404322,"description":"\n\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Wars &amp; Rumors of Wars - 2 - Beyond Treason\n\n\n \n\n\nPOtHS - Wars &amp; Rumors of Wars - 2 - Beyond Treason\n\n\n\nPOtHS Comments on This one:     We set here on our fat asses and watch them steal America right out from under fried food smelling noses. These are special people and they granted amnesty under lucifer's Earth Dweller Legal System of Payola. I hate this conspiracy facts truth, it makes feel like I need to take a shower. All these punks should be tried for Treason.\n\n\nDescription:\n\n\n\nBeyond Treason\n\nWhat you don't know about your government could kill you...\nDepartment of Defense documents obtained through the Freedom of Information Act expose the horrific underworld of the disposable army mentality and the government funded experimentation upon US citizens conducted without their knowledge or consent.\n\nUNMASKING SECRET MILITARY PROJECTS:\nChemical &amp; Biological Exposures\nRadioactive Poisoning\nMind Control Projects\nExperimental Vaccines\nGulf War Illness\nDepleted Uranium (DU)\n\nIs the United States knowingly using a dangerous battlefield weapon banned by the United Nations because of its long-term effects on the local inhabitants and the environment?  Explore the illegal worldwide sale and use of one of the deadliest weapons ever invented.\n\nBeyond the disclosure of black-ops projects spanning the past 6 decades, Beyond Treason also addresses the complex subject of Gulf War Illness.  It includes interviews with experts, both civilian and military, who say that the government is hiding the truth from the public and they can prove it.\n\n\nFeaturing: Doug Rokke, Dennis Kyne, Leuren Moret,\nBob Jones, Joyce Riley, Mark Zeller, &amp; Dan Topolski\n\nProduced &amp; Written by\nJoyce Riley\n\nNarrated by\nJoyce Riley\n\nDirected by\nWilliam Lewis\n\nTOTAL RUNNING TIME\nWITH BONUS MATERIAL: 100 MINUTES\n\n\nReviews:\nExtraordinary Movie &amp; Video Guide -\nWilliam Lewis, the director of 911 in Plane Site is after the U.S. government with his latest film Beyond Treason.  Beyond Treason focuses into the aftermath of first Gulf war and the fact that American soldiers have been suffering 15 years of post-traumatic stress disorder. Because this explanation doesn't cover all the symptoms that soldiers have had, U.S. Department of Defense's says it's a &quot;mystery disease&quot;. The main theme of Beyond Treason is to show what really happened in the Middle-East in early 90's and how the soldiers were exposed to depleted uranium. And like if that hadn't been enough, the same soldiers got untested vaccines. Beyond Treason is a patriotic and critical documentary, that doesn't play guessing games but hits the viewer with cold, hard facts.\n\nBesides the theme of Beyond Treason, it tells also the background of dark history of U.S. governments human experiences. Secret documents of this fact has been exposed to public lately. Projects like MKultra and Whitecoat get covered in Beyond Treason - and remember, they are not conspiracy theories but real stuff. Lewis and Riley (spokesperson of American Gulf War Veterans Association) have collected an enormous amount of evidence.\n\nFormer Air Force Capt. Turned Activist Says Pentagon's Actions Towards Depleted Uranium Use 'Beyond Treason' - Greg Szymanski -\nPopular activist-broadcaster, Joyce Riley, hits government 'right between the eyes' with powerful new documentary exposing cover-up of depleted uranium illnesses, leaving Gulf War troops sick and dying.\n\nBeyond Treason - Tom Cahill -\nEvery American should be forced to see &quot;Beyond Treason&quot; as German civilians were forced by order of then Gen. Eisenhower to visit the Nazi death camps immediately after liberation in 1945. Justice would be further served if the Americans responsible for the use of uranium munitions were tried for war crimes in Nurenberg, Germany. This should include former commanders-in-chief George H. W. Bush and William Clinton.\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe That The Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...\n\nMay Yahweh Bless You as He has me. Seed Long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the tRUtH.    \n\n\nGet info on the Take Over by The New World Order Below\n\n\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                         Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                                End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.hickoryhammockbaptist.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hickoryhammockbaptist.org&lt;/a&gt;                                                                Pastueur Carl Gallops\n                                                                                       Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.overcomers.ca&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.overcomers.ca&lt;/a&gt;                                                                                     Current Bible Prophecy &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                    Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                               Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                          Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                        Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;       Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n           \n      (thankyou) :thankyou:    (thankyou) :thankyou:     Thank You JESUS    \n\n\n\n\n \n\n\n\n\n\n \n      ","torrent":{"xt":"urn:btih:c23bcc320c27d18a36da6afd2ef9b535dd11ecfe","amp;dn":"POtHS+-+Wars+%26amp%3B+Rumors+of+Wars+-+2+-+Beyond+Treason","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c23bcc320c27d18a36da6afd2ef9b535dd11ecfe","infoHashBuffer":{"type":"Buffer","data":[194,59,204,50,12,39,209,138,54,218,106,253,46,249,181,53,221,17,236,254]},"announce":[],"urlList":[]}}