{"title":"Ally McBeal / Ally My Lady Love /Season-3 /Disc-3 /NLtoppar=R+C","uid":6991112,"size":4680056832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4e554b05facd9cdb0b6095cbfb138d4e2792151&amp;dn=Ally+McBeal+%2F+Ally+My+Lady+Love+%2FSeason-3+%2FDisc-3+%2FNLtoppar%3DR%2BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLtoppar","files":-1,"time":1327705980,"description":"Klein voorwoordje:\n------------------\n\nVoor het eerst hier op den GRAAI BAAI Ally McBeal aka-47 My love lady \nlove in DVD-r/+R kwaliteit (aan jou de keuze) verkrijgbaar in de gebekte talen \nEng/Fra/Ned (zie mijn RetailCorrect Hmmulti+_+ relaasjes) \n\n\nIn de van de wcpot gerukte TV-reeks met als NLTOP ingredienten 15kg \nkomedie en 1,456 kgram drama beleef je momenten waarbij je geheid bij deze NLtopper een paar traantjes van verdriet of een enkele liters pis van joleit moet \nwegpinken mijn beste neerlandertjes en uplandertjes.\n\nDeze hondsdolle freudiaanse televisie-reeks schetst een tv-beeld van \nadvocaten en advocates alsook kleine advocaatjes terug die werkelijk maar dan ook \ndaadwerkelijk als eensgezind pseudo-preutse-freudse gezin in samenhorigheid leven onder of bovenop elkaar ten huize &amp; advocatenkantoor Fish &amp; cage het asylum van boston ergens in de V.S.V.A (lees verder waarom).\n\n\nZo heb je bijvoorbeeld raadsvrouw -Ally McBeal- (My lady love) een \ngepassioneerde geovuurleerde carrierevrouw die eens per aflevering een \nverschijning krijgt van een sprookjes ÃƒÂ©ÃƒÂ©nhoorn haar grote voorliefde dewelke \nhaar ook evenzeer een tikkie gemoedsrust schenkt in tijde van economische crisis.\n\nRaadsvrouw Ally kampt dan wel met een verschrikkelijke mannen probleem ! \n\n \nVrouwe ally lijkt er maar niet in te slagen om een man/vrouw te strikken \nen gevangen te houden.\n\nGelukkig heeft ze thuis een opblaasbare latexen of siliconen pop (manleik uiteraard), die met grote regelmaat bij haar slaapt en nooit de benen \nkan of zal nemen in zijn arm bestaan om vrouwe ally voorgoed vaarwel te \nzeggen tot grote vreugde van raadsvrouw ally .\n\nNaja, aan dit latexen mannenprobleem hangt een stevig prijskaartje.\n\nDe priizige frustratie zit vaak zo torenhoog dat het de raadsvrouw ally \nstillaan allemaal een tikkie boven het hoofd begin te groeien!  \n\nMet als gevolg dat dit streskipje vaak zonder enige moeite wat graag \ndagdroomt over vroleikij snoezige 3D computer geanimeerde dansende pasgeborenen om \ndie frustratie en/of stress het hoofdje te bieden .  \n\n\nTot dus zo ver de perikelen van de veel te vaak vrijgezelige gezellin &amp;\nraadsvrouw ally McBeal.\n\n\n\n\nDan heb je Raadsman -Dhr.Richard Fish-en eveneens ook Zaakvoerder/oprichter van \nhet advocaatjeskantoor Fish &amp; cage (Vis &amp; kooi NL).\n\nEn weet je.. \nof je weet het helemaal niet.  Maar ik zou zweren dat hij een zwak heeft voor kwabbetjes.\n\nJawel zeer zeker je leest dit RetailCorrect... verleidende, hypnotiserende \nKWABBETJES !!\n\nNaja, wat zijn hypno kwabbetjes nu pijnig je je hersentjes vast mee.\n\nWelnu kwabbetjes mijn beste neerlandertjes &amp; uplandertjes kan een \nophoping zijn van cellulitis ter hoogte van de hals streek of de onderkin van een man en/of vrouw dat fungeert en de aantrekkingskracht heeft van jampudding.\n\nHere R.vis gaat dus dan ook HELEMAAL over de rooie en overstag wanneer \nhij een onbedwingbaar oerinstinktieve wellustige beesteleike dwang krijgt om er \n\nboven op te springe als ie maar zelfs een glimp opvangt van een portie heerlijke \ndubbel geribbelde vetkwabbetjes onderaan de kin van een vrouw soms ook man.\n\nDat niet alleen welnEEn, Dhr en raadsmaan Richard Vis beperkt zich niet \nalleen tot het toe eigenen van 1 of 2 vetrolmopjes per aflevering welnEEn.. \n\nDe raadsman heeft nameleik ook een neus voor glimmende muiltjes met \naromatische voetgeurtjes.. jawel. \n \nSchoeioeisel met of zonder hakken, rechts of links, enkel of in paartjes \n... \nRichard.F BESNUFFELT EENDER WELK EXEMPLAARTJE O_O\n\nDesondanks zijn ietwat onorthodoxe fish-isme, is hij in hoogst eigen \npersona wel een goedzak hoor, enorm vergevingsgezind en respectvol van \ngeaardheid. \n\nrespectvol &amp; Vergevensgezind in die zin, dat hij eender welke situatie \ndan ook (hoe somber ook) relativeerd met 2 engelse woordjes, nameleik &quot;BYE-GONES&quot;.   \n\nEng&gt;nl Letterlijk vertaald betekent het zo eventjes: Zand erover, water \nonder de brug of vergeet het gewoon wil je.\n \nMeer bepaald, op dat beklijvend moment wanneer raadsman vis deze magische \nwoorden uitspreekt word het onderwerp in kwestie zondermeer ontvankelijk \nverklaart en gaat men terug over tot de orde van die bewuste dag.\n\nTot dus zover de korte voorstelling van de persona Richard Vis.\n\n\n\n\nEn dan is er ook nog Raadsman &amp; zen meester -Johny Cage- \n\nWaar zal ik beginne ?\n\nNou, late we beginne bij het begin...zullen we!?\n\n\nIn der beginnen was er Johny Cage, Bijnaam of veeleer codenaam  &quot;het koekje&quot; (lees verder waarom), Dat klinkt zeer zeker als een lekker knapperige stukje troost overpeins je vast, maar niets is wat het lijkt. \n\nHij is meestal een akelig stille persona jawel.. doch mond dodelijk komt hij uit de bokshoek wanneer de gelegenheid zich aanbied!\n\nHet broekje is de links en rechterhand van Raadsman stichter Richard Vis \nen dus eveneens Co oprichter van de firm/firma Fish &amp; Cage (vis &amp; kooi nl).\n\nRaadsman Dhr.cage (codenaam &quot;het koekje&quot; niet te verwarren met broekje), \nis een gevreesd en een geduchte tegenstander in de hoogste advocaten kringen \nvan alle wind streken uit heel boston !!  \nZowel noord, noord-oost, oost, oost-zuid, zuid, zuid-west en tot slot \nwest thuis best van boston en omstreken.\n\nZo laad hij op regelmatige basis zijn wapens op in een dans ritueel \n\nwaarbij hij zich moed in de schoenen danst op muziek van zijn fantasierijke en \ntegelijk zijn beste dans partner Barry wit in de unisex WC net voor een \nbelangrijk afspraak met rechter, jury en beul tegelijk waartegen hij het VS opneemt in een wel bepaalende lopende rechtzaak diewelke hij overigens vlekkeloos \nbespeelt en beheerst op muziek aanslagen uit zijn trompetneus.\n\nSterker nog, bovendien weten alle maar dan ook alle allemaal zijn \n\ncollega's van zijn dans ritueel die dan op hun beurtje allen alle allemaal vaak \nspontaan met de heupen mee beginnen te swingen als cage (kooi NL) het koekje het weer eens op zijn heupjes krijgt.\n\nWaarop here en raadsman kooi oppeens onaangenaam word verrast en de dans \naktabrupt beeindigd met een explosie van neuriÃƒÂ«n zoals .. \n\n                     ****  Die-die-dada-toedeloe ... POEP .. potemski .. *** !\n\n\nNu is het wel zo mijn beste neerlandertjes en oplandertjes dat hij heus \nniet de aller gekste is in zijn soort juist en omwille van enkele \nverspreekwoordeleike woordjes zoals \n                     ** Diedie- dada-toedeloe ... POEP ... potemski ** \n\n...wel neen hoor, zo gek kan je het niet bedenken.\n\nIntegendeel...\n\nZo was raadsman cage (kooi nl) eens of meerdere keren per aflevering een \nsurogaat vader &amp; moeder (shemale / hijzij) en had de ouderlijke taak om \nover het lot van zijn geliefde pad Stephan (driftkikker nl) te waken.\n\nOnze lieve here hebbe zijn kikker zieltje (bekijk de serie voor meer details hieromtrent!).\n\nOok had raadsman johny kooi een wc met afstandelijke bediening dat met 1 \nmuisklik altijd zorg droeg voor een kraaknette en reine wckom desondanks \nde afstandstandelijkheid.\n\nMaar deze koosjere bediening bracht soms tot heel vaak een hoge \nprijskaartje met zich mee...!!  \n\nOpnieuw, bekijk de afleveringen voor de spannende en hachelijke climax \nrond de wckom.\n\n\nZo kan ik nog lang en zalig verder pennen over de veelbesproken \nexcentrieke raadsman -johny cage- en consoorten ..\n\n\nMaar, dit zijn slechts een paar voorbeeldige voorbeeldjes die in mijn \nprompt ROM geheugenbankje zijn opgeslagen van alweer een prachtige TV-reeks \ngebracht door niemand minder dan NLtoppappa in hoogst eigen persona die je immers \nnooit of te nimmer mag noch zal vergeten tot in het uur van je dood amen.\n\n\n\n\n\n\n\n\n\nINFO RELEASE (Eng):  Ally McBeal / a.k.a-47 My Lady Love (1997 - 2002)\n\nINFO RELAASJE (NL):  Ally McBeal / ook beter bekend als: \n                                   Mein lief klein vrouwtje (1997 - 2002)\n\n\n\nEPISODE INDEX DISC-3\n====================\n\n1. Out In The Cold\n\n2. Just Friends\n\n3. Over The Rainbow\n\n\n\n\n\n\n\nSOURCE/BRON---------------: RETAIL/ORIGINEEL DVD-9 - PAL\n\nRetailCorrect MENU--------: Yihaaaw\n\nRetailCorrect EXTRA'S-----: Oh nose\n\nRetailCorrect COVER/HOESJE: Oh nose\n\n\n\n\n******************************\nRetailCorrect AUDIO/GELUID: \n******************************\nEnglish DD5.1 \n\n\n************************************************************\nRetailCorrect SUBTITLES/ONDERTITELS (Retail/Origineel DVD):\n************************************************************\n\nDutch (Nederlands), French, English (for the hearing impaired / voor doofstomme \n\nmensjes) \n\n\n\n\n\nBrought to you by yours truly *NLtoppar*\n\n\n********************************************************\nWees zo vrij om verzoekjes te plaatsen (met daaraan gekoppeld de vereiste film \nticket of ook beter bekend als hieperlinkje aub) van ALLEEN originele winkel dvd \nuitgave wel te verstaan. \n\nOok... volg de pijltjes/tags en muisklik *RetailCorrect* \nom te bladeren door mijn film catalogus.\n********************************************************\n\n*******************************************************************\nFeel free to post request from Original Retail DVD releases ONLY.\n\nAlso, mouseclick the tag RetailCorrect to browse my movie database\n*******************************************************************\n\n\nAnd Remember .... \n\n\n\nTo Care = To Share &amp; To Share = To Seed &amp; To Seed = to Lead ;)\n\n\n\n\nN L:             &amp;          E N G:\n\nAlstublieft                 Please\n\n&amp;                           &amp;\n\nGraag Geplaatst             Gladly Posted\n","torrent":{"xt":"urn:btih:c4e554b05facd9cdb0b6095cbfb138d4e2792151","amp;dn":"Ally+McBeal+%2F+Ally+My+Lady+Love+%2FSeason-3+%2FDisc-3+%2FNLtoppar%3DR%2BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4e554b05facd9cdb0b6095cbfb138d4e2792151","infoHashBuffer":{"type":"Buffer","data":[196,229,84,176,95,172,217,205,176,182,9,92,191,177,56,212,226,121,33,81]},"announce":[],"urlList":[]}}