{"title":"Free NFS Screensavers Manager","uid":6972279,"size":20077312,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c7c458014470eed1fe68a0bb2cb7d7898b47d008&amp;dn=Free+NFS+Screensavers+Manager&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"similikity","files":-1,"time":1327126758,"description":"Free NFS Screensavers Manager\n &lt;a href=&quot;\nhttp://bayimg.com/hAmANAAdb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/hAmANAAdb&lt;/a&gt;\n\nAvailable languages: English\nSupported OS: Windows XP/Vista/7\n\nDescription: Manage multiple screensavers downloaded at a computer.\nMain options: It is possible to select a screensaver from the list of all installed screensavers, to preview it and adjust settings of it.\nOrder settings: The manager allows to show screensavers in sequential, random, reverse and alphabetic order.\nTime settings: It is possible to select the following time settings:\nshow screensavers for infinite time, change once a day, change each run, change every N minutes.\n\nFree NFS Screensavers Manager contains no spyware or adware. It's clearly free and absolutely safe to install and run.\n\nFeatures:\nOne window, featuring all possible options and a playlist. No need in switching between windows.\nPlaylist. In front of each name of a screensaver there are two buttons : Settings and Preview of an exact screensaver.\nButtons All, NFS only, Playlist allow to show All installed screensavers, only NFS (by NewFreeScreensavers.com) and scrensavers included into a Playlist.\nImproved search option, which allows to search for a screensaver in a playlist.\nTooltips help Screensavers manager users to work with the program.\nHot-keys. By clicking the Help button, a list of hot-keys will appear.\nSample screensavers. NFS Screensavers Manager contains three screensavers created by Newfreescreensavers.com as samle screensavers. These screensavers can be deleted (To learn How to delete a screensaver\n\nHow to Delete a screensaver :\n- Click the Windows \\&quot;Start\\&quot; button and click the \\&quot;Control Panel.\\&quot;\n- Click on \\&quot;Programs\\&quot; in the Control Panel and then click on \\&quot;Programs and Features.\\&quot; You will see a list of screensavers installed on your computer.\n- Scroll through and click the screensaver you want to delete. Click \\&quot;Uninstall\\&quot; to remove it from your computer. \nNote that the screensavers that come with Windows, however, can\\'t be removed.\n\nPlease Seed\nEnjoy it !\n","torrent":{"xt":"urn:btih:c7c458014470eed1fe68a0bb2cb7d7898b47d008","amp;dn":"Free+NFS+Screensavers+Manager","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c458014470eed1fe68a0bb2cb7d7898b47d008","infoHashBuffer":{"type":"Buffer","data":[199,196,88,1,68,112,238,209,254,104,160,187,44,183,215,137,139,71,208,8]},"announce":[],"urlList":[]}}