{"title":"The Bible Series - David Jeremiah - Part 2 - 48 Sessions","uid":15899576,"size":5968223601,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8c92b4719388a5b1181341782cd475ecb0751ab&amp;dn=The+Bible+Series+-+David+Jeremiah+-+Part+2+-+48+Sessions&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":48,"time":1474993590,"description":"The Bible Series - David Jeremiah - Part 2 - 48 Sessions - These are the End Times\r\n\r\nBiography[edit]\r\nJeremiah was born in Toledo, Ohio in 1941 to Ruby Jeremiah and James T. Jeremiah, a Baptist pastor and former president of Cedarville University.[1]\r\n\r\nJeremiah earned a bachelor's degree from Cedarville University (1963) and a master's degree from Dallas Theological Seminary (1967). Cedarville presented him with an honorary Doctor of Divinity degree in 1981.[2]\r\n\r\nJeremiah succeeded Tim LaHaye as Shadow Mountain Community Church's senior pastor in 1981. Jeremiah's leadership of the church has led it to become affiliated with the Southern Baptist Convention.\r\n\r\nIn 1982, Jeremiah founded Turning Point Ministries which focuses on multi-media Bible instruction. Its flagship program is Turning Point, a half-hour radio program that airs Jeremiah's sermons. Turning Point can be heard worldwide on more than 2000 stations, as well as online. Jeremiah has won awards over the years through the Turning Point program, such as the 2006 National Religious Broadcasters award for Best Radio Teaching Program.[3] Turning Point Ministries also developed a national television program in 2000. The television program features a 30-minute Bibles study followed by an hour of preaching and worship music.\r\n\r\nIn addition to being a pastor and leading Turning Point Ministries, Jeremiah is the author of numerous books on Christian theology and morality. Prayer – The Great Adventure won the 1998 Gold Medallion Award for Best Christian Living Book[4] and My Heart's Desire won the 2003 Gold Medallion Award for Best Inspirational Book[5]\r\n\r\nIn 1994 and again in 1998, Jeremiah was diagnosed with lymphoma. In 1999, a nodule was surgically removed from his neck and he underwent stem cell transplant therapy.[6]\r\n\r\nJeremiah's son, Daniel, is a former NFL scout, and is currently an analyst with the NFL Network. [7][8]","torrent":{"xt":"urn:btih:c8c92b4719388a5b1181341782cd475ecb0751ab","amp;dn":"The+Bible+Series+-+David+Jeremiah+-+Part+2+-+48+Sessions","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c92b4719388a5b1181341782cd475ecb0751ab","infoHashBuffer":{"type":"Buffer","data":[200,201,43,71,25,56,138,91,17,129,52,23,130,205,71,94,203,7,81,171]},"announce":[],"urlList":[]}}