{"title":"DwellClick v. 2.1 [K]racked","uid":6991849,"size":2312769,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c90e31de98ea3f244b5978f54525e666a233fb24&amp;dn=DwellClick+v.+2.1+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"polisdavid","files":-1,"time":1327736187,"description":"Official Web Site: &lt;a href=&quot; http://dwellclick.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://dwellclick.com/&lt;/a&gt;\n\nDwellClick is an app that clicks the mouse for you, and lets you give your fingers a rest!\n\n* Click and drag with mouse movements only. No clicking required!\n\n* Save thousands of clicks per day. No more tired and sore hands.\n\n* Drag and resize windows so easily it's like magic!\n\n* Works great with any trackpad or mouse.\n\nIt's a whole new way to use your Mac. You do the pointing, and DwellClick takes care of the clicks. And with the unique Auto Drag feature, dragging the mouse is effortless too.\n\nDwellClick lets you adopt a totally relaxed posture and use your Mac with mouse movements only. Once you discover a world without clicking, you will find you can use your Mac more enjoyably and with less effort. Work or play more efficiently and for longer, without tired and sore hands.\n\nYou can work faster, because your hands actually spend less time on the mouse or trackpad. Or just lean back and browse, and enjoy web surfing with minimal effort.\n\nDwellClick works seamlessly with Mac OS X and has multiple intelligent features which help it keep out of your way and do its job, while you do your job. It works great with multi-touch trackpads and the Magic Mouse too.\n\nWhat's New\n\n* Floating control panel. Added an on-screen control panel that allows\n  full use of DwellClick without needing to press the keyboard. This\n  improves DwellClick for users of head trackers and other hands free\n  input devices\n\n* Clickless switch-on. When DwellClick is off, you can turn it on by\n  hovering over the menu bar icon for 1 second.\n\n* The graphic symbol displayed above the mouse pointer showing the\n selected modifier next click is now more subtle, and can be turned off.\n\n* Added an option in prefs to turn off the one-tap modifier feature.\n\n* Removed the keyboard shortcut for Locked Drag. As an alternative,\n  press the shortcut for Drag twice.\n\n* The button panels now highlight in grey if your Mac is set to the\n  Graphite theme.\n\n* The layout of preferences is changed.\n\n* The DwellClick animation no longer appears in the corner of\n  screenshots taken with Command-Shift-4.\n\n* Fixed a bug where the keyboard shortcut for DwellClick On/Off\n  would interfere with the pop-up panel.\n\nSystem Requirements:\n\nIntel Mac OS X&gt;6 or greater\n\n--- PLEASE SEED ---\n","torrent":{"xt":"urn:btih:c90e31de98ea3f244b5978f54525e666a233fb24","amp;dn":"DwellClick+v.+2.1+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90e31de98ea3f244b5978f54525e666a233fb24","infoHashBuffer":{"type":"Buffer","data":[201,14,49,222,152,234,63,36,75,89,120,245,69,37,230,102,162,51,251,36]},"announce":[],"urlList":[]}}