{"title":"Trumped Up Clinton Sex Aid Scandal","uid":15819499,"size":686847556,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ca23d3b07be056dc7ca76eb98e0e7b62a5e6b929&amp;dn=Trumped+Up+Clinton+Sex+Aid+Scandal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"sarah.jensen","files":1,"time":1473741892,"description":"I have got no bloody money and all I want to do is get home 'cos I have got a hangover and you won't let me through the fucking gate. I swore at her. Fucking sexless four eyed little jobsworth hiding inside the bullet proof glass toll booth. I know why she has got that job, 'cos she is so fucking plain that no one is going to look after her and she needs a boring job just to survive. I hate girls like that. I fuck good looking tarts all the time, and this bitch in glasses won't let me onto the tollway 'cos I don't have any fucking cash. I know I don't. I just gave it to the last bird I fucked. Actually I did have some money left over, I just did not fancy reaching into my pocket. If you want some money you stupid little tit, come and do a video with me, I shouted at her through the glass. I bet you don't get a lot of sex do you. Eventually, with a two mile backlog of cars behind me, all sounding off their horns and swearing at me, I shoved a bank note through the slot in the glass. The toll gate still did not open. The thin lipped skinny toll officer lady gazed back at me with no expression, and said blandly, receipt. I snatched it back through the slot in the glass. In big biro letters on the back of the toll receipt was a phone number. The gate opened. Could I ever have been more wrong? See the video","torrent":{"xt":"urn:btih:ca23d3b07be056dc7ca76eb98e0e7b62a5e6b929","amp;dn":"Trumped+Up+Clinton+Sex+Aid+Scandal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca23d3b07be056dc7ca76eb98e0e7b62a5e6b929","infoHashBuffer":{"type":"Buffer","data":[202,35,211,176,123,224,86,220,124,167,110,185,142,14,123,98,165,230,185,41]},"announce":[],"urlList":[]}}