{"title":"The Haitian Revolution  - Bienna Bellow (video Lecture)","uid":6924024,"size":1845593184,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ca2aec27a99866898e717ea05951e3e9d432666d&amp;dn=The+Haitian+Revolution++-+Bienna+Bellow+%28video+Lecture%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kafiruwn","files":1,"time":1325384532,"description":"(Video/lecture)                  \n\n\n                  The Haitian Revolution  - Bienna Bellow      (format AVI)\n\nTypically historians date the beginnings of the Haitian Revolution with the uprising of the slaves on the night of August 21st 1791. While I've given reasons above to suspect that the revolution was already under way, the entry of the slaves into the struggle is certainly an historic event. And the event is so colorful that not even Hollywood would have to improve upon history. For several years the slaves had been deserting their plantations with increasing frequency. The numbers of maroons had swollen dramatically and all that was needed was some spark to ignite the pent up frustration, hatred and impulse toward independence.\n\nThis event was a Petwo Voudoom service. On the evening of August 14th Dutty Boukman, a houngan and practitioner of the Petwo Voodoo cult, held a service at Bois Caiman. A woman at the service was possessed by Ogoun, the Voodoo warrior spirit. She sacrificed a black pig, and speaking the voice of the spirit, named those who were to lead the slaves and maroons to revolt and seek a stark justice from their white oppressors. (Ironically, it was the whites and not the people of color who were the targets of the revolution, even though the people of color were often very harsh slave owners.)\n\nThe woman named Boukman, Jean-Francois, Biassou and Jeannot as the leaders of the uprising. It was some time later before Toussaint, Henry Christophe, Jean-Jacques Dessalines and Andre Rigaud took their places as the leading generals who brought The Haitian Revolution to its final triumph.\n\nWord spread rapidly of this historic and prophetic religious service and the maroons and slaves readied themselves for a major assault on the whites. This uprising which would not ever be turned back, began on the evening of August 21st. The whole northern plain surrounding Cape Francois was in flames. Plantation owners were murdered, their women raped and killed, children slaughtered and their bodies mounted on poles to lead the slaves. It was an incredibly savage outburst, yet it still fell short of the treatment the slaves had received, and would still continue to receive, from the white planters.","torrent":{"xt":"urn:btih:ca2aec27a99866898e717ea05951e3e9d432666d","amp;dn":"The+Haitian+Revolution++-+Bienna+Bellow+%28video+Lecture%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2aec27a99866898e717ea05951e3e9d432666d","infoHashBuffer":{"type":"Buffer","data":[202,42,236,39,169,152,102,137,142,113,126,160,89,81,227,233,212,50,102,109]},"announce":[],"urlList":[]}}