{"title":"Kindertijd 20 5 films op een dvd (Dutch) TBS","uid":6942441,"size":4019499232,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cb942daef6819337835cda3c2fce6b6b587211f5&amp;dn=Kindertijd+20+5+films+op+een+dvd+%28Dutch%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1326097509,"description":"Kindertijd 20 5 films op een dvd\n\n[img]http://img155.imageshack.us/img155/6541/020li.jpg[/img]\n\n\ndisc 20\nMadagascar\nMelody Time\nNijntje en Knorretje 15 filmpjes\nSaludos Amigos\nStuart Little 3\n\nMadagascar\nEen zebra uit de New Yorkse dierentuin wil naar het wild toe en ontsnapt uit de dierentuin. Zijn vrienden de leeuw, de giraffe en het nijlpaard gaan achter hem aan. Ze worden op een boot gezet, maar belanden na een ongeval in Madagascar. Helaas hebben deze New Yorkers geen flauw idee hoe ze in het wild moeten overleven.\n\nMelody Time\nOm de grote traditie van Disney's mooiste musicalklassiekers zoals 'Fantasia' brengt 'Melody Time' zeven klassieke verhalen, allemaal met vrolijke muziek en onvergetelijke personages!\nDonald Duck - een Disney favoriet van alle tijden - voert een aantal jazzy capriolen uit als de ster van &quot;Swingen op de samba&quot;. Muziek wordt een echt avontuur voor de bezige bij in &quot;Hommel-boogie&quot;. Van de ondeugende jonge sleepboot in &quot;Kleine Toet&quot; tot de helden van de legenden en mythen in &quot;Jantje Appelpit&quot; en &quot;Pecos Bill&quot; is dit een geestig en charmant feest voor ogen en oren.\n\nNijntje en Knorretje 15 filmpjes\n15 filmpjes van Nijntje ruim 5 min per filmpje dus volop plezier voor de kleintjes.\nDeze DVD bevat de volgende 15 afleveringen:... - de drie wensen van nijntje - nijntje op vakantie - de kleurige wereld van nijntje - de step van nijntje - nijntje glijdt uit - nijntje en knorretje slapen in 1 tent - het restaurant van nijntje - nijntje en de natuur - een verjaardagstaart voor vader pluis - nijntje maakt herfstcadeautjes - nijntje en de wind - nijntje komt te laat - nijntje maakt zich zorgen - nijntje helpt Knorretje - nijntje plant een zaadje\n\nSaludos Amigos\nDeze film bestaat uit vier verschillende delen. Deze beginnen allen met verschillende clips van de Disney tekenaars die schetsen maken van de tekende cultuur van de landen die zij aandoen.\nDe verschillende delen:\nIn Lake Titicaca, bezoekt de Amerikaanse toerist Donald Duck, het Titicacameer, en ontmoet daar de lokale bevolking, waaronder een vervelende lama.\nPedro gaat over een klein vliegtuigje uit Chili, Pedro genaamd, wat zijn eerste vlucht maakt, om luchtpost op te halen in Mendoza, ArgentiniÃƒÂ«, wat bijna fout gaat.\nIn El Gaucho Goofy belandt de Amerikaanse cowboy Goofy op mysterieuze wijze op de Argentijnse pampa's, om de werkwijze van de lokale gaucho's te leren.\nAquarela do Brasil is het laatste deel van de film. Het bevat een nieuw karakter, JosÃƒÂ© (Joe) Carioca genaamd. Hij laat Donald Duck Zuid-Amerika zien, en leert hem de samba.\n\nStuart Little 3\nDe familie Little gaat kamperen in de wildernis en George en Stuart melden zich aan bij de padvinders. Stuart ontdekt al gauw dat hij door zijn lengte toch niet zo goed mee kan komen met de groep, maar hij ont- moet hierdoor wel een nieuw vriendje: Reeko. Van Reeko hoort Stuart over het grote beest dat de bossen onveilig maakt.\n\nSpotinformatie:\nCatagorie: Beeld\nFormaat: DVD 5\nBron: Retail dvd voor de Mpeg\nGenre: Animatie\nAudio: NL\nSubtitles: geen\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n    &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\nEnjoy\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\t","torrent":{"xt":"urn:btih:cb942daef6819337835cda3c2fce6b6b587211f5","amp;dn":"Kindertijd+20+5+films+op+een+dvd+%28Dutch%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb942daef6819337835cda3c2fce6b6b587211f5","infoHashBuffer":{"type":"Buffer","data":[203,148,45,174,246,129,147,55,131,92,218,60,47,206,107,107,88,114,17,245]},"announce":[],"urlList":[]}}