{"title":"Persona 4 episode 1 english sub","uid":6890848,"size":53544670,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d05738cdfc31457ec7474efe3b053d9a7ed7737e&amp;dn=Persona+4+episode+1+english+sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"codezero79","files":1,"time":1324009921,"description":"Ok so this is my first torrent \n\n\n\nPlot Summary: Yu Narukami has moved from Tokyo to Inaba to stay with his uncle and cousin, while his parents are away on business. However, after a murder shakes up the sleepy town, things get even more crazy when he discovers the mysterious \\&quot;Midnight Channel,\\&quot; and that he has the even more mysterious ability to enter TVs. Accompanied by his disbelieving friends, Yu discovers another world inside the TVs, that seems to be connected with the murder. They also discover the ability to summon \\'Persona\\', their \\'other selves\\', whose power they can use to fight the shadows that inhabit the TV world. The murders, the Midnight Channel, the world inside the TV, and Persona. Yu and his friends fight to figure out how they\\'re connected, and to solve the case before it\\'s too late. \n\nI have episodes 1 to 11 and will upload more if this one goes good\n\nI\\'ll also be uploading then as they come out in Eng subs\n\n\nmost of Eng subs are available within 48 hours of the RAW version being released in \n\nJapan.\n\nSo i can usually have it up within a day of it being out in Eng subs\n\nthis bring my first torrent i do appreciate any pointer you guys may have for me\n\nThx","torrent":{"xt":"urn:btih:d05738cdfc31457ec7474efe3b053d9a7ed7737e","amp;dn":"Persona+4+episode+1+english+sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d05738cdfc31457ec7474efe3b053d9a7ed7737e","infoHashBuffer":{"type":"Buffer","data":[208,87,56,205,252,49,69,126,199,71,78,254,59,5,61,154,126,215,115,126]},"announce":[],"urlList":[]}}