{"title":"Chomp sms Android","uid":6941295,"size":797176,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d0638c31a8b94ee7db6794d3d2579e6a8826e25a&amp;dn=Chomp+sms+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cad40","files":1,"time":1326041903,"description":"Description\nWant a better Messaging experience? Try chompSMS!\nFrustrated with the built-in Messaging application? Want more features? Then chompSMS is for you, with lots of extra features like chat-style bubbles, contact pictures, emoji icons, signatures, text snippets, passcode lock, blacklisting, scheduling, themes and heaps of customizations. Plus the ultimate in convenience for replying to incoming text messages via the Quick Reply feature!\nYou can simply use chompSMS as a souped-up replacement to the built-in Messaging application, just with a heap more features and customizations.\nIt's completely free and all features are accessible for FREE! There are no other 'pro' or 'full' versions of chompSMS. It's nice and simple\nWe do however after 14 days show a small 'ad banner' inside chompSMS to encourage users to support us by purchasing a license.\nLots more features coming soon, thanks for your ongoing support!\nNEW: If your mobile carrier charges a lot for text messages (internationally for example) you can buy chompSMS credits to send much cheaper SMS messages.","torrent":{"xt":"urn:btih:d0638c31a8b94ee7db6794d3d2579e6a8826e25a","amp;dn":"Chomp+sms+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0638c31a8b94ee7db6794d3d2579e6a8826e25a","infoHashBuffer":{"type":"Buffer","data":[208,99,140,49,168,185,78,231,219,103,148,211,210,87,158,106,136,38,226,90]},"announce":[],"urlList":[]}}