{"title":"Steve Emerson - Jihad Incorporated (mobi, epub)","uid":6942002,"size":22396818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d15887a1dc78f7ace09d7b7f88dfb7556ee73a88&amp;dn=Steve+Emerson+-+Jihad+Incorporated+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1326080510,"description":"Jihad Incorporated: A Guide to Militant Islam in the Us\n\nThe Investigative Project on Terrorism, founded in 1995 by Steven Emerson, maintains the largest non-governmental data and intelligence library in the world on militant Islam. The Project assists the White House, the FBI, the Justice Department, Department of Homeland Security, and other government departments with counter-terrorism activities. Together with a staff of experts, Executive Director Steven Emerson has compiled this thorough factual overview of the Islamist terrorist threat to the United States.\n\nUnlike the Final Report of the 9/11 Commission, which was focused mainly on the retrospective analysis of al Qaeda activities leading up to the attack of September 11, 2001, this work emphasises current radical activities in the United States and the threat they might pose to national security.\n\nDivided into three sections, the work first sets the stage for the current situation by reviewing the lessons learned from previous terrorist plots and attacks both within our borders and against American interests abroad. Emerson and colleagues profile key players in the terrorist network and describe their various criminal activities before and since 9/11.\n\nThe second section analyses organisations in the Middle East besides al Qaeda that are hostile to the United States: Hamas, Hizballah, the Palestinian Islamic Jihad, and radical groups in Pakistan.\n\nThe third section analyses the subtle, wide-ranging support system for terrorist activities that exists within our own borders: charities and foundations that secretly solicit for terror; the complex corporate web of companies, charities, and non-profit corporations known as the SAAR network; mosques that provide cover for terrorists; the use of the Internet for terrorist communication; and lobbying efforts by Muslim American organisations to influence the top echelons of the federal government.\n\nIn a dangerous age, this is an important book for all Americans to read.\n\nAuthor: Steve Emerson\nPublisher: Prometheus Books\nPublication Date: October 2006\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d15887a1dc78f7ace09d7b7f88dfb7556ee73a88","amp;dn":"Steve+Emerson+-+Jihad+Incorporated+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d15887a1dc78f7ace09d7b7f88dfb7556ee73a88","infoHashBuffer":{"type":"Buffer","data":[209,88,135,161,220,120,247,172,224,157,123,127,136,223,183,85,110,231,58,136]},"announce":[],"urlList":[]}}