{"title":"Shrimad Valmiki Ramayana -Aranya Kanda","uid":6903552,"size":49047709,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1ab371da68ad47883a3c960494c68bc55e5c2f1&amp;dn=Shrimad+Valmiki+Ramayana+-Aranya+Kanda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"594mgnav","files":-1,"time":1324490204,"description":"Shrimad Valmiki Ramayana -Aranya Kanda[Team Nanban][TPB]\n\n\n\nAbout Valmiki:\n\n\n\n\\&quot;Valmiki\\&quot; (during Lord Rama\\'s time) is celebrated as the poet harbinger in Sanskrit literature. \n\nHe is the author of the epic Ramayana, based on the attribution in the text of the epic itself.\n\nHe is revered as the Adi Kavi, which means First Poet, for he discovered the first sloka i.e. first verse, which set the base and defined the form to Sanskrit poetry.\n\nThe Ramayana, originally written by Valmiki, consists of 24,000 verses in seven cantos (some say six i.e. excluding the Uttara Ramayana) (Kandas). \n\nThe Ramayana tells the story of a prince, Rama of Ayodhya, whose wife Sita is abducted by the demon (Raakshasa) king of Lanka, Ravana. \n\nThe Valmiki Ramayana is dated variously from 500 BC to 100 BC, or about co-eval with early versions of the Mahabharata.\n\nAs with many traditional epics, it has gone through a long process of interpolations and redactions, making it impossible to date accurately.\n\n\n\nSHORT DESCRIPTION ON Shrimad Valmiki Ramayana - Aranya Kanda:\n\n\n\nRama, Sita and Lakshmana journeyed southward along the banks of river Godavari, where they built cottages and lived off the land. \n\nAt the Panchavati forest they are visited by a rakshasa woman, Surpanakha, the sister of Ravana. \n\nShe attempts to seduce the brothers and, failing in this, attempts to kill Sita. \n\nLakshmana stops her by cutting off her nose and ears. Hearing of this, her demon brother, Khara, organizes an attack against the princes. Rama annihilates Khara and his demons.\n\nWhen news of these events reaches Ravana, he resolves to destroy Rama by capturing Sita with the aid of the rakshasa Maricha. \n\nMaricha, assuming the form of a golden deer, captivates Sita\\'s attention. \n\nEntranced by the beauty of the deer, Sita pleads with Rama to capture it. \n\nRama, aware that this is the play of the demons, is unable to dissuade Sita from her desire and chases the deer into the forest, leaving Sita under Lakshmana\\'s guard. \n\nAfter some time Sita hears Rama calling out to her; afraid for his life she insists that Lakshmana rush to his aid. \n\nLakshmana tries to assure her that Rama is invincible, and that it is best if he continues to follow Rama\\'s orders to protect her. \n\nOn the verge of hysterics Sita insists that it is not she but Rama who needs Lakshmana\\'s help. \n\nHe obeys her wish but stipulates that she is not to leave the cottage or entertain any strangers. \n\nFinally with the coast clear, Ravana appears in the guise of an ascetic requesting Sita\\'s hospitality. \n\nUnaware of the devious plan of her guest, Sita is then forcibly carried away by the evil Ravana.\n\nJatayu, a vulture, tries to rescue Sita, but is mortally wounded. At Lanka, Sita is kept under the heavy guard of rakshasis. \n\nRavana demands Sita marry him, but Sita, eternally devoted to Rama, refuses.\n\nRama and Lakshmana learn about Sita\\'s abduction from Jatayu, and immediately set out to save her.\n\nDuring their search, they meet the demon Kabandha and the ascetic Shabari, who direct them towards Sugriva and Hanuman.\n\n\n\nI WILL POST ALL THE KANDAS ONE BY ONE...\n\nPLZ SEED THIS DIVINE TORRENT AS MUCH AS POSSIBLE..\n\nYOU WILL BE ONE OF THE GOOD PEOPLE WHO SPREAD THE MESSAGE OF RAMAYANA THROUGHOUT THE WORLD...\n\nTHIS TORRENT IS NOT RESTRICTED TO HINDUS ONLY...\n\nANY ONE CAN SPREAD GOOD MESSAGE IF THEY HAVE NICE, PEACEFUL HEART..\n\nPLZ SEED GUYZ...\n\nTHANK YOU..\n\n\nPLZ SEED AS MUCH AS POSSIBLE..I AM LACKING SEEDS...\n\nI AM VERY SAD THAT THERE AREN'T MANY TO SEED GOOD TORRENTS....\n\nPLZ SEED...","torrent":{"xt":"urn:btih:d1ab371da68ad47883a3c960494c68bc55e5c2f1","amp;dn":"Shrimad+Valmiki+Ramayana+-Aranya+Kanda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ab371da68ad47883a3c960494c68bc55e5c2f1","infoHashBuffer":{"type":"Buffer","data":[209,171,55,29,166,138,212,120,131,163,201,96,73,76,104,188,85,229,194,241]},"announce":[],"urlList":[]}}