{"title":"Democracy Now - 15 dec 2011","uid":6889824,"size":450837885,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d2960d1a5b5ecbb96fd8f29252be27633969f986&amp;dn=Democracy+Now+-+15+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1323969858,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 15, 2011\n\n- U.S. Declares End to Iraq War\n- Haditha Documents Recovered at Baghdad Junkyard\n- Obama Withdraws Veto Threat After Lawmakers Alter Indefinite Detention Provisions\n- Survey: Nearly 1 in 5 Women Victimized by Sexual Assault\n- Mobile Software Firm Carrier IQ Probed for Phone Tracking\n- Report: Marines Exaggerated Story of Medal of Honor Recipient\n- Rallies Planned for Bradley Manning Around First Court Appearance\n\n\nSpecial reports\n\n- As Syria Toll Tops 5,000, Activist in Hiding Urges Global Action to Stop Assad Regime Crackdown\n\nInternational pressure on the Syrian regime is increasing as the death toll there continues to rise. This week the United Nations estimated the death toll in Syria since March has surpassed 5,000, including hundreds of children. \\&quot;The regime is given time after time to kill more people and more civilians,\\&quot; says Razan Zaitouneh, a human rights lawyer in Damascus who is living underground for her safety. \\&quot;Every time, there is a new reason, new justification, for the regime to kill more people. It\\'s as if the whole world is waiting [for] the situation in Syria to reach a certain point. It\\'s as if the 40 [killed] daily is not enough to take a serious action against the regime.\\&quot;\n\n\n- Wave of Restrictive Voting Laws Prompts Federal Probes, Grassroots Activism Ahead of 2012 Elections\n\nU.S. Attorney General Eric Holder is vowing to ensure the protection of voting rights in more than a dozen states that have recently enacted controversial laws. Supporters of the laws, backed largely by Republicans, say they are meant to stamp out voter fraud. \\&quot;When people move on their fears, they make bad law,\\&quot; says NAACP CEO Ben Jealous, co-author of a new report that argues the new laws amount to a coordinated and comprehensive assault on minorities\\' voting rights at a time when their numbers in the population and at the ballot box have increased. Students, former felons and elderly voters may also be impacted. On Saturday, the NAACP helped organize a voting rights march in New York, starting at the offices of Koch Industries in order to highlight how billionaire conservative financiers David and Charles Koch have financed the push for voter ID laws. We also speak with Bob Edgar, a former Pennsylvania congressman and the President and CEO of Common Cause. He supports pending legislation, the Deceptive Practices and Voter Intimidation Prevention Act, as a way to reaffirm the nation\\'s commitment to voting rights and free and open elections. \\&quot;We\\'re the only nation in the world that has federal elections without federal rules for election,\\&quot; Edgar says.\n\n\n- Martina Correia, 1967-2011: NAACP\\'s Ben Jealous on the Life of Troy Davis\\' Sister, Public Champion\n\nThe funeral of Georgia activist Martina Correia, the older sister of former death row prisoner Troy Anthony Davis, was held earlier this month in her home town of Savannah, Georgia. She passed away December 1 after a more than decade-long battle with breast cancer at the age of 44. At the same time as she fought to save her own life, Correia struggled valiantly to save that of her brother\\'s. Davis was executed by the state of Georgia on September 21, despite major doubts about evidence used to convict him of killing police officer Mark MacPhail, including the recantation of seven of the nine non-police witnesses. \\&quot;She leaves behind a tremendous legacy,\\&quot; NAACP President Ben Jealous says. \\&quot;Martina inspired young activists across the country.\\&quot;\n\n\n- NAACP: Mumia Abu-Jamal Victory Over Death Penalty Signals Turning Tide Against Capital Punishment\n\nHundreds of supporters of the imprisoned journalist Mumia Abu-Jamal gathered last week in Philadelphia to mark the 30th anniversary of his arrest for the killing of a white police officer. The event occurred just two days after Philadelphia prosecutors announced they will no longer seek the death penalty for Abu-Jamal. We ask NAACP President and CEO Ben Jealous to comment on the developments in his case. \\&quot;The fact that Seth Williams felt, the D.A. in Philly, felt emboldened to come forward and to ask for something that was so reasonable and so just in a city with such a conservative law-enforcement history, really is testament to the fact that public support for the death penalty has fallen to an all-time low since it was reinstated in the wake of Troy Davis\\'s execution,\\&quot; Jealous says.\n\n\n- \\&quot;Worker-Owners of America, Unite\\&quot;: Will Cooperative Workplaces Democratize U.S. Economy?\n\nAs the Occupy Wall Street movement continues to protest record levels of wealth and income inequality, we turn to an author who says the U.S. economy might be becoming more democratic. Gar Alperovitz argues in an op-ed in today\\'s New York Times that we may be in the midst of a profound transition towards an economy characterized by more democratic structures of ownership. Alperovitz finds that 130 million Americans are members of some kind of cooperative, and 13 million Americans work in an employee-owned company. He says the United States may be heading towards something very different from both corporate-dominated capitalism and from traditional socialism. \\&quot;I think we\\'re seeing a change in attitude - both increasing doubts about what\\'s now going on in the economy - deep doubts, very deep doubts: thanks to occupation it\\'s crystallized. But this other trend of saying \\'What do you want? Where are we going?\\' In some ways to democratize the economy in a very American way,\\&quot; Alperovitz says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d2960d1a5b5ecbb96fd8f29252be27633969f986","amp;dn":"Democracy+Now+-+15+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2960d1a5b5ecbb96fd8f29252be27633969f986","infoHashBuffer":{"type":"Buffer","data":[210,150,13,26,91,94,203,185,111,216,242,146,82,190,39,99,57,105,249,134]},"announce":[],"urlList":[]}}