{"title":"El Mito (The Mith) DVDRip Spanish 2005","uid":6994955,"size":735782912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2f736db999ca814c800168593ca7f71fb906c37&amp;dn=El+Mito+%28The+Mith%29+DVDRip+Spanish+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Keiserr","files":1,"time":1327842391,"description":"DirecciÃƒÂ³n: Stanley Tong.\n PaÃƒÂ­s: China.\nAÃƒÂ±o:  2005.\nDuraciÃƒÂ³n: 122 min.\nGÃƒÂ©nero: AcciÃƒÂ³n, aventuras.\nInterpretaciÃƒÂ³n: Jackie Chan (Jack/General Meng-yi), Kim Hee-seon (Ok-soo), Tony Leung Ka Fai (William), Mallika Sherawat (Samantha), Ken Lo (Guardaespaldas), Sun Zhou (Sr. Ku), Shao Bing (Nangong Yin), Ram Gopal Bajaj (GurÃƒÂº), Choi Min-su, Hayama Go.\nGuiÃƒÂ³n: Li Hai-shu, Stanley Tong y Wang Hui-ling.\nProducciÃƒÂ³n: Willie Chan, Solon So y Barbie Tung.\nMÃƒÂºsica: Nathan Wang y Gary Chase.\n FotografÃƒÂ­a: Wong Wing Hang.\nMontaje: Yau Chi Wai.\nDiseÃƒÂ±o de producciÃƒÂ³n: Oliver Wong.\nVestuario: Thomas Chong.\nEstreno en China: 23 Septiembre 2005.\nEstreno en EspaÃƒÂ±a: 1 Septiembre 2006.\n\nEn el aÃƒÂ±o 221 antes de Cristo, Qin Shihuang, primer emperador de China, comenzÃƒÂ³ a edificar una tumba real pese a pretender ser inmortal. El mausoleo se finalizÃƒÂ³ en treinta y siete aÃƒÂ±os. La leyenda establece que para asegurar el mÃƒÂ¡s absoluto secreto, todos cuantos trabajaron en el proyecto fueron enterrados en vida junto al emperador difunto. No hubo supervivientes. A lo largo de los siguientes dos mil aÃƒÂ±os, historiadores, buscadores de tumbas y aventureros sin escrÃƒÂºpulos han estado buscando el tesoro real oculto en el interior. Pero nadie ha logrado localizar siquiera la entrada al mausoleo. AsÃƒÂ­, el tesoro del primer emperador, en el que se supone que estÃƒÂ¡ el cÃƒÂ©lebre y legendario elixir de la juventud, permanece intacto. El intrÃƒÂ©pido arqueÃƒÂ³logo Jack (Jackie Chan) y el ambicioso cientÃƒÂ­fico William (Tony Leung Ka Fai) emprenden una aventura que les conducirÃƒÂ¡ al mayor descubrimiento de toda la Historia de China. Su periplo se inicia en Dasar, la India, donde se topan con una antigua espada perteneciente a la dinastÃƒÂ­a Qin y con una piedra preciosa que parece desafiar la fuerza de gravedad. El botÃƒÂ­n no sÃƒÂ³lo les lleva al mÃƒÂ­tico mausoleo sino que tambiÃƒÂ©n pone en contacto a Jack con su oscura vida pasada. En unos sueÃƒÂ±os extraÃƒÂ±os, Jack se ve a sÃƒÂ­ mismo como la reencarnaciÃƒÂ³n de Meng-yi, un general que se enamorÃƒÂ³ de la primera y bella esposa consorte del emperador, Ok-soo (Kim Hee-seon), unos dos mil aÃƒÂ±os atrÃƒÂ¡s.\n\nVISITA MI BLOG PARA MAS TORRENTS, PUEDES MIRARLO EN MIS COMENTARIOS.","torrent":{"xt":"urn:btih:d2f736db999ca814c800168593ca7f71fb906c37","amp;dn":"El+Mito+%28The+Mith%29+DVDRip+Spanish+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2f736db999ca814c800168593ca7f71fb906c37","infoHashBuffer":{"type":"Buffer","data":[210,247,54,219,153,156,168,20,200,0,22,133,147,202,127,113,251,144,108,55]},"announce":[],"urlList":[]}}