{"title":"One fine day (1996) Xvid multisubs (moviesbyrizzo) fullscreen 16","uid":6932733,"size":901667892,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d4f4f021c83cb2adb6f034bdbd8c6ff9359d51b5&amp;dn=One+fine+day+%281996%29+Xvid+multisubs+%28moviesbyrizzo%29+fullscreen+16&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1325713075,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0117247/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0117247/&lt;/a&gt;\n\nThere aren't too many capable scriptwriters in Hollywood who know anything about true love and real romance. They do know about confusion, hysteria, bickering, \ndemeaning, being malicious and generally retarded about what it is the stuff is\ntruly all about.\n\nAs such when they find a shallow script such as this one, they feel they've done\ntheir job - as after all they did put together stars with potential - and the rest \nwasn't meant to happen in any other way of a nice outcome than  that at least they \ntried to make it look like an effort - however pathetic that may be.\n\nWe do learn something of dysfunctional children - a result of incompetent circumstances of child rearing along the way - with no clue other than by gosh and by golly - and little real love there too for when mom and dad deserve it too\nas no one wants to second guess a child other than to read them the rules of when \nbedtimes are to observed as adequate enough measure of respect for their own\nparents equally! such as that is - tut tut\n\nNo child should have the pent up anger that causes him to strike at his mother\nas does this young boy while his mother is asleep and so is the audience I gather\n- as i would have a heart attack seeing a gal as Michelle Pfeiffer acted upon\nin what is against her spirit - even if its only a shallow scriptwriter who is\nto blame rather than the nice kid I bet!\n\n\nGeorge Clooney has some nice Irish-Italian appeal with some Greek and Spanish\nmacho tendencies thrown in too - the stuff of real romance given the lovely\nGermanic Michelle Pfeiffer is &quot;to die for&quot; equally - and then some! What a \nlovely gal!\n\nYet we do not see this potential explored in any real way, simply avoidance \nand obfuscation by the reluctant story teller to do otherwise - so as to have\nseemed apologetic all the way - lest anything become of this prospect after all\n- god forbid it would seem!\n\nAt the end of it, its an incompetent lot that tell a story of an incompetent culture that has yet to define its success in any other way than a compliance\nwith the inane of whatever goes - on TV! how sad that is after all\n\nOther than catchwords and buzzwords and speaking in feigns - no romantic\nwisdom is apparent it seems and therefore none to speak of in fact!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n850meg movie file with fullscreen 16:9 format Xvid video featuring 192k audio\nfor the loveliest song by Van Morrison &quot;Have I told you lately&quot; is a central feature of the soundtrack theme and music.\n\n\nsubtitles found for the following thus far: (1hr 48 minute version)\n\nBulgarian\nCroatian\nCzech\nPolish\nRomanian\nSerbian\nSpanish\nSwedish\n\n \n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d4f4f021c83cb2adb6f034bdbd8c6ff9359d51b5","amp;dn":"One+fine+day+%281996%29+Xvid+multisubs+%28moviesbyrizzo%29+fullscreen+16","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4f4f021c83cb2adb6f034bdbd8c6ff9359d51b5","infoHashBuffer":{"type":"Buffer","data":[212,244,240,33,200,60,178,173,182,240,52,189,189,140,111,249,53,157,81,181]},"announce":[],"urlList":[]}}