{"title":"Debbie Does Dallas 1978","uid":15910366,"size":1388310020,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d500527730e21eb6163e428d306b120892c7459c&amp;dn=Debbie+Does+Dallas+1978&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":6,"uploader":"AussieUploader","files":1,"time":1475109055,"description":"Debbie gets a spot on the roster of the Dallas Cowboy Cheerleaders, which is referenced only as &quot;Texas&quot; throughout the movie. The only problem is that Debbie doesn't have enough money to get there on her own, and her mom doesn't want to help her, so her friends decide to help her out, and they all get small jobs around town to raise money. One day, Debbie is approached by her boss, Mr. Greenfeld, who first offers $10 to see her breasts, another $10 to touch them, and finally another $10 to suckle them. She realizes that they can get more money by performing sexual favors. She finally gets to go when Mr. Greenfeld offers to pay for everything if Debbie helps him reliza his fantasy and let him &quot;score a touchdown&quot;.\r\n- Written by Mike N.\r\nThis all-time best-seller among adult movies is about Debbie (Bambi Woods) whose talents have earned her a coveted place as a professional football cheerleader for the Dallas Cowboys. However Debbie and her friends on the cheerleading squad are faced with a problem. She doesn't have any money to make it to Dallas. She and her girl friends try to figure out ways to make a little extra cash... on the side! One of them works in a library, another in a candle shop, and Debbie herself works in a clothing store for Mr. Greenfield (R. Bolla). While doing their odd jobs they realize that they can make more money by doing sexual favours for their bosses. Debbie makes enough money when &quot;Mr. Greenfield scores a field goal and Debbie makes a touchdown&quot;.\r\n- Written by Sujit R. Varma","torrent":{"xt":"urn:btih:d500527730e21eb6163e428d306b120892c7459c","amp;dn":"Debbie+Does+Dallas+1978","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d500527730e21eb6163e428d306b120892c7459c","infoHashBuffer":{"type":"Buffer","data":[213,0,82,119,48,226,30,182,22,62,66,141,48,107,18,8,146,199,69,156]},"announce":[],"urlList":[]}}