{"title":"Thomas DVD NL (dvd5)(Nl subs) RETAIL TBS B-SAM","uid":6970526,"size":4415885524,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d5c3833d64fb02904d98f9cf01a9e325bb9fd05a&amp;dn=Thomas+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sammynet","files":-1,"time":1327077056,"description":"titel: Thomas (2001)\n\nNederlands\nAls Jezus van het kruis op Golgotha genomen wordt, arriveert Thomas.\nNet zoals veel andere discipelen, was hij na de arrestatie van Jezus ondergedoken bij vrienden.\nNa zijn begrafenis besluiten de discipelen Jeruzalem snel te verlaten.\nAlleen Thomas weigert mee te gaan.\nHij wil het graf van Jezus niet onbewaakt achterlaten en is bang voor ontheiliging.\nAls Maria Magdalena van de opstanding van Jezus komt vertellen, geloven alle discipelen haar, behalve Thomas.\nHij verlaat de rest en gaat het lichaam zoeken.\nZelfs als de rest van de discipelen Jezus gezien heeft gelooft hij hen niet.\nHij gaat op weg om de waarheid te zoeken, en al snel komt hij Jezus tegen.\n\nEnglish\nWhen Jesus is taken off the cross at Golgotha, THOMAS arrives there.\nLike most of the other disciples, he had worriedly taken refuge with friends in Jerusalem after Jesus's arrest.\nAfter Jesus's burial, the disciples decide to leave Jerusalem quickly,\nbut Thomas refuses to leave Jesus' body behind, as he fears that the tomb may be desecrated.\nWhen MARY MAGDALENE tells the disciples that the resurrected Jesus has appeared to her,\nthey are all convinced of his god-like nature apart from Thomas. He sets off to look for the corpse.\nThomas still has his doubts even when the disciples tell him that Jesus appeared to them, too.\nTherefore, he meets a legionary who pretends to know where the body can be found.\nThe man leads Thomas into the catacombs for money # but the corpse he shows him is someone else's.\nThomas is told to announce to the others that he has seen Jesus's corpse...\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Drama\nPlay time     : 91 minuten","torrent":{"xt":"urn:btih:d5c3833d64fb02904d98f9cf01a9e325bb9fd05a","amp;dn":"Thomas+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5c3833d64fb02904d98f9cf01a9e325bb9fd05a","infoHashBuffer":{"type":"Buffer","data":[213,195,131,61,100,251,2,144,77,152,249,207,1,169,227,37,187,159,208,90]},"announce":[],"urlList":[]}}