{"title":"Jesse Thomas Blues Is A Feeling(blues)(mp3@320)[rogercc]","uid":6995240,"size":115382272,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d89e81a4b980bd78335d252a530f8596f7e71588&amp;dn=Jesse+Thomas+Blues+Is+A+Feeling%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rogercc1","files":12,"time":1327851715,"description":"Jesse Thomas Blues Is A Feeling\nRecorded: 1992\nReleased: 2001\nLabel: Delmark\nFormat: Mp3@320\n\nAlthough Jesse \\&quot;Baby Face\\&quot; Thomas never received as much attention as he deserved to, the country bluesman continued to perform and record during the final years of his life. Thomas was 81 when he recorded Blues Is a Feeling, a 1992 session that wasn\\'t actually released until 2001. This CD was recorded three years before his death, and it was also recorded during a visit to Chicago in June 1992 (when he was in town to perform at the Chicago Blues Festival). At 81, Thomas didn\\'t have the vocal power he once did -- his voice had grown frail, withered, and thin. But, despite those limitations, Thomas still had charisma, and he was still capable of providing a meaningful album. Blues Is a Feeling isn\\'t in a class with his best work, although it is a decent effort that thrives on simplicity and rawness. Nothing elaborate is heard on this CD; the performances have a loose, informal quality, and the singer/acoustic guitarist\\'s only accompaniment consists of fellow guitarist John Primer and acoustic pianist Jodie Christian. There are no drums or bass, which turns out to be a good thing, as Thomas is well served by minimalism. Those who are familiar with Christian\\'s background will tell you that he is primarily a jazz improviser, not a blues artist. But he has no problem rising to the occasion on this CD. In fact, Christian fits right in because Thomas had a slightly jazz-influenced approach to country-blues -- that was one of the things he had in common with Lonnie Johnson. \n\nJesse Thomas was an amazing blues treasure who recorded for Victor Records in 1929. He also recorded for Modern, Elko, Hollywood, Freedom, Miltone &amp; Swing Time. Thomas returned to Shreveport, LA in 1957 &amp; played there for the remaining 38 years of his life\n\nRecorded at Riverside Studio, Chicago, Illinois on June 8 &amp; 9, 1992.\n\nTracklist:\n\n1. Blues Is A Feelin\\'\n2. Married Woman Blues\n3. Boogie Everywhere\n4. Please Believe Me\n5. She Throwed My Clothes Outdoor\n6. Rain Sleet Or Snow\n7. Jesse, John And Jodie Jam\n8. Stop Crying On My Shoulder\n9. Sad Old World\n10. Change Your Attitude\n11. Santa Claus\n12. When I Left My Baby","torrent":{"xt":"urn:btih:d89e81a4b980bd78335d252a530f8596f7e71588","amp;dn":"Jesse+Thomas+Blues+Is+A+Feeling%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d89e81a4b980bd78335d252a530f8596f7e71588","infoHashBuffer":{"type":"Buffer","data":[216,158,129,164,185,128,189,120,51,93,37,42,83,15,133,150,247,231,21,136]},"announce":[],"urlList":[]}}