{"title":"Weed  Farmer Android","uid":6981579,"size":11842394,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:d97dd326d0005fbb1ec2908b070262c71335f7f1&amp;dn=Weed++Farmer+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cad40","files":1,"time":1327421303,"description":"Description\nGrow Your Own Marijuana Plants by Playing the Online Video Game of Weed Farmer.\nJoin now to interact with over 65,000 players who have already discovered and are playing this unique online game.\nWelcome Weed Farmer! Get ready to accept the challenges and reap the rewards as you increase your growing skills and bank account by farming 30 different strains of cannabis plants. Manage each stage of a plant's growth and production, from seed germination to the final harvest, you control it all. Upgrade your grow location from a small starting closet to a massive warehouse. Choose from a large number of supplies and equipment to install for creating multiple specialized growing rooms.\nWEED FARMER IS MUCH MORE THAN A VIRTUAL PLANT GROWING APP\n* 30 unique types of weed to grow, harvest, sell and collect.\n* Fully Online with dedicated servers storing each action you perform resulting in no loss of game data.\n* Fight off attacks by bugs and fungus while avoiding dehydration and nutrient deficiency.\n* Specialized grow areas allow for direct plant interaction during each stage of a plant's growing cycle. \n* Manage all aspects of growing such as lighting, ventilation, growing mediums, water supply, hydro pumps and many more.\n* Buff up your plants by adding fertilizer, regular watering and transplanting to different growing mediums.\n* Chat live in game with other growers to share tips and brag about your latest harvests.\n* Increase your growing skill to increase profits by learning to growing more difficult types of weed.\n* Leader boards show wealthiest growers, most skilled growers, highest yielding harvests and more.\n* Events like in-game holiday events and reward gear\nTo learn more about Weed Farmer go to http://www.Weed-Farmer.com/guides/\nFOR THOSE HAVING ISSUES: Please write us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fe8d8b8e8e918c8abe899b9b9ad3989f8c939b8cd09d9193&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; and we will get back to you. We can't help you if you just leave a negative comment, as we have no way to connect comments to customers. 99% of all known problems can be resolved if we can communicate with you.\nATTENTION Android 4.0 Users: Weed Farmer and Ice Cream Sandwich don't yet play together nicely, so be prepared for a sub-par user interface experience or wait until we fix the compatibility issues. Please do not 1 Star us for this known issue, just ask for a refund if it is unacceptable on your device.\nATTENTION T-Mobile Customers: Sometime around 11/15/2011 T-Mobile added our web services domain to their WebGuard blacklist. Please see link below to fix: &lt;a href=&quot;\nhttp://support.t-mobile.com/docs/DOC-2144&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://support.t-mobile.com/docs/DOC-2144&lt;/a&gt;\nThe Vast Majority of the 1 stars from people not being able to log in are coming from T-Mobile customers who didn't read this text.\nABOUT THE DEVELOPERS\nGrow Brothers http://www.grow-brothers.com are the creators of Weed Farmer are dedicated to providing a high quality online gaming experience. We consider customer support a high priority with emails being answered in less than 24 hours. Additional support web sites for Weed Farmer are available including a community forum:","torrent":{"xt":"urn:btih:d97dd326d0005fbb1ec2908b070262c71335f7f1","amp;dn":"Weed++Farmer+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d97dd326d0005fbb1ec2908b070262c71335f7f1","infoHashBuffer":{"type":"Buffer","data":[217,125,211,38,208,0,95,187,30,194,144,139,7,2,98,199,19,53,247,241]},"announce":[],"urlList":[]}}