{"title":"A Nightmare on Elm Street","uid":6887443,"size":369972947,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9b90e3c4b7280b8b31559a673c8fccbe071a670&amp;dn=A+Nightmare+on+Elm+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"steveman","files":4,"time":1323882212,"description":"Source: A.Nightmare.On.Elm.Street.1984.720p.BluRay.x264-SEPTiC\n\nThis is specially sized and encoded for the Sony PSP, Apple iPhone, Apple iPod touch, and Apple Nano 3g.\n\nPlease make sure you are running PSP firmware 4.01 or above before claiming the release doesn't work on your PSP. I do not test functionality on Apple products, this may or may not work for you on those.\n\nAll releases tested on PSP firmware 4.01 M33-2 - http://www.dark-alex.org/index_psp.php\n\nBased on previous testing this should also work on new model Zunes. http://www.zune.net/en-us/products/compare.htm New Zune is similar to PSP video specs, except it doesn't support CABAC and i'm guessing B frames.\n\nZune 30GB will not sync these directly. Zune software will transcode H.264 files at device sync. This device should be traded to an unsuspecting PSP owner.\n\n--------------------------------------------------------------------------\n\nVideo\nDimensions: 480x270 (16:9 widescreen)\nCodec: H.264 / AVC\nH.264 Level: 21\nCoder: CAVLC\nPasses: 2\nBitrate: 384kb (ABR)\n\nAudio\nCodec: MPEG-4 AAC Audio\nChannels: Stereo\nSample rate: 48000 Hz\nBitrate: 128kb\n\n\nCopy files or folder to /VIDEO on your PSP memory stick.\n\n(or)\n\nSync video files using iTunes to your iPhone or iPod touch.\n\n(or)\n\nSync video files using Zune software to your Zune. (new Zunes only, no 30GB support)\n\n--------------------------------------------------------------------------\n\n\nWant to watch it on the big screen?\n\nHere are a few ways to do that:\n\n1) Do you have a PSP slim? If so buy the TV out cables and direct connect to your tv and play them that way. You can buy regular composite cables, svideo cables, and component cables. I recommend these - http://www.amazon.com/PSP-Slim-Component-Cable-Xbox-360/dp/B00149S0H6/\n\n2) Do you have an XBOX 360 and a PSP? Hook your PSP to your XBOX 360 via the usb mini b cable. Go to the media blade on your 360, select videos, change source, select portable device, navigate to your video.\n\n3) If for some reason you don't have a PSP and you do have an XBOX 360 then you can just put the video files on any usb device and just connect them to your XBOX in the same manner as above.\n\n4) You can also stream the video to your XBOX 360 using Windows Media player 11 or uShare on Linux. To stream via Windows Media Player 11 to XBOX 360 follow this guide http://owlet.spaces.live.com/blog/cns!D48B90C1DDF5D401!297.entry It works fine.\n\n5) Watch via XBMC on your XBOX or Linux HTPC - http://xbmc.org/\n\n6) There is most likely a way to stream this to a PS3 or play via usb device also, but I don't own one, so I can't advise on how to do that.\n\n7) Use Apple TV - http://www.apple.com/appletv/\n\n8) Use either Apple Composite AV Cable or Apple Component AV Cable with your iPhone or iPod touch. http://store.apple.com/us/product/MB128LL/A or http://store.apple.com/us/product/MB129LL/A\n\n9) Use aHour A-110 -\n\n10) Connect your Zune to your Xbox 360 via the usb cable. Go to the media blade on your 360, select videos, change source, select portable device, navigate to your video.\n\nNote: playing mpeg 4 videos on Xbox 360 requires the Dec 2007 video update, refer to http://blogs.msdn.com/xboxteam/archive/2007/11/30/december-2007-video-playback-faq.aspx You may also need to download the optional video pack.\n\n\n-steveman\n","torrent":{"xt":"urn:btih:d9b90e3c4b7280b8b31559a673c8fccbe071a670","amp;dn":"A+Nightmare+on+Elm+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b90e3c4b7280b8b31559a673c8fccbe071a670","infoHashBuffer":{"type":"Buffer","data":[217,185,14,60,75,114,128,184,179,21,89,166,115,200,252,203,224,113,166,112]},"announce":[],"urlList":[]}}