{"title":"HISTORY OF POP AND ROCK MUSIC - part 347","uid":6954934,"size":925632974,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db5f313a75d702dc50cb8fe27f160fb81050a702&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+347&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":-1,"time":1326546188,"description":"   \n                    PART  347\n\n\n            CUTTING CREW  - (I Just) Died in Your Arms  (1986)\n            38 SPECIAL  - Second Chance (1989)\n            ALDO NOVA  -  Someday  (1991)\n            GUNS N' ROSES  - Don't Cry (1991)  \n            U2  -  One   (1992)\n            RICHIE SAMBORA  - One Light Burning  (1992)\n\n\n        \n          &quot;(I Just) Died in Your Arms&quot; is a power ballad written by Nick Van Eede and introduced by his band, Cutting Crew, in 1986. It was their biggest hit, peaking at #1 in the United States, Canada and Finland, and reaching the top five in the UK, South Africa, Sweden and Switzerland. \n         &quot;Second Chance&quot; is a song by American rock band 38 Special, from their eighth studio album, 1988's Rock &amp; Roll Strategy. Written by keyboardist Max Carl, guitarist Jeff Carlisi and Cal Curtis, the song was released as the album's second single in 1989 and became the band's highest-charting song in the United States. &quot;Second Chance&quot; entered the U.S. Billboard Hot 100 singles chart at number 78 in February 1989. The song was the highest-charting Hot 100 single of the band's career, as it peaked at #6 in May 1989 and spent 21 weeks on the chart. The song reached #5 on the Singles Sales chart and #9 on the Hot 100 Airplay chart. It also peaked at #2 on the Mainstream Rock chart, and became the band's first #1 single on the Adult Contemporary chart. It was Billboard magazine's &quot;Adult Contemporary Song of the Year&quot; for 1989. The single peaked at #2 in Canada and #14 in Australia, where it spent 12 weeks on the chart.\n       &quot;Someday&quot; is a song written and performed by Aldo Nova. The song appears on his album \n&quot;Blood on the Bricks&quot; (1991) . It was the fourth studio album by Canadian singer, for which he signed to Jon Bon Jovi's Jambco Records. \n        &quot;Don't Cry&quot; is a song by rock band Guns N' Roses.&quot;Don't Cry&quot; forms a segment of the Illusions Trilogy, according to singer Axl Rose. Along with &quot;Estranged&quot; and &quot;November Rain,&quot; it forms a narrative inspired in part by the short story &quot;Without You&quot; by Del James.The song peaked at #10 on the Billboard Hot 100, becoming the band's fifth Top 10 hit there.\n      &quot;One Light Burning&quot; is the song by American guitarist Richie Sambora. It was written by Richie Sambora, Bruce Foster and Tommy Marolda and it was taken as the second single from the album Stranger in This Town.","torrent":{"xt":"urn:btih:db5f313a75d702dc50cb8fe27f160fb81050a702","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+347","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5f313a75d702dc50cb8fe27f160fb81050a702","infoHashBuffer":{"type":"Buffer","data":[219,95,49,58,117,215,2,220,80,203,143,226,127,22,15,184,16,80,167,2]},"announce":[],"urlList":[]}}