{"title":"The Thing 2011 US 1080p BluRay Remux VC-1 DTS-HD MA 5.1-av","uid":6995705,"size":26277925551,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:db9897ea3f2ef721f21257a8806a88914e0345f6&amp;dn=The+Thing+2011+US+1080p+BluRay+Remux+VC-1+DTS-HD+MA+5.1-av&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pericoxx","files":1,"time":1327874181,"description":"La paleontÃƒÂ³loga Kate Lloyd (Mary Elizabeth Winsted) ha viajado a La AntÃƒÂ¡rtida a realizar el trabajo de su vida. Se ha unido a un grupo de cinetiÃƒÂ­ficos noruegos que han descubierto una nave extraterrestre sepultada en el hielo. AllÃƒÂ­ descubren a un ser que parece haber muerto hace miles de aÃƒÂ±os en un accidente. Sin embargo, estÃƒÂ¡ a punto de despertar...\n\nUn simple experimento despertarÃƒÂ¡ al extraterrestre de su prisiÃƒÂ³n de hielo y Kate deberÃƒÂ¡ unirse a Carter (Joel Edgerton) para luchar contra su nuevo enemigo...\n\nEn una tierra tan bella como peligrosa, la gente deberÃƒÂ¡ luchar contra un ser capaz de cambiar de forma y tomar el aspecto de cualquier ser vivo. Puede verse como cualquiera de nosotros pero dentro sigue siendo inhumano.\n\nLa paranoia comenzarÃƒÂ¡ a apoderarse de todos ellos mientras comienzan a ser infectados por un ser de otro planeta. \n\n----------------------------------------------------\n\nThe paleontologist Kate Lloyd (Mary Elizabeth Winstead) has traveled to Antarctica to do the work of his life. He has joined a group of Norwegian cinetiÃƒÂ­ficos have discovered an alien spacecraft buried in the ice. There they discover a being who seems to have died thousands of years ago in an accident. However, it is to wake ...\n\nA simple experiment will awaken the alien of his icy prison and Kate will join Carter (Joel Edgerton) to fight their new enemy ...\n\nIn a land so beautiful and dangerous, people must fight against being able to change shape and take the appearance of any living being. It can be seen as any of us but inside is still inhumane.\n\nParanoia begins to take over all of them as they begin to be infected by a being from another planet.","torrent":{"xt":"urn:btih:db9897ea3f2ef721f21257a8806a88914e0345f6","amp;dn":"The+Thing+2011+US+1080p+BluRay+Remux+VC-1+DTS-HD+MA+5.1-av","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db9897ea3f2ef721f21257a8806a88914e0345f6","infoHashBuffer":{"type":"Buffer","data":[219,152,151,234,63,46,247,33,242,18,87,168,128,106,136,145,78,3,69,246]},"announce":[],"urlList":[]}}