{"title":"Democracy Now - 28 dec 2011","uid":6917691,"size":456554366,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ddedd50fbb36a709a07418dd621282ba0c5a4c09&amp;dn=Democracy+Now+-+28+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1325089249,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 28, 2011\n\n- North Korea Holds State Funeral for Jong-Il\n- Killings, Protests as Arab League Observers Visit Syria\n- Mubarak Trial Resumes in Egypt\n- Obama to Seek $1.2 Trillion Debt Ceiling Increase\n- Nelson to Retire From Senate in 2012\n- White House Unveils Fed Nominees\n- Swedish Journalists Imprisoned in Ethiopia\n- Cuba Releases Over 2,500 From Prison, Freeing 66 Political Prisoners\n- Argentina President to Receive Cancer Treatment\n\n\nSpecial reports\n\n- Author Russell Banks on Writing Through the Voices of Outcasts, Criminals and Revolutionaries\n\nWe speak with acclaimed novelist Russell Banks, a two-time Pulitzer Prize finalist known for drawing on his working-class background to write about criminals, outcasts and revolutionaries. &quot;I know that as a kid in a broken home that was marred by alcoholism and violence and so forth, storytelling was a way, just within the circle of the family, for me and my brothers and so on, and for myself, to save ourselves. We could make sense of an otherwise incoherent life for children.&quot; Banks has written a dozen novels and several short story collections. In &quot;Cloudsplitter,&quot; he focused on the revolutionary abolitionist John Brown; in &quot;Affliction,&quot; a paranoid alcoholic; and in &quot;Rule of the Bone,&quot; a 14-year-old drug dealer. Bank's latest book, &quot;Lost Memory of Skin,&quot; explores the plight of sex offenders trying to live among society as outcasts.\n\n\n- Alaa Abdel Fattah, Egyptian Blogger and Critic of Military Regime, Speaks Out After Months in Jail\n\nAlaa Abdel Fattah, a prominent Egyptian revolutionary activist and blogger, has been released from prison after nearly two months behind bars. Fattah was ordered jailed by a military court on October 30 and summoned to face charges that included inciting violence - a charge he firmly denies. He refused to cooperate, rejecting the legitimacy of the military court who wanted to try him as a civilian. We speak to Fattah about the Egyptian revolution's ongoing struggle against the military regime and his ordeal in one of Egypt's worst prisons, which prevented him from attending the birth of his first son. Fattah's trial comes just as Egypt's ousted leader, Hosni Mubarak, returns to a Cairo courtroom today to face charges over the deaths of 840 protesters during the uprising against his rule. &quot;What comes next might be even tougher and even more difficult,&quot; Fattah says, &quot;but I don't think that this revolution is going to end without really completely renegotiating the order of power in Egypt and across the Arab world.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ddedd50fbb36a709a07418dd621282ba0c5a4c09","amp;dn":"Democracy+Now+-+28+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddedd50fbb36a709a07418dd621282ba0c5a4c09","infoHashBuffer":{"type":"Buffer","data":[221,237,213,15,187,54,167,9,160,116,24,221,98,18,130,186,12,90,76,9]},"announce":[],"urlList":[]}}