{"title":"Far from Heaven (2002) DivX (moviesbyrizzo) multisubs","uid":6945418,"size":902601334,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dff09dba60a9943eb58e2cd292a900abae35f757&amp;dn=Far+from+Heaven+%282002%29+DivX+%28moviesbyrizzo%29+multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1326205702,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0297884/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0297884/&lt;/a&gt;\n\n720 x 388 full-(wide)screen 16:9 standard DivX using DivX author 1.5 \nconverted from HD \n950k video bitrate 160k audio 1hr47minutes\n\nWhen the beautiful Julianne Moore discovers as have many an American woman along the way (no doubt) that her husband's pent up frustrations and abusive outbursts and demeanor are the result of being a closet homosexual who is only just &quot;found \nout&quot; she turns to the most unlikely source of comfort - a black man who presents\nas an &quot;only recently emancipated slave&quot; as tempers on the matter run high in this\nsmall town it seems.\n\nIncredulously even this source of comfort turns out to be slow to recognize\nher pain in any way as to bring her relief. Instead the man she turns o seems\nto play &quot;hard to get&quot; stringing her along for all the signs she gives full\nacceptance and brings the community along, before it could be considered safe\nto take her up on her obvious forward advances that are sexually aggressive\nin her articulation with him.\n\nIts sad that when movies that look at the American cultural mosaic as presently\nconstituted ignore the great men of Europe who at present are in the \nmillions in South American countries (Spanish men that is). My brother in \nlaw is from Chile and I have never met a man who is kinder and more decent and\ncaring to the Irish spirit  having been welcomed rightly - that it is a terrible\nsituation that can only be corrected by using education to eliminate bigotry\nagainst the human spirit coming into its own where people can give each other \nthe righter kind of care that almost all are yet yearning for down there.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\nSubtitles included for Bulgarian Danish Dutch English (close captioned\nas well as template) Hungarian Italian Romanian Serbian Slovenian\nSpanish Swedish - hope to have more subs found soon - please check\nthe subtitles sites on the net where we post updates for matching subs \n","torrent":{"xt":"urn:btih:dff09dba60a9943eb58e2cd292a900abae35f757","amp;dn":"Far+from+Heaven+%282002%29+DivX+%28moviesbyrizzo%29+multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dff09dba60a9943eb58e2cd292a900abae35f757","infoHashBuffer":{"type":"Buffer","data":[223,240,157,186,96,169,148,62,181,142,44,210,146,169,0,171,174,53,247,87]},"announce":[],"urlList":[]}}