{"title":"Bonanza Platinum Collection 1 Dvd 3 van 5 (NLsubs) TBS B-SAM","uid":6995684,"size":4613357886,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e063c1541749d86e6dc5c03170775d13ce3e963a&amp;dn=Bonanza+Platinum+Collection+1+Dvd+3+van+5+%28NLsubs%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Mad_Parrot","files":-1,"time":1327873790,"description":"\n\nBonanza Platinum Collection 1 (5 Dvd\\'s)  Dvd 3\n\n\n\n Beschrijving\n\nDvd 1\n\nThe Last Trophy: Voormalig premiejager Lord Marion Dunsford en zijn vrouw Lady Beatrice zijn te gast op de \nPonderosa Ranch. Lord Marion Dunsford wordt jaloers als blijkt dat Beatrice ongewoon veel belangstelling heeft voor Adam.\n\nThe Trail Gang: Crimineel Johnny Logan heeft gezworen om de sheriff te doden. Hij wordt veedrijver op de Ponderosa Ranch.\n\nThe Abduction: Joe en Hoss Cartwright hebben veel plezier met hun vriendinnen, maar dat verandert als Joe\\'s liefje verdwijnt!\n\n\nDvd 2\n\nThe Gunmen: Joe en Hoss worden gearresteerd in Texas.Ze worden aangezien voor de Slade broers die betrokken zijn bij een vete tussen twee families.\n\nThe Fear Merchants:Andrew Fulmer, een man die de Chinezen haat, wil burgemeester worden. Jimmy Chong wordt ten onrechte beschuldigd\nvan een misdaad en dat is koren op de molen van Fulmer.\n\nThe Spanish Grant: Rosita Morales doet zich voor als de eigenaresse van een landgoed. Ben vertrouwt haar niet en wil de zaak uitzoeken.\n\nDvd 3\n\nBlood On The Land: Schapenhoeder Jeb Drummond besluit om op het Ponderosa landgoed te blijven, dit zonder toestemming van Ben Cartwright.\n\nDesert Justice: Een van Ben\\'s cowboys, Dave Walker wordt beschuldigd van de moord op de vrouw van Marchall Dowd.\n\nSan Francisco Holiday: Ben, Hoss en Joe zijn op vakantie in San Francisco, maar dat verloopt niet zonder problemen. Ben wordt op transport gesteld met bestemming Hong Kong!\n\nDvd 4\n\nDark Star: Het zigeunermeisje Tirza vindt \nonderdak op de Ponderosa Ranch nadat ze is verstoten door haar eigen volk. Joe ontfermt zich over haar.\n\nDeath At Dawn: Een winkelier wordt vermoord en zijn vrouw is getuige. Maar ze wil geen verklaring afleggen omdat ze wordt \nafgeperst.\n\nShowdown: Een bende berooft de bank. Een van de bendeleden gaat werken op de Ponderosa Ranch om \neen oogje in het zeil te kunnen houden naar het onderzoek wat er gaande is.\n\nDvd 5\n\nThe Mission: Kapitein Pender is op zoek naar een gids. Hoss stelt voor om het Charlie Trent te vragen. Charlie was vroeger gids maar is door omstandigheden\naan de drank geraakt.\n\nBadge Without Honor: Gerald Eskith doet zich voor als Deputy Marchall. Hij wil Jason Blaine meenemen naar San Francisco om te getuigen tegen de Murdock bende.\n\nThe Blood Line: Ben heeft in noodweer Luke Grayson neergeschoten. Zijn zoon Todd komt terug uit het oosten om wraak te nemen.\n\n\n\n\n\nSpotinformatie \n\nCategorie     : Beeld 4X3\nFormaat       : DVD5 \nBron          : Retail\nMenu          : Nee\nAudio         : Engels DD 2.0\nExtra\\'s       : Nee\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Nee\nGenre         : Western\n\n\n\n\n\n\n\n\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\n\n\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:e063c1541749d86e6dc5c03170775d13ce3e963a","amp;dn":"Bonanza+Platinum+Collection+1+Dvd+3+van+5+%28NLsubs%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e063c1541749d86e6dc5c03170775d13ce3e963a","infoHashBuffer":{"type":"Buffer","data":[224,99,193,84,23,73,216,110,109,197,192,49,112,119,93,19,206,62,150,58]},"announce":[],"urlList":[]}}