{"title":"An American Fraud: One Lawyer's Case Against Mormonism","uid":16024482,"size":3635412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e23bec9f3f192c0ee50e134f8c80f3fceee3e2bf&amp;dn=An+American+Fraud%3A+One+Lawyer%27s+Case+Against+Mormonism&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476368597,"description":"An American Fraud: One Lawyer's Case Against Mormonism - Kay Burningham [epub]\r\n\r\n&quot;The Book of Mormon&quot; is not a translation of ancient American history engraved in &quot;reformed Egyptian,&quot; on golden plates buried by an early American prophet. Instead, this key Mormon scripture has been shown to be a 19th-century work of fiction authored by Joseph Smith and perhaps others. Historically, most members of the Church of Jesus Christ of Latter-day Saints rarely read outside their scriptures and Church-approved literature. However, Mormons have recently begun to discover facts about LDS history that had previously been known to very few, mainly scholarly historians of Mormonism. Through the discovery of these primary historical sources, now available on numerous internet sites, intelligent and curious Mormons have reached a critical point. If they read, they have become disaffected and disoriented. Many are experiencing crises of faith.\r\n\r\nThe first third of &quot;An American Fraud. One Lawyer's Case against Mormonism,&quot; chronicles the Author's journey out of the Religion. The second part of the book is an exposé, including an analysis under the law. The Author, an experienced civil trial attorney, places the activities of Mormon leaders over almost two centuries in their proper legal framework, analyzing not only the misrepresentations, but the resulting damages: political, environmental and especially psycho-social.\r\n\r\nThe fraud committed by generations of Mormon leaders is that they have consistently misrepresented the facts surrounding the source of their scriptures. Neither the golden plates, nor writings by the Old Testament prophet Abraham, claimed to have been inscribed on purchased Egyptian papyri, ever existed. Furthermore, the claimed visitations by biblical apostles to restore lost priesthoods to Smith and his colleagues never occurred. Yet for decades LDS leaders have at least ignored, if not suppressed and grossly misrepresented, what has been proven to be the true facts surrounding Mormonism's origins, reworking and re-packaging the founding facts and the theology as necessary.\r\n\r\nBillions of U.S. dollars and foreign currency, donated by worldwide faithful members, have been used to expand the global commercial holdings of this corporate conglomerate. Meanwhile, deserving beneficiaries of the donations, the poor and distressed, admittedly receive just a small percentage of the Church's gross income","torrent":{"xt":"urn:btih:e23bec9f3f192c0ee50e134f8c80f3fceee3e2bf","amp;dn":"An+American+Fraud%3A+One+Lawyer%27s+Case+Against+Mormonism","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e23bec9f3f192c0ee50e134f8c80f3fceee3e2bf","infoHashBuffer":{"type":"Buffer","data":[226,59,236,159,63,25,44,14,229,14,19,79,140,128,243,252,238,227,226,191]},"announce":[],"urlList":[]}}