{"title":"latOut.3.Chaos.And.Destruction.Update.2-RELOADED","uid":6922259,"size":351603014,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e359e1e53b9bc0e31d0a2f876d7b60983ba5c421&amp;dn=latOut.3.Chaos.And.Destruction.Update.2-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MisterNobody","files":526,"time":1325313455,"description":"latOut 3: Chaos &amp; Destruction brings a new dimension to high speed destruction racing.\n\n\n\nFeel the adrenaline pulse through your veins as you barrel through insane race tracks against monster trucks, race cars, off road vehicles and much more.\n\n\n\nFlatOut 3: Chaos &amp; Destruction is demolition racing at its extreme. Real world physics with 9 different game modes, and over 47 different vehicles available. Players may choose to race, smash and destroy their opponents in a wide variety of online and offline options.\n\n\n\nLay waste to farm houses, fences, and then wreak havoc in a Detroit suburb, race up the walls in giant waste disposal sewers. Let the chaos begin as you race through over 60 different tracks, narrowly avoiding wrecking balls, Double Decker buses and much more.\n\n\n\nCreate as much destruction in the all new monster tuck mode.\n\n\n\nChoose from 20 different playable characters, select your weapon from the 47 available vehicles Create as much Chaos &amp; Destruction In stuntman mode anarchy rules create havoc with some rag doll fun.\n\n\n\nFlatOut 3: Chaos &amp; Destruction offers more vehicles, game modes and different ways to demolish your opponents before crossing the finish line.\n\n\n\nFeatures\n\n\n\nPhysics Engine capable of delivering over 20,000 fully destructible objects on every track\n\n47 vehicles with everything from muscle cars, monster trucks, tanks, bulldozers and more \n\n9 game modes plus challenge mode that incorporates all game modes into one \n\n62 track race \n\n10 racing environments with 62 different race tracks\n\n3 stunt mode environments with 12 stunt tracks\n\n9 Destruction Derby Battle environments\n\nAll new Monster Truck, Nightshift, Off Road, and Speed modes\n\n8 multiplayer modes with support for up to 16 players\n\nForce Feedback support for racing wheels\n\nLarger Destruction Derbies with 24 players\n\nComplete Chaos in Off-Road Mode\n\nComplete Destruction in All new Monster Truck Mode\n\nHead to Head in nightmarish, thunderous, rainy, fog weather in\n\nNight Shift Mode\n\n\n\n\n\n1. Copy and paste into your install directory, overwrite existing files\n\n2. Play the game\n\n3. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:e359e1e53b9bc0e31d0a2f876d7b60983ba5c421","amp;dn":"latOut.3.Chaos.And.Destruction.Update.2-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e359e1e53b9bc0e31d0a2f876d7b60983ba5c421","infoHashBuffer":{"type":"Buffer","data":[227,89,225,229,59,155,192,227,29,10,47,135,109,123,96,152,59,165,196,33]},"announce":[],"urlList":[]}}