{"title":"The Great Barrier Reef 3 Part Series  -=ShadowAD - pKcMvA=-","uid":6978429,"size":2255289166,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4a82b9bc11dcf5ede693b7badd109b28a99f272&amp;dn=The+Great+Barrier+Reef+3+Part+Series++-%3DShadowAD+-+pKcMvA%3D-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PKCMVA","files":3,"time":1327280040,"description":"The Great Barrier Reef\n\nNature Documentary Hosted By Monty Halls\nPublished By BBC In 2012\nEnglish Narration\n\nInformation\n\n------------------------------\n\nGreat Barrier Reef\nThree-part series exploring Australia's Great Barrier Reef, one of the natural wonders of the world and the largest living structure on our planet. Monty Halls explores its full 2000-kilometre length, from the wild outer reefs of the Coral Sea to the tangled mangrove and steaming rainforest on the shoreline; from large mountainous islands to tiny coral cays barely above sea level; from the dark\ndepths of the abyss beyond the reef to colourful coral gardens of the shallows. \nAlong the way he experiences the reef at its most dangerous and its most intriguing, and visits areas that have rarely been filmed, from the greatest wildlife shipwreck on earth to the mysterious seafloor of the lagoon, where freakish animals lurk under every rock.\n\n\n1) Natures Miracle\n\nThe first film explores the complex structure of the coral reef itself and the wildlife that lives on it. So vast it is visible from space, the reef is actually built by tiny animals in partnership with microscopic plants. It is a place full of surprises that is always changing, responding to the rhythms of weather, tide, sun and moon.\n\nWithin this magical and intensely crowded world, this episode reveals how the amazing reef creatures compete and co-operate - from deadly fish-hunting\nsnails to sharks that can walk on land, fighting corals and parrot fish that spin sleeping bags every night.\n\nRemote cameras, cutting-edge underwater macro and digital time-lapse photography, have captured many sequences which have never been filmed before, providing completely fresh perspectives on this extraordinary natural wonder.\n\n\n2) Reef To Rainforest\n\nThe Great Barrier Reef as a whole covers an area larger than Great Britain but amazingly only seven percent of it is coral reef. The rest is a variety of interconnected habitats including the world's oldest jungle, hundreds of islands, mangrove swamps, mysterious deep water gardens, vast sand flats and meadows of sea grass - all full of amazing wildlife.\n\nA giant deep-water lagoon connects all of these, and many of the creatures that live in it are almost impossibly weird - from giant hammerhead sharks to the bizarre 'pearl fish' that lives its life up a sea cucumber's bottom.\n\nMarine life here also exists in spectacular profusion, as on the 100-year-old shipwreck of the SS Yongala, considered to be the greatest wildlife wreck on earth. The connections between all these environments mean that, not only do they depend on each other, but without them the coral reef itself would not survive.\n\n\n3) Reef and Beyond\n\nThe Great Barrier Reef is vitally linked to the rest of the planet in many ways. Creatures travel for thousands of miles to visit in spectacular numbers, including tiger sharks, great whales, sea birds and the largest green turtle gathering on the planet alien creatures that are rarely seen, like nautilus, also rise out of the deep to visit the reef's warm waters.\n\nWeather systems traveling from across the Pacific also affect the whole reef, including mighty cyclones that bring destruction and\nchaos to the coral and the creatures that live on it. And it is weather patterns and climate change on a global scale that are likely to shape the future of the Great Barrier Reef and all its wildlife..\n\nFurther Information &lt;a href=&quot;\nhttp://www.bbc.co.uk/nature/places/Great_Barrier_Reef&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/nature/places/Great_Barrier_Reef&lt;/a&gt;\n\nImage:\t\t   624x352\nAudio:\t\t   Lame MP3\nBit Rate:\t   128kbps\nVideo:\nFrame Rate:\t   25\nData Rate:\t   1660kbps\nVideo Sample Size: 24 Bit\nVideo Compression: XVID","torrent":{"xt":"urn:btih:e4a82b9bc11dcf5ede693b7badd109b28a99f272","amp;dn":"The+Great+Barrier+Reef+3+Part+Series++-%3DShadowAD+-+pKcMvA%3D-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a82b9bc11dcf5ede693b7badd109b28a99f272","infoHashBuffer":{"type":"Buffer","data":[228,168,43,155,193,29,207,94,222,105,59,123,173,209,9,178,138,153,242,114]},"announce":[],"urlList":[]}}