{"title":"Portal 2","uid":6907805,"size":10505152266,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e61d4ab99737423bdc004069532749065c78488b&amp;dn=Portal+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"steveman","files":2464,"time":1324664017,"description":"My last upload of Portal 2 was a mistake, I uploaded the wrong file on accident.  So here is the proper file, as you can see this torrent is 9.** GB so you know its the real deal.   \n\nSOURCE:\nPortal 2 DVDRIP-Unleashed\n\n\n\nPortal 2 is an action shooter game from Valve Software that draws from the original formula of innovative gameplay, story, and music, which earned the original Portal more than 70 industry accolades.Portal 2 is an action shooter game from Valve Software that draws from the original formula of innovative gameplay, story, and music, which earned the original Portal more than 70 industry accolades. The single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion that guided them through the original game. The game\\\\\\\\\\\\\\'s two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything that they thought they knew about portals. Success will require them to not only act cooperatively, but to also think cooperatively.\t\t\n\n\n-steveman","torrent":{"xt":"urn:btih:e61d4ab99737423bdc004069532749065c78488b","amp;dn":"Portal+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e61d4ab99737423bdc004069532749065c78488b","infoHashBuffer":{"type":"Buffer","data":[230,29,74,185,151,55,66,59,220,0,64,105,83,39,73,6,92,120,72,139]},"announce":[],"urlList":[]}}