{"title":"Fonejacker Android","uid":6950388,"size":17024242,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:e62d1569cb63cabead1668e53ec59bfe2c6997af&amp;dn=Fonejacker+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cad40","files":1,"time":1326380090,"description":"Description\nThe official Fonejacker app, with well over 220 phrases for pranking friends!\nThis is the OFFICIAL app of Fonejacker, including Brian Badonde from Facejacker.\nPrank your friends and family as the FONEJACKER with the official app - see why this soundboard and prank app was the most popular entertainment app for iPhone in 2010!\nFrom the creators of the BAFTA winning Fonejacker comes the official Fonejacker Android app. Featuring extensive soundboards of your favourite characters voiced by 'Fonejacker' Kayvan Novak, combining classic catchphrases with new quotes exclusive to this app. Characters like Facejacker art critic Brian Badonde, wheeler dealer Terry Tibbs, Mr Doovde, shonky DVD salesman Charlie Wong, Dufrais, The Mouse, Irish Mike and Mr Internet Service Providings appear for your amusement.\nRing a friend using AN ADDITIONAL phone on speakerphone, prank them and record it at the same time!\n* PLEASE NOTE - we strongly recommend you use an additional phone on speakerphone and use your device to play the audio and record only *\nIn addition to this prank-tastic content, the app also features an array of behind the scenes material from series 1 &amp; 2 of Fonejacker, and now with seasonal Christmas video content too!\nUsers will also be able to access Fonejacker ring tones free of charge and purchase any and every available Fonejacker product from the in app shop.\n\nCopyright Hat Trick. All rights reserved.\nThe sound has been maximised within a fraction of distortion, it is not possible to get it any louder! If you find it too low you need to turn your volume up or plug in external powered speakers.\nInternet connection is required for watching videos, browsing merchandise, purchasing extra content and obtaining ring tones.","torrent":{"xt":"urn:btih:e62d1569cb63cabead1668e53ec59bfe2c6997af","amp;dn":"Fonejacker+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62d1569cb63cabead1668e53ec59bfe2c6997af","infoHashBuffer":{"type":"Buffer","data":[230,45,21,105,203,99,202,190,173,22,104,229,62,197,155,254,44,105,151,175]},"announce":[],"urlList":[]}}