{"title":"The Lodger: Shakespeare on Silver Street","uid":16024718,"size":4911830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e65e003f8b69953b40a68abe71a38fd384dbdd3e&amp;dn=The+Lodger%3A+Shakespeare+on+Silver+Street&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marty14","files":1,"time":1476371356,"description":"The Lodger: Shakespeare on Silver Street - Charles Nicholl [epub]\r\n\r\nAcclaimed author Charles Nicholl presents a brilliantly drawn detective story with entirely new insights into Shakespeare's life. In 1612, William Shakespeare gave evidence in a court case at Westminster; it is the only occasion on which his actual spoken words were recorded. The case seems routine — a dispute over an unpaid marriage dowry — but it opens an unexpected window into the dramatist's famously obscure life.\r\n\r\nUsing the court testimony as a springboard, acclaimed nonfiction writer Charles Nicholl examines this fascinating period in Shakespeare's life. With evidence from a wide variety of sources, Nicholl creates a compelling, detailed account of the circumstances in which Shakespeare lived and worked during the time in which he wrote such plays as Othello, Measure for Measure, and King Lear. The case also throws new light on the puzzling story of Shakespeare's collaboration with the hack author and violent brothel owner George Wilkins.\r\n\r\nIn The Lodger Shakespeare we see the playwright in the daily context of a street in Jacobean London: &quot;one Mr. Shakespeare,&quot; lodging in the room upstairs. Nicholl is one of the great historical detectives of our time and in this atmospheric and exciting book he has created a considerable rarity — something new and original about Shakespeare","torrent":{"xt":"urn:btih:e65e003f8b69953b40a68abe71a38fd384dbdd3e","amp;dn":"The+Lodger%3A+Shakespeare+on+Silver+Street","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65e003f8b69953b40a68abe71a38fd384dbdd3e","infoHashBuffer":{"type":"Buffer","data":[230,94,0,63,139,105,149,59,64,166,138,190,113,163,143,211,132,219,221,62]},"announce":[],"urlList":[]}}