{"title":"Cowboys and Aliens (2011) DVDRip XviD","uid":6916155,"size":1245890562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e8ac6c2adc3763c6d4f95a4e679e97a09ec9b347&amp;dn=Cowboys+and+Aliens+%282011%29+DVDRip+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"{Blitz}","files":-1,"time":1325038679,"description":"The Old West.. where a lone cowboy leads an uprising against a terror from beyond our world. 1873. Arizona Territory. A stranger with no memory of his past stumbles into the hard desert town of Absolution. The only hint to his history is a mysterious shackle that encircles one wrist. What he discovers is that the people of Absolution don\\\\\\'t welcome strangers, and nobody makes a move on its streets unless ordered to do so by the iron-fisted Colonel Dolarhyde (Ford). It\\\\\\'s a town that lives in fear. But Absolution is about to experience fear it can scarcely comprehend as the desolate city is attacked by marauders from the sky. Screaming down with breathtaking velocity and blinding lights to abduct the helpless one by one, these monsters challenge everything the residents have ever known. Now, the stranger they rejected is their only hope for salvation. As this gunslinger slowly starts to remember who he is and where he\\\\\\'s been, he realizes he holds a secret that could give the town a fighting chance against the alien force. With the help of the elusive traveler Ella (Olivia Wilde), he pulls together a posse comprised of former opponents-townsfolk, Dolarhyde and his boys, outlaws and Apache warriors-all in danger of annihilation. United against a common enemy, they will prepare for an epic showdown for survival.\t","torrent":{"xt":"urn:btih:e8ac6c2adc3763c6d4f95a4e679e97a09ec9b347","amp;dn":"Cowboys+and+Aliens+%282011%29+DVDRip+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ac6c2adc3763c6d4f95a4e679e97a09ec9b347","infoHashBuffer":{"type":"Buffer","data":[232,172,108,42,220,55,99,198,212,249,90,78,103,158,151,160,158,201,179,71]},"announce":[],"urlList":[]}}