{"title":"STALKER[1+2+3]-.-alforo","uid":15819199,"size":9772629730,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ea348871ff9f7db96d9aec3c71fc9317cd19d1e2&amp;dn=STALKER%5B1%2B2%2B3%5D-.-alforo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alfrg72","files":2,"time":1473737617,"description":"shadow of chernobil +clear sky  +call of pripyat .Estos videojuegos permiten una modalidad de juego en primera persona. El personaje asignado tiene como nombre El Marcado, debido a que fue encontrado de casualidad, inconsciente y con una marca en el brazo que dice &quot;S.T.A.L.K.E.R.&quot;.\r\n\r\nEn el juego se debe luchar contra mutantes que fueron afectados por radiación, militares, bandas de criminales y STALKERS rivales. También contiene elementos sobrenaturales, como un objeto desconocido llamado &quot;El Genio&quot;, que según las historias se encontraría dentro de la Central Nuclear, y tiene la capacidad de conceder cualquier deseo que se le pida.\r\nTrama\r\n\r\nLa historia se desarrolla en el año 2012 en un lugar llamado &quot;La Zona&quot;, situada en la Central Nuclear de Chernobyl y sus proximidades, abarcando la ciudad abandonada de &quot;Pripyat&quot;. La geografía en el juego considera las localidades reales con algunas modificaciones en cuanto a posición y tamaño.\r\n\r\nEste juego tiene lugar luego de una &quot;segunda explosión nuclear&quot; ficticia que ocurre en el año 2006 causada por experimentos de un grupo de científicos de la extinta Unión Soviética, quienes aspiraban a crear un sistema de radares y transmisión para controlar mentalmente a la población, logrando crear una utopía controlada. En el momento en que los experimentos afectan una capa de la atmósfera llamada noosfera, se libera una cantidad de energía enorme, tan intensa que desdibuja el paisaje en bizarras y surreales anomalías, tan bellas como letales. En dichas anomalías se forman objetos conocidos como artefactos, los que le dan al portador capacidades sobrehumanas. Los STALKERS se dedican a buscar y vender artefactos","torrent":{"xt":"urn:btih:ea348871ff9f7db96d9aec3c71fc9317cd19d1e2","amp;dn":"STALKER%5B1%2B2%2B3%5D-.-alforo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea348871ff9f7db96d9aec3c71fc9317cd19d1e2","infoHashBuffer":{"type":"Buffer","data":[234,52,136,113,255,159,125,185,109,154,236,60,113,252,147,23,205,25,209,226]},"announce":[],"urlList":[]}}