{"title":"Hawker Hunter.avi","uid":6896322,"size":364326912,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eafeb624c00b7dbc92c77be742d35d2ff5a0de71&amp;dn=Hawker+Hunter.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dawgnaw","files":1,"time":1324219298,"description":"The Hawker Hunter is a subsonic British jet aircraft developed in the 1950s. The single-seat Hunter entered service as a manoeuvrable fighter aircraft, and later operated in fighter-bomber and reconnaissance roles in numerous conflicts. Two-seat variants remained in use for training and secondary roles with the Royal Air Force (RAF) and Royal Navy until the early 1990s. The Hunter was also widely exported, serving with 21 other air forces; 50 years after its original introduction it is still in active service, operating with the Lebanese Air Force.\nOn 7 September 1953, the modified first prototype broke the world air speed record, achieving 727.63 mph (1,171.01 km/h). Hunters were also used by two RAF display teams; the &quot;Black Arrows&quot;, who on one occasion looped a record-breaking 22 examples in formation, and later the &quot;Blue Diamonds&quot;, who flew 16 aircraft. Overall, 1,972 Hunters were produced by Hawker Siddeley and under licence. In British service, the aircraft was replaced by the Hawker Siddeley Harrier and the McDonnell Douglas Phantom.","torrent":{"xt":"urn:btih:eafeb624c00b7dbc92c77be742d35d2ff5a0de71","amp;dn":"Hawker+Hunter.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eafeb624c00b7dbc92c77be742d35d2ff5a0de71","infoHashBuffer":{"type":"Buffer","data":[234,254,182,36,192,11,125,188,146,199,123,231,66,211,93,47,245,160,222,113]},"announce":[],"urlList":[]}}