{"title":"Don't say a word  2001 Multilang.+subs Retail  TBS","uid":6914919,"size":4682491974,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebbe9bb616aadf43be7414b5230de84d323e3d82&amp;dn=Don%5C%27t+say+a+word++2001+Multilang.%2Bsubs+Retail++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Saggin","files":-1,"time":1324991623,"description":"Don't say a word  2001 Multilang.+subs Retail\n\n[img]http://i06.s3.imagehosting.ws/2011-08-19/688226/1310061359559.jpg[/img]\n\nRegie: Gary Fleder\nCast: Michael Douglas, Famke Janssen en Brittany Murphy\n\nGenre: Thriller\nLengte: 115 minuten\n\nDe tijd dringt voor Dr. Nathan Conrad (Michael Douglas) wanneer z'n dochtertje ontvoerd wordt door \ngewetenloze criminelen. Bovendien houden zij constant zijn vrouw die met een gebroken been thuis zit (Famke Jansen) met camera's in de gaten.\nDe kidnappers vragen echter geen losgeld aan Dr. Conrad, maar hij moet een 'dienst 'verlenen. Hij moet een zes-cijferige code zien te ontfutselen uit het verwarde geheugen van een psyhisch gestoorde tiener (Brittany Murphy) die eigenlijk niet van plan is te praten. De ondervoerders dreigen Nathan's dochtertje te vermoorden als hij niet snel reslutaat boekt. Hierdoor wordt hij gedwongen de code op onorthodoxe wijze te verkrijgen, wat een bloedstollend psychologisch gevecht opgelevert.\n\n[img]http://s11.allstarpics.net/images/orig/i/f/ifobwvzp63slbovl.jpg[/img]\n\nExtra\nDe prijswinnende spannende roman van Andrew Klavan werd geroemd om het inzicht in de criminele \ngeest. De verfilming ervan begint gepast intrigerend en opwindend, zodat de hoop gewekt wordt op de nuances die in het boek te vinden zijn. Uiteindelijk trapt Don't Say a Word in de kennelijk moeilijk te omzeilen val die Hollywoodformule heet en zijn de slechteriken gewoon slecht en de helden gewoon geweldig. Toch maken de acteerprestaties Fleders film de moeite waard. Douglas' personage psychiater Conrad moet, om zijn dochter te redden uit de handen van een gestoorde kidnapper (Bean), in korte tijd een mysterieus cijfer weten te ontfutselen aan patiÃƒÂ«nte Elisabeth (Murphy).\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/885&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/885&lt;/a&gt;\n\nRegie: Gary Fleder\nCast: Michael Douglas, Famke Janssen en Brittany Murphy\n\nGenre: Thriller\nLengte: 115 minuten\n\nTime is running out for Dr. Nathan Conrad (Michael Douglas) when his daughter is kidnapped by \nunscrupulous criminals. Addition, they keep constant woman who sits at home with a broken leg (Famke Jansen) with cameras in mind.\nThe kidnappers ask no ransom to Dr. Conrad, but he has a 'service' provision. He must see a six-digit code to steal from the confused memory of a disturbed teenager psyhisch (Brittany Murphy) who really does not intend to speak. Among the managers threaten to murder Nathan's daughter if he did not quickly pressing the material book. This forced the code to obtain an unorthodox manner, which is a chilling psychological battle up supplies.\nadditional\nThe award-winning novel by Andrew Klavan exciting was praised for understanding the criminal mind. \nThe film proper begins its intriguing and exciting, so the hopes are the nuances in the book to find. Do not Say a Word finally kicks in obviously difficult to avoid that trap hot Hollywood formula and the bad guys are just evil and the heroes just great. Still, the acting performances make the film worth Fleders. \nDouglas' character psychiatrist Conrad, in order to save his daughter from the hands of a deranged \nkidnapper (Bean), a mysterious figure in a short time managed to wrest patient to Elizabeth (Murphy).\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0260866&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0260866&lt;/a&gt;\n\n\nBron                                   : Retail \nSOORT DVD                    : DVD5\nAUDiO                               : DD 5.1 Engels/Frans\nONDERTiTELiNG            : Nederlands/Frans/Engels\nMENU                                : Ja\nExtra's                                : Ja\nCover                                 : meegepost\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:ebbe9bb616aadf43be7414b5230de84d323e3d82","amp;dn":"Don%5C%27t+say+a+word++2001+Multilang.%2Bsubs+Retail++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebbe9bb616aadf43be7414b5230de84d323e3d82","infoHashBuffer":{"type":"Buffer","data":[235,190,155,182,22,170,223,67,190,116,20,181,35,13,232,77,50,62,61,130]},"announce":[],"urlList":[]}}