{"title":"MUTYALA MUGGU [1975] jettij.FLV.","uid":6911434,"size":595357748,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebe044ded21ad27066ca6d7125197aec8084d84b&amp;dn=MUTYALA+MUGGU+%5B1975%5D+jettij.FLV.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jettij","files":1,"time":1324834700,"description":"\nMuthyala Muggu (Telugu) is a 1975 film adaption of Uttara Ramayana from the writer-director duo of Ramana and Bapu. The film stars Sreedhar, Sangeetha, Rao Gopal Rao, Mukkamala, Allu Ramalingaiah and Nutan Prasad. The movie introduced Sangeetha and Rao to the Telugu screen. The movie revolves around the nuances of a husband and wife.\n\nMandolin composition of about 15-minutes by Sajjad Hussain was used in this film.\n\n\nPlot:\n\nRaja Rao Bahadur (Kantha Rao)is the head of a wealthy and charitable landlord family who has a young son Sreedhar. At his son's request, Rao helps his college friend (Hari)with the costs of higher education abroad. Hari is grateful and invites Sreedhar to his sister Laxmi's (Sangeetha) wedding in the village. Due to unusual circumstances, Sreedhar ends up marrying Laxmi. This enrages Mukkamala who is the Raja's brother-in-law, who was hopeful of getting his daughter (Jaya Malini) married to Sreedhar. What makes matters worse is that Laxmi wins over the royal household with her humility and good nature while Sreedhar falls in love with her innocence. She accidentally discovers a stash of the estate jewels in a well. Gurunatham and Mukkamala try to implicate the Priest. Laxmi suggests that since they do not know conclusively as to who stole jewels, they should spare the Priest. Mukkamala, at the suggestion of the estate manager Joginatham (Allu Ramalingiah), then approaches Contractor (Rao Gopala Rao). Contractor agrees to break up the couple. But Contractor eyes the entire estate and its valuables and he entraps Mukkamala. He uses Kishtaiyya (Nutan Prasad) and creates suspicion in Sreedhar's mind with a sinister plan. Sreedhar falls prey to his doubts, comes to the conclusion that Laxmi is cheating on him and is only interested in his wealth. He sends off a pregnant Laxmi with all the family jewels. Laxmi gives the jewels off to Joginatham and decides to end her life. She is rescued by the Priest at whose house she gives birth to twins ( boy and a girl). Meanwhile back at the estate, Sreedhar is depressed and loses interest in life and curses out Mukkamal when he proposes that Sreedhar should marry his daughter. Contractor then fixes up Kishtayya with Jaya Malini, and proceeds to squeeze Mukkamala out of his money. After that, he takes possession of several antiques that Joginatham was trying to sell. All that's left is the Deity's Jewels. The Raja who is distraught with the whole lifeless situation of the estate decides to leave the Deity's Jewels in the temple itself and wanders the villages. He stumbles upon Laxmi's kids (his grandkids), discovers the truth and requests Laxmi to come back. Laxmi refuses to come back and declares that this does not work with recommendations and that Sreedhar himself has to accept his mistake and come to her and ask her to come back. The Raja with the help of the kids and Sreedhar's friend hatch a plan to set things right with Sreedhar and beat the Contractor at his own game.\n\n***********************************************************************************\n\nDirected by \t:\tBapu\n\nProduced by \t:\tMaddali Venkata Lakshmi Narasimha Rao\n\nWritten by \t:\tMullapudi Venkata Ramana Valmiki\n\nMusic by \t:\tK. V. Mahadevan\n\nCinematography \t:\tIshan Arya\n\nDistributed by \t:\tSri Rama Chitra\n\nRunning time \t:\t165 min\n\nLanguage \t:\tTelugu\nYear\t\t:\t1975\n\n***********************************************************************************\n\nCast:\n\n    Sridhar as Sridhar, Raja's son\n    Sangeetha as Mrs. Lakshmi Sridhar\n    Kanta Rao as Raja Rao Bahadur\n    Rao Gopal Rao as Contractor\n    Allu Ramalingaiah as Joginadham\n    Mukkamala as Raja's brother-in-law\n    Nutan Prasad as Kishtaiah\n    Jayamalini\n\n***********************************************************************************\n\nMusical Numbers:\n\n    &quot;Enthati Rasikudavo Teliseraa&quot;\n\n        Lyrics by C. Narayana Reddy\n\n    &quot;Gogulu Pooche Gogulu Kache O Laccha Gummadi&quot;\n\n        Lyrics by C. Narayana Reddy\n\n    &quot;Edo Edo Annadi Eee masaka veluturu&quot;\n\n        Lyrics by C. Narayana Reddy\n\n    &quot;Nidurinche Tthotaloki Paata Okati Vachindi&quot;\n\n        Lyrics by Gunturu Seshendra Sharma\n\n    &quot;Muthyamantha Pasupu Mukhamento Chaaya&quot;\n\n        Lyrics by Arudra\n\n    &quot;Sri rama jayarama seetharama&quot;\n\n        Sung by M. Balamuralikrishna\n\n***********************************************************************************\n\nAwards:\n\n    1976 National Film Award for Best Cinematography - Ishan Arya\n    1975 National Film Award for Best Feature Film in Telugu.\n\n***********************************************************************************\n\n^^^^^^^^^^^^^ KINDLY SEED GUYS..\n\nTXS,.\n\n\n\n","torrent":{"xt":"urn:btih:ebe044ded21ad27066ca6d7125197aec8084d84b","amp;dn":"MUTYALA+MUGGU+%5B1975%5D+jettij.FLV.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe044ded21ad27066ca6d7125197aec8084d84b","infoHashBuffer":{"type":"Buffer","data":[235,224,68,222,210,26,210,112,102,202,109,113,37,25,122,236,128,132,216,75]},"announce":[],"urlList":[]}}