{"title":"Cuckold Sessions - Whitney Fears","uid":6928480,"size":508406501,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ec631409fdacdfe5417a99f7925ade7f062f4a90&amp;dn=Cuckold+Sessions+-+Whitney+Fears&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mutiny0","files":1,"time":1325588338,"description":"\nA stroll in the park with my boyfriend became much more than either of us ever expected. We knew we were on the wrong side of the tracks when we came across some local gangsters who mad dogged my boy and I. After some chit chat I realized they'd rather fuck my tight , white body than knock his white ass out. I knew they had other plans in mind since I could see them undressing me with their eyes and I had a feeling they wondered what my titties looked like with no shirt on. Those black thugs were about to find out because it had been a while since my last filling of black jizz and I was fiending for it bad! I had the boyfriend take me to their place and he watched me take turns on all three black dicks. I didn't think he would be down for watching all of this but it was a better alternative then him spending the weekend in the E.R. He had a court side seat as I went through the gauntlet of black cock but I was up to the challenge. Normally I fuck with his limp white dick so I knew this would be no walk in the park, hahaha.. I never felt like more than a whore as I did today since those black studs didn't stop pounding my mouth and pussy. I didn't expect him to suck up the black mess left behind but he did as I asked since I would deny him future entrance to my pussy if he didn't.\n\n &lt;a href=&quot;\nhttp://www.cuckoldsessions.com/tour/interracial-cuckolds/whitney_fears/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cuckoldsessions.com/tour/interracial-cuckolds/whitney_fears/&lt;/a&gt;","torrent":{"xt":"urn:btih:ec631409fdacdfe5417a99f7925ade7f062f4a90","amp;dn":"Cuckold+Sessions+-+Whitney+Fears","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec631409fdacdfe5417a99f7925ade7f062f4a90","infoHashBuffer":{"type":"Buffer","data":[236,99,20,9,253,172,223,229,65,122,153,247,146,90,222,127,6,47,74,144]},"announce":[],"urlList":[]}}