{"title":"Toto.25th.Anniversary.Live .In.Amsterdam.2003.DVDR.PAL.snuttebul","uid":6952731,"size":4690155694,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ed545f8fc726cf615ea95da20017a5639f7eab67&amp;dn=Toto.25th.Anniversary.Live+.In.Amsterdam.2003.DVDR.PAL.snuttebul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1326462667,"description":"Toto.25th.Anniversary.Live.In.Amsterdam.2003.DVDR.PAL.snuttebullen\n\n\nTotos 25th Anniversary Live in Amsterdam is a musical celebration of the band\\'s career. It was shot live at the Heineken Arena, in Amsterdam on February 25th, 2003.\n\nToto was formed in Los Angeles in 1978 by David Paich, Steve Lukather, Bobby Kimball, Steve and Jeff Porcaro and David Hungate. The band members met in high school and at studio sessions in the 1970\\'s, becoming some of the busiest session musicians in the business. Porcaro was one of the top studio drummers in pop music during the 1970\\'s and 1980\\'s. While still a teenager he began playing with Sonny and Cher, and during the next two decades he played behind acts ranging from Barbara Streisand to Warren Zevon. Porcaro played with Steely Dan on Pretzel Logic, with Boz Scaggs on Silk Degrees and with Michael Jackson on Thriller.\n\nToto released its self-titled debut album in 1978, which held the Top 10, sold two-million copies, and spawned the gold Top 10 single Hold The Line. The gold-selling Hydra and Turn Back were not so triumphant, but Toto IV was a multi-platinum Top Ten hit, featuring the number-one hit Africa and Top Tens Rosanna, (about Rosanna Arquette) and I Won\\'t Hold You Back. At the 1982 Grammys, Rosanna became award-winning Record of the Year, Best Pop Vocal Performance, and Best Instrumental Arrangement with Voca; and Toto IV won awards for Album of the Year, Best Engineered Recording, and Best Producer. In 1984, another Porcaro brother, Mike, joined on bass, replacing Hungate. Then lead singer Kimball quit and was replaced by Dennis Fergie Frederiksen.\n\nSimon Phillips spent weeks mixing the upcoming TOTO 25th Anniversary DVD. It sounds great, he says. The DVD will feature the Amsterdam show and also some b-roll backstage footage from Europe and Asia with scenes before the shows, on the bus and on the road.\n\nTrack List\n\n01. Girl Goodbye, Goodbye Elenore, Child\\'s Anthem, I\\'ll Supply The Love (Medley)\n02. Gift With A Golden Gun\n03. While My Guitar Gently Weeps\n04. Bodhisattva\n05. Africa\n06. David Paich - Solo\n07. Steve Lukather - Solo\n08. Waiting For Your Love, George Porgy, Lion, English Eyes, Till The End (Medley)\n09. I Won\\'t Hold You Back\n10. Rosanna\n11. Afraid of Love\n12. Hold The Line\n13. Next To You\n14. Home Of The Brave\n15. White Sister\n16. End Credits\n\n     |                       |               \n,---.|---.,---.,---.,---.,---|.   .,-.-.,---.\n`---.|   |,---||    |---'|   ||   || | ||   |\n`---'`   '`---^`    `---'`---'`---'` ' '|---'.org\nMusic,Appz,Xbox360,Tv,Movies,Ps3,Games..|     \n","torrent":{"xt":"urn:btih:ed545f8fc726cf615ea95da20017a5639f7eab67","amp;dn":"Toto.25th.Anniversary.Live+.In.Amsterdam.2003.DVDR.PAL.snuttebul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed545f8fc726cf615ea95da20017a5639f7eab67","infoHashBuffer":{"type":"Buffer","data":[237,84,95,143,199,38,207,97,94,169,93,162,0,23,165,99,159,126,171,103]},"announce":[],"urlList":[]}}