{"title":"The Skulls Trilogy DVDrip.Linzi1983x","uid":6973420,"size":2518175790,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ee30e2ebb847e0240dbe570bae2e51ced61dcc45&amp;dn=The+Skulls+Trilogy+DVDrip.Linzi1983x&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"FatFreddy83","files":4,"time":1327163014,"description":"THE SKULLS\n\nLuke McNamara, a college senior from a working class background joins a secret elitist college fraternity organization called &quot;The Skulls&quot;, in hope of gaining acceptance into Harvard Law School. At first seduced by the club's trapping of power and wealth, a series of disturbing incidents, such as his best friends suicide, leads Luke to investigate the true nature of the organization and the truth behind his friends supposed suicide. He starts realizing that his future and possibly his life is in danger.\n\n\nTHE SKULLS 2\n\nAfter joining the Skulls, Ryan Sommers (Robin Dunne) is warned not to betray any secrets about the organization or its high-powered members. However, when Ryan witnesses a murder within the Skulls' private chambers, he finds that the closer he gets to revealing the truth - the more dangerous life becomes\n\n\nTHE SKULLS 3\n\nTaylor Brooks is a young, overachieving coed at a posh New England college whom decides to pledge the secret society The Skulls whom her father and many of the faculty are members and whom her older brother died years earlier during an initiation practice. But Taylor's willingness to break the all-male Skulls taboo of pledging as the first woman to do so put her at odds with the other pledges and alumni members. When she finally succeeds in fulfilling her membership despite inference from the Skull members, she soon finds herself in hot water when her boyfriend is found murdered, and she's accused of the crime. Taylor must find a way to prove her innocence and find the real killer despite the fact that no one around her can be trusted\n\n","torrent":{"xt":"urn:btih:ee30e2ebb847e0240dbe570bae2e51ced61dcc45","amp;dn":"The+Skulls+Trilogy+DVDrip.Linzi1983x","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee30e2ebb847e0240dbe570bae2e51ced61dcc45","infoHashBuffer":{"type":"Buffer","data":[238,48,226,235,184,71,224,36,13,190,87,11,174,46,81,206,214,29,204,69]},"announce":[],"urlList":[]}}