{"title":"YoutubersLife v0.7.15u2","uid":15927495,"size":459344782,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f02a937e1945a742ce8c8973b88372024c0d813f&amp;dn=YoutubersLife+v0.7.15u2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Andrewillemse123","files":1,"time":1475324045,"description":"NO Crack Needed JUST INSTALL AND ENJOY \r\n\r\nPLEASE SEED \r\n\r\nYoutubers Life is the ultimate life simulation/tycoon videogame in which you can effortfully become the world’s greatest video blogger in history by editing videos, expanding the amount of fans and turning yourself into a wealthy fellow. Create your character —customize it as you wish, there are thousands of hillarous combinations— and start making your first broadcasts in the cozy room at your parents’ where you have grown up since you were little. Record gameplay sessions, buy new and classic consoles, keep an eye on daily tasks, and socialize yourself to increase your popularity while you have to deal with fans, friends, family and time management! \r\n\r\n\r\nMake your own videos \r\nEditing your own videos has never been so immersive! Follow the whole process from A to Z and publish your broadcasts on Internet! Purchase your favourite titles online, get them delivered at home and start recording your gameplay sessions. Improve your videos as you become the greatest video blogger ever! \r\n\r\n\r\nGet fun! \r\nBeing a vlogger is not only about recording videos and see how many viewers you obtain —you also need to cool down and have some fun in your daily life! Go to the cinema to watch the latest film releases, attend presentations of new games, chill out in the club or party in a luxurious yacht! Meet new friends and discover your other half while you keep thinking about the next broadcast you want to make when you get back home. \r\n\r\n\r\nBecome a Celebrity \r\nThe more viewers you reach the more popular you’ll be! As you increase your particular network, more VIP’s will be interested in meeting you in person. Besides, important high-tech and gaming brands will contact you and you will eventually meet other famous youtubers. Your fans will battle with all their might to get your autograph!\r\n\r\nSystem Requirements\r\nWindows Mac OS X\r\nMINIMUM: \r\nOS: Windows XP \r\nProcessor: Intel i3 or equivalent \r\nMemory: 2 GB RAM \r\nGraphics: 512MB VRAM (NVIDIA GeForce) \r\nDirectX: Version 9.0c \r\nStorage: 3 GB available space \r\nAdditional Notes: Better played at 16:9 resolutions. Check your quality settings in the game if you experience performance problems","torrent":{"xt":"urn:btih:f02a937e1945a742ce8c8973b88372024c0d813f","amp;dn":"YoutubersLife+v0.7.15u2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f02a937e1945a742ce8c8973b88372024c0d813f","infoHashBuffer":{"type":"Buffer","data":[240,42,147,126,25,69,167,66,206,140,137,115,184,131,114,2,76,13,129,63]},"announce":[],"urlList":[]}}