{"title":"Jungla de cristal 4.0 1080p AC3 DTS Esp Ing AC3","uid":6984985,"size":5690177634,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f2922649be5b2d994c67d946507b8de9be74a4e3&amp;dn=Jungla+de+cristal+4.0+1080p+AC3+DTS+Esp+Ing+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kukoman","files":1,"time":1327534866,"description":"En verdad que la invitaciÃƒÂ³n es sumamente atractiva y por momentos uno como espectador tiene la tentaciÃƒÂ³n de llevarse por el desborde de acciÃƒÂ³n y de efectos especiales alejÃƒÂ¡ndose de la lÃƒÂ³gica y del sentido comÃƒÂºn. Pero por allÃƒÂ­, uno reacciona y se cuestiona si lo que estÃƒÂ¡ viendo no es un producto extremadamente exagerado, de dimensiones exorbitantes, lleno de licencias narrativas y de fanfarronerÃƒÂ­a ilimitada. Y la conclusiÃƒÂ³n es que lo es. En mi caso particular, pienso que es una alternativa pasable y pasatista, sin dudas que la mÃƒÂ¡s grandilocuente de la saga y que me deja bien claro que esta vez, la aventura toma dimensiones muy pretensiosas hasta el punto de que John McClane es hÃƒÂ©roe nacional. La trama se extralimita, se llena de alternativas excedidas que buscan en todo momento el impacto visual y el lucimiento de toda la parafernalia de efectos que demuestran que en este producto se puso mucho dinero y pocas ideas. Bruce Willis demuestra que estÃƒÂ¡ intacto para su tÃƒÂ­pico papel de duro a pesar de haber pasado 19 aÃƒÂ±os de &quot;Die hard&quot;, pasa la prueba en forma impecable y demuestra que es un grande en carisma y despliegue fÃƒÂ­sico aÃƒÂºn a los 52 aÃƒÂ±os. Aunque lamentablemente desde el guiÃƒÂ³n se olviden de su personaje como hombre ordinario y se le de un volumen estilo superhÃƒÂ©roe que no termina de encajar dentro del espÃƒÂ­ritu al que nos tenÃƒÂ­a acostumbrado McClane en las anteriores entregas. Timothy Olyphant no me convence como villano, le falta ÃƒÂ­mpetu y persuasiÃƒÂ³n para ser la contrapartida del seÃƒÂ±or Willis. Aunque sÃƒÂ³lo sea un pirata informÃƒÂ¡tico, no me llegÃƒÂ³ a satisfacer su desempeÃƒÂ±o. Me quedo con la limitadÃƒÂ­sima Maggie Q y sus coreografÃƒÂ­as, aÃƒÂºn asÃƒÂ­ transmiten algo de entusiasmo. Justin Long, insulso y endeble relleno que no aporta mucho con su personaje. Ni siquiera una cuota de humor que hubiera sido de agradecer para mantener el alma de la saga. En fin, secuencias de acciÃƒÂ³n que impresionan aÃƒÂºn en una ÃƒÂ©poca donde los efectos especiales son moneda corriente. Pero ÃƒÂ©stos de Die hard 4.0 son antolÃƒÂ³gicos sin dudas, al igual que las fantasmadas tan bravuconas que se concatenan para dar vida al argumento de esta cuarta entrega mÃƒÂ¡s cercana a la ficciÃƒÂ³n que a la acciÃƒÂ³n propiamente dicha.","torrent":{"xt":"urn:btih:f2922649be5b2d994c67d946507b8de9be74a4e3","amp;dn":"Jungla+de+cristal+4.0+1080p+AC3+DTS+Esp+Ing+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2922649be5b2d994c67d946507b8de9be74a4e3","infoHashBuffer":{"type":"Buffer","data":[242,146,38,73,190,91,45,153,76,103,217,70,80,123,141,233,190,116,164,227]},"announce":[],"urlList":[]}}