{"title":"Metro 2033 Redux-.-alforo","uid":15818922,"size":8624355328,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f57262819b25b0b21884f395b7230f81c98cb36f&amp;dn=Metro+2033+Redux-.-alforo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alfrg72","files":1,"time":1473733163,"description":"El juego se desarrolla desde la perspectiva de un muchacho llamado Artyom. La historia tiene lugar en un Moscú post-apocalíptico, mayoritariamente dentro del sistema del metro de la capital, donde el protagonista fue criado, pero ocasionalmente el jugador debe ir a la superficie para completar misiones o conseguir munición.\r\n\r\nLos lugares visitados en el juego reflejan la atmósfera oscura de los túneles, aunque en una forma mucho más siniestra y tenebrosa. Fenómenos y ruidos extraños son frecuentes, y durante la mayor parte del juego, Artyom sólo depende de su linterna para poder ver en la total oscuridad. Sin embargo, la superficie es aún más letal, debido a la radiación dejada por las bombas en el pasado, y se necesita usar una máscara de gas en todo momento para sobrevivir el aire tóxico. Muchas veces, las locaciones del juego presentan una distribución intrincada, y el juego carece de cualquier forma de mapa. La única guía que tiene el jugador es una brújula, que no permite el uso de armas de fuego mientras se usa.\r\n\r\nEl juego tampoco contiene un medidor de salud: éste es reemplazado por manchas de sangre en la pantalla y el palpitar de Artyom (que se incrementa cuanto más daño se recibe). Además, no hay ningún indicador que diga cuánto le falta para que el filtro de la máscara de gas se acabe, requiriendo que el jugador revise su reloj continuamente para ver cuanto tiempo le queda antes de tener que reemplazar el filtro por uno nuevo, aunque la respiración se volverá pesada y dificultosa, la vista borrosa y se comenzarán a oír voces. La máscara de gas, además, muestra arañazos o roturas dependiendo del daño que ha recibido en combate. Cuando la máscara se rompe totalmente, se debe cambiar para poder seguir respirando. Más allá de esto, el juego cuenta con elementos clásicos, como la cantidad de munición, filtros e inyecciones de adrenalina (que sirven para recuperar energía si no se puede esperar)","torrent":{"xt":"urn:btih:f57262819b25b0b21884f395b7230f81c98cb36f","amp;dn":"Metro+2033+Redux-.-alforo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57262819b25b0b21884f395b7230f81c98cb36f","infoHashBuffer":{"type":"Buffer","data":[245,114,98,129,155,37,176,178,24,132,243,149,183,35,15,129,201,140,179,111]},"announce":[],"urlList":[]}}