{"title":"Scoreland - Kristi Maxx (Maxx Boobage With Kristi Maxx).wmv","uid":6885035,"size":246311473,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f5d63f5208b86b9780e4349a8241f3b0b7a58b0a&amp;dn=Scoreland+-+Kristi+Maxx+%28Maxx+Boobage+With+Kristi+Maxx%29.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FluxXxu","files":1,"time":1323795717,"description":"Scoreland - Kristi Maxx (Maxx Boobage With Kristi Maxx).wmv\n\nDescription:\nSCORELAND Newcomer Kristi Maxx says that when she wants to fuck, she wants it now. Accommodating Kristi with a big dick was our\nfirst priority for &quot;Maxx Boobage With Kristi Maxx.&quot; &quot;I like a guy who actually pays attention to my noises and body movements,&quot; says Kristi whose rack\ncould inspire a flash mob. SCORE stunt-cock Mr. Largo dives into Kristi's mountainous mounds to suck and lick her 38DDD specials while Kristi joins in\nthe breast worship, kneading and squeezing her natural sweater-melons, removing her top and dropping her bra to expose her eye-popping jugs.\nKristi gets on her knees in bed and lowers her head to engulf Largo's fuck-stick with her mouth and jack the shaft. Showing impressive blow job skills,\nKristi's pierced, wet tongue rides the shaft as her large, soft boobs dangle and hang. Squeezing them together, Kristi inserts his bone between them\nlike a titty bookmark and slides her cleavage-pussy up and down for a cock massager. Kristi has such big tits that his man-meat disappears into her\ndeep cleavage, making us consider whether a search party should be assembled, not that Mr. Largo has any interest in being rescued from this sexy\nAmazon. For her next vanishing act, Kristi mounts up for a dirty cowgirl ride, facing the camera, the first of many fuck positions to come. She keeps her\nhands off her tits as they fly up and down wildly, rythmically in unison while Kristi bounces up and down to drive his cock deeper into her honey pot.\nAnd that's just for starters. When it comes to a big-tit fuck session, tradition generally calls for a breast bath of cum. However, in a SCORELAND Poll,\n27%, the highest percentage by a narrow margin, favored unloading into a girl's mouth and having her swallow. The people have spoken and busty\nKristi gets all the cum she wants. You rock, Kristi Maxx!\n\nTags:\nBig Tits, Blowjob, Cumshot, Ebony\n\nScreens:\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/9891_1.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/9891_1.jpg.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.starpix.us/show.php/9890_2.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starpix.us/show.php/9890_2.jpg.html&lt;/a&gt;","torrent":{"xt":"urn:btih:f5d63f5208b86b9780e4349a8241f3b0b7a58b0a","amp;dn":"Scoreland+-+Kristi+Maxx+%28Maxx+Boobage+With+Kristi+Maxx%29.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5d63f5208b86b9780e4349a8241f3b0b7a58b0a","infoHashBuffer":{"type":"Buffer","data":[245,214,63,82,8,184,107,151,128,228,52,154,130,65,243,176,183,165,139,10]},"announce":[],"urlList":[]}}