{"title":"Jay and Silent Bob strike back.nl subs.avi","uid":6944020,"size":1167881467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5f5a5f975d7776888f7d9f4a3a0f91a8cfefffa&amp;dn=Jay+and+Silent+Bob+strike+back.nl+subs.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bluntje78","files":-1,"time":1326150715,"description":"Jay and Silent Bob Strike Back (2001)\n\n\n\nVerenigde Staten\nkomedie\nca.104 min\n\n\n\nRegie:Kevin Smith\nmet:Jason Mewes,Kevin Smith en Ben Affleck\n\n\n\nKansarme jongeren Jay en Silent Bob ontdekken bij toeval dat er twee stripfiguren op hen zijn gebaseerd, waar ook nog eens een film van wordt gemaakt, zonder dat beide heren er een cent voor krijgen. Dat gaat zomaar niet! Jay en Silent Bob reizen af naar Hollywood om de filmopnamen stil te leggen. Onderweg komen ze de meest zonderlinge figuren tegen en raken verwikkeld in de meest bizarre situaties. Eenmaal in Hollywood belanden ze op de set van Scream 4 en Good Will Hunting 2: Hunting Season. Dat kan nooit lang goed gaan. Jay &amp; Silent Bob Strike Back is een hilarische parodie op Hollywood.\n\n\n\n==================================================================================\n\n\nJay and Silent Bob Strike Back is a tale of adventure on the open road. When Dante and Randal (of Clerks fame) get a restraining order to keep the punchy Jay and his hetero life-mate, Silent Bob, from selling drugs in front of the Quick Stop convenience store, their lives are suddenly empty. They find new purpose when their friend, Brodie, informs them a movie is being made featuring two infamous characters based on their likenesses. After visiting one of the creators of the Bluntman and Chronic, Holden McNeil, they set out to get what fat movie cash they deserve and hopefully put an end to people slandering them on the Internet. Along the way, they learn the rules of the road from a hitchhiking George Carlin, ride with a group of gorgeous jewel thieves, and incur the wrath of a hapless wildlife marshal for liberating an orangutan named Suzanne. The quest takes them from New Jersey to Hollywood where a showdown involving the police, the jewel thieves, and the Bluntman and Chronic filmmakers will decide the fate of Suzanne, Jay, Silent Bob, and their good names.\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0261392/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0261392/&lt;/a&gt;\n\n\n\navi","torrent":{"xt":"urn:btih:f5f5a5f975d7776888f7d9f4a3a0f91a8cfefffa","amp;dn":"Jay+and+Silent+Bob+strike+back.nl+subs.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f5a5f975d7776888f7d9f4a3a0f91a8cfefffa","infoHashBuffer":{"type":"Buffer","data":[245,245,165,249,117,215,119,104,136,247,217,244,163,160,249,26,140,254,255,250]},"announce":[],"urlList":[]}}