{"title":"[Hardtied] Kristine [488p].rm","uid":6915579,"size":258392464,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f7ed81e62b9a41880a985238b481fb1408e26e18&amp;dn=%5BHardtied%5D+Kristine+%5B488p%5D.rm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SplashPt","files":-1,"time":1325015671,"description":"[Hardtied] Kristine [488p].rm\n\n\nDescription: \n\nKristine is a true bondage slut and a rare find. Even before her work has begun, she is already asking for PD to have his way with her. Once PD has her tied, kristine is begging for a chance to suck his cock. she learns quickly that PD demands the best. It takes this bitch a minute to get it right, but once she gets going she earns the privilege of getting her cunt fucked. she is such a bondage slut that her orgasm starts as soon as PD begins to choke her. Since choking gets her pussy flowing, PD ties bends kristine over the bed and ties her neck to the headboard. her cunt is his for the taking this way, and he makes sure she knows it when he savagely pounds it from behind. she cums even harder this time, from both the vibrator on her clit and the cane strokes on her ass. the final position has kristine bound with her legs in the air so both of her holes are fully exposed. her ass hole is empty to start, but PD corrects that with an inflatable cock that fills her up nicely. her pussy is where the real torment happens, though. At first it is just more vibrations and she moans like a slut. The intense finger fucking has her grunting in ecstasy/agony , but the flogger just makes her scream out loud. PD milks the orgasms out of her until she is completely exhausted. Later on she is still shackled to the bed, still being used to satisfy PDs horny whims. !\n\n\nTags: Hardcore, Teen, XxX, Kinky, Bondage, Fuck\n\nResolution:   852x488\n\nDuration:     00:45:42\n\t\nSize:\t      246 MB\n\nScreens:\n\n &lt;a href=&quot;\nhttp://imgnix.com/show.php/584_01.jpg.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnix.com/show.php/584_01.jpg.html&lt;/a&gt;","torrent":{"xt":"urn:btih:f7ed81e62b9a41880a985238b481fb1408e26e18","amp;dn":"%5BHardtied%5D+Kristine+%5B488p%5D.rm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7ed81e62b9a41880a985238b481fb1408e26e18","infoHashBuffer":{"type":"Buffer","data":[247,237,129,230,43,154,65,136,10,152,82,56,180,129,251,20,8,226,110,24]},"announce":[],"urlList":[]}}