{"title":"SkyDrift-TiNYiSO-[SD)","uid":6908009,"size":559888305,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f913caa81f6f4b426f28403a4d4687fefea2ee4d&amp;dn=SkyDrift-TiNYiSO-%5BSD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":4,"time":1324670266,"description":"SkyDrift-TiNYiSO\n\n\nDescription:\n\nGet closer than ever before to the world of adrenaline pumping sky-racing where flyboys can test and master their flying and combat skills against the deadliest opponents! Admire amazingly detailed terrains. Unlock state-of-the-art planes and personalize them with unique racing skins.\n\nBe the first on the single and multiplayer challenges, where possibilities are limited only by your own imagination.\n\nThe goal is simple: If you cant overtake them, shoot them down!\n\n\nFeatures:\n\n    Eight Modern Planes to Fly: Choose from eight modern, state-of-the art airplanes turned into killing machines, each with four different skins for a total of 32 unique racing skins.\n    Six Power-ups! Capture up to two different powers in your planes arsenal, then collect upgrades to increase the strength of those existing powers. Strategy becomes key as you must choose which powers to keep, which ones to upgrade and which ones to convert into Boost energy\n    Stunning Visuals: Race through scenic venues like the Grand Canyon, Alaskan Terrain and Hawaiian Islands, created with beautiful, vibrant colors.\n    8-person Multiplayer: Take your friends down either locally or online in this fast and furious battle.\n    Three Unique Game Modes: Power Race Mode is high-speed racing paired with power-ups; Speed Race Mode where players navigate the course through ring targets that accelerates plane speed and Survival Mode where pilots race against the countdown clock and each other.\n\n     |                       |               \n,---.|---.,---.,---.,---.,---|.   .,-.-.,---.\n`---.|   |,---||    |---'|   ||   || | ||   |\n`---'`   '`---^`    `---'`---'`---'` ' '|---'.org\nMusic,Appz,Xbox360,Tv,Movies,Ps3,Games..|     \n","torrent":{"xt":"urn:btih:f913caa81f6f4b426f28403a4d4687fefea2ee4d","amp;dn":"SkyDrift-TiNYiSO-%5BSD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f913caa81f6f4b426f28403a4d4687fefea2ee4d","infoHashBuffer":{"type":"Buffer","data":[249,19,202,168,31,111,75,66,111,40,64,58,77,70,135,254,254,162,238,77]},"announce":[],"urlList":[]}}