{"title":"George J. Borjas - Heaven's Door (mobi, epub)","uid":6955266,"size":2885525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9367f6c484b301d54681dd9b75398264b711630&amp;dn=George+J.+Borjas+-+Heaven%5C%27s+Door+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1326555438,"description":"Heaven's Door: Immigration Policy and the American Economy\n\nThe U.S. took in more than a million immigrants per year in the late 1990s, more than at any other time in history. For humanitarian and many other reasons, this may be good news. But as George Borjas shows in Heaven's Door, it's decidedly mixed news for the American economy--and positively bad news for the country's poorest citizens. Widely regarded as the country's leading immigration economist, Borjas presents the most comprehensive, accessible, and up-to-date account yet of the economic impact of recent immigration on America. He reveals that the benefits of immigration have been greatly exaggerated and that, if we allow immigration to continue unabated and unmodified, we are supporting an astonishing transfer of wealth from the poorest people in the country, who are disproportionately minorities, to the richest.\nIn the course of the book, Borjas carefully analyzes immigrants' skills, national origins, welfare use, economic mobility, and impact on the labor market, and he makes groundbreaking use of new data to trace current trends in ethnic segregation. He also evaluates the implications of the evidence for the type of immigration policy the that U.S. should pursue. Some of his findings are dramatic:\n\nDespite estimates that range into hundreds of billions of dollars, net annual gains from immigration are only about $8 billion.\n\nIn dragging down wages, immigration currently shifts about $160 billion per year from workers to employers and users of immigrants' services.\n\nImmigrants today are less skilled than their predecessors, more likely to re-quire public assistance, and far more likely to have children who remain in poor, segregated communities.\n\nBorjas considers the moral arguments against restricting immigration and writes eloquently about his own past as an immigrant from Cuba. But he concludes that in the current economic climate--which is less conducive to mass immigration of unskilled labor than past eras--it would be fair and wise to return immigration to the levels of the 1970s (roughly 500,000 per year) and institute policies to favor more skilled immigrants.\n\nAuthor: George J. Borjas\nPublisher: Princeton University Press\nPublication Date: August 9, 1999\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f9367f6c484b301d54681dd9b75398264b711630","amp;dn":"George+J.+Borjas+-+Heaven%5C%27s+Door+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9367f6c484b301d54681dd9b75398264b711630","infoHashBuffer":{"type":"Buffer","data":[249,54,127,108,72,75,48,29,84,104,29,217,183,83,152,38,75,113,22,48]},"announce":[],"urlList":[]}}