{"title":"Man saved from Swine Flu (H1N1) and Leukemia by Vitamin C","uid":6983949,"size":874,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:fac39a04346541e1fa22a634d4bbd39dfd5b8974&amp;dn=Man+saved+from+Swine+Flu+%28H1N1%29+and+Leukemia+by+Vitamin+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"steevo-be-thy-name","files":1,"time":1327503292,"description":"Allan Smith, a New Zealand Dairy Farmer, was referred to Auckland Hospital's Intensive Care Unit when he was found to have contracted H1N1 Swine flu. He was put on 20 days ECMO life support but his condition kept deteriorating and he was additionally diagnosed as having leukemia. At this point, his family were told he could not possibly survive and should just be left to die. \n\nSmith's doctors therefore wanted to remove him from life support and claimed that his death was inevitable. Undeterred, his family demanded that the doctors administer high doses of Vitamin C intravenously (25 grams per day). Despite the doctors' strong opposition to administering this treatment and their apparent intention to let the patient die, the family eventually won their battle and, to cut a long story short, Smith made a complete recovery. To watch the 60 minutes TV documentary download this file.\n\nThere was no way for me to download this video, so here is a text file with the link to watch the videos on the New Zealand website, this is in ENGLISH.\n\n----\n\nIt is sad that medical experts refuse to look at overwhelming evidence of the safety and efficacy of vitamin C. In refusing high dose intravenous Vitamin C under any circumstance, these advisors are sending a clear message to the general public - if you get swine flu, you will be refused an effective, potentially life saving registered medicine and probably die.\n\nRemember, the most two important things your body needs is:\n1. Water\n2. Vitamin C...\n\nWithout water your die, without Vitamin C your dead.","torrent":{"xt":"urn:btih:fac39a04346541e1fa22a634d4bbd39dfd5b8974","amp;dn":"Man+saved+from+Swine+Flu+%28H1N1%29+and+Leukemia+by+Vitamin+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac39a04346541e1fa22a634d4bbd39dfd5b8974","infoHashBuffer":{"type":"Buffer","data":[250,195,154,4,52,101,65,225,250,34,166,52,212,187,211,157,253,91,137,116]},"announce":[],"urlList":[]}}