{"title":"SRI SHIRDI SAI MAHATYAM [1986] telugu, telugu movie","uid":6903093,"size":375050057,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fcdb792d6b0e2475a430181970786c52640c3567&amp;dn=SRI+SHIRDI+SAI+MAHATYAM+%5B1986%5D+telugu%2C+telugu+movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jettij","files":1,"time":1324426885,"description":"\n\nSri Shirdi Saibaba Mahathyam (1986)\n\nDirector:K. Vasu\n\nStars:\n\nVijayachander, Chandramohan and Anjali Devi \n\nDuring the Devrajya it was Bhagwan Shri Vishnu who ruled the universe in the form of Bhagwan Shri Ram; then during the Manavraj, where he ruled as Bhagwan Shri Kishan; in the Kalyug (dark age) He ruled as Lord Jesus and Bhagwan Shri Buddh - and now in Shirdi circa the British Rule in India was Bhagwan Shri Sai Baba. No living person knew how he came about this blessed village - but initially was shunned by both Hindus and Muslims, especially by Bal Bhate who though Sai was a Muslim and forbade him to enter any Mandir; Rohila, a Muslim, who thought Sai was desecrating the local Masjid by performing Hindu prayers and incantations, attempted to kill Sai, but then he saw both Allah and Bhagwan in Sai's eyes and became a devotee. When Sai was ready to give up his body and resurrect himself after 3 days, just like Lord Jesus, a disbelieving Bal had wanted Sai's body to be cremated within 24 hours - only to find out that Sai had indeed risen, and also became his devotee. As did Bhagoti, a leper, who was cured by Sai. Though Sai had no relations, he did call Tatya's mom his sister; Tatya his maternal nephew; a devotee named Laxmi as his daughter, and an elderly woman as his mother. Sai displayed his true form and opulence to another devotee, Nana Chandorkar. Though he lived in a rebuilt Masjid, Sai urged his devotees to pray to God, as the Creator had only created Humans - never any religion or borders - and to love and respect all living beings. He begged for alms daily so that he could collect sins and wash them away. He always uttered 'Allah Bala Kare' and 'Bhagwan Bala Kare' to both Muslims and Hindus alike. He appeared in a multitude form of deities (Lord Jesus, Guru Nanak Devji, Allah, Bhagwan Shri Ganesh) to cater to the various tastes of devotees. Sai was also fond of Nanavli, a mentally challenged devotee, who often challenged Sai, but was one of the few who really understood and accepted Sai as Vishnu's Avatar. Sai appeared simultaneously in a wealthy man's and Nana's dreams and called upon them to construct a Mandir of Bhagwan Shri Kishan. While the construction was under way, Sai prophesied the death of Tatya but also told them not to tell him and to not worry. Shortly thereafter while bequeathing the nine coins symbolizing nine virtues to Laxmi (which depict Sravan, Kirtan, Smaran, Pagsera, Archana, Namaskar, Dastan, Samveta, &amp; Atmanivrdan) Sai was ready to demonstrate to his devotees why they should not worry about Tatya's impending demise.\n\n\nSCREEN SHOTS:\n &lt;a href=&quot;\nhttp://bayimg.com/balAkAaDI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/balAkAaDI&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/BalaLaAdI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/BalaLaAdI&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/balaMaaDI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/balaMaaDI&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/baLanAADI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/baLanAADI&lt;/a&gt;\n\n***********************************************\n\nPLEASE SEED ... DEVOTEES...........\n\nTXS.","torrent":{"xt":"urn:btih:fcdb792d6b0e2475a430181970786c52640c3567","amp;dn":"SRI+SHIRDI+SAI+MAHATYAM+%5B1986%5D+telugu%2C+telugu+movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcdb792d6b0e2475a430181970786c52640c3567","infoHashBuffer":{"type":"Buffer","data":[252,219,121,45,107,14,36,117,164,48,24,25,112,120,108,82,100,12,53,103]},"announce":[],"urlList":[]}}