{"title":"Serious.Sam.The.Random.Encounter.RIP-Unleashed","uid":6907464,"size":41758339,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fce37f753ea8fc086e564d650680a796dc5ad56f&amp;dn=Serious.Sam.The.Random.Encounter.RIP-Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA","files":11,"time":1324649912,"description":"P R E P A R E T O B E U N L E A S H E D ! !\n\nSerious Sam: The Random Encounter RIP\nRelease Date: 23/12/2011 Protection: Steam\nRelease Type: RIP 09x5.00MB Company: Devolver Digital\n\nRelease Notes:\n\nThe legendary Serious Sam reloads and rearms in an explosive\nturn-based RPG developed by indie developer Vlambeer (Super Crate Box\nRidiculous Fishing). Serious Sam: The Random Encounter follows Sam and\nhis band of oddball mercenaries as they battle across a pixilated\nworld teeming chaotic battles, hordes of bizarre creatures, and\nmysterious secrets. Choose your weapons and take aim at the most\nrandom Serious Sam adventure yet!\n\nSerious Sam Indie Series\nThe Serious Sam Indie Series is an extraordinary program launched by\nCroteam and Devolver Digital to partner with gaming's most creative\nindependent developers and design radically unique Serious Sam games\nin a variety of styles and genres\n\nFeatures:\n\nTurn-Based Awesome: Battle across three worlds of pandemonium with\nSerious Sam and his band of quirky commandos as they clash with\nlegions of relentless creatures hell-bent on ruining your day. Choose\nyour weapons and prepare for an absolute onslaught of merciless\nenemies charging from every direction\n\nExtraordinary Visual Design: Behold the pixilated brutality of Serious\nSam s struggle against evil in glorious retro-styled graphics. Visit\nthe exotic locals of Egypt and dangerous caverns overrun by Mental s\ntwisted horde. Battle by land or take on all-new aquatic variations of\nclassic Serious Sam baddies in underwater skirmishes unlike anything\nSam has faced before!\n\nSerious Strategy: No magic here, son. Select from a variety of dynamic\nitems to increase your party s stats, toss out some Headless Kamikaze\nbait, or bring everything to a devastating halt with the all-powerful\nSerious Bomb\n\nChallenge Mode: Take on a never-ending wave of Mental s most fearsome\nminions and attempt to post the best score to win the admiration of\nyour friends and family\n\nRIPPED: Nothing\n\nInstall Notes:\n\n1. Unpack the release with WinRAR or equivalent\n2. Install by running unl-ssre.exe\n3. Start game with sstre.exe\n4. Enjoy!\n\nRemember to support quality games!\n\nUnleashed salutes all friends of the family, contacts and competition!\n\n&quot; Prepare to be Unleashed! &quot;.","torrent":{"xt":"urn:btih:fce37f753ea8fc086e564d650680a796dc5ad56f","amp;dn":"Serious.Sam.The.Random.Encounter.RIP-Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce37f753ea8fc086e564d650680a796dc5ad56f","infoHashBuffer":{"type":"Buffer","data":[252,227,127,117,62,168,252,8,110,86,77,101,6,128,167,150,220,90,213,111]},"announce":[],"urlList":[]}}