{"title":"JOHN MORRISON SPORTS BETTING CHAMP","uid":6924575,"size":1132663,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fd1f1f14906f4ede874915607343f11c3fce0ac2&amp;dn=JOHN+MORRISON+SPORTS+BETTING+CHAMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brundle99","files":7,"time":1325424476,"description":"JOHN MORRISON SPORTS BETTING SYSTEMS!!!!\n\n\t\n\nSports Betting Champ is the clear winner, as far as I am concerned. The main plus for me that it provided direct betting picks. With an amazing 97% success rate (there were 100% win sessions), it can help you win almost every bet that you place. It has been the target of skeptics touting it as scam but I am yet to hear from anyone who has returned the system after using it. The reason is simple, it makes money!\n\nAnother thing I liked about SportsBettingChamp was the fact that it is very easy to use. Most sports betting help sites deliver complex stastics sheets which take a lot of time for analysis. With SportsBettingChamp I really liked being able receive the picks being delivered to my email directly and placing a bet accordingly. It really made the whole experience easier.\n\nAnother cool thing about Sports Betting Champs is that it works for NBA, MLB and NFL. So you don\\'t have to spend your money on multiple sports betting systems.\n\nAlso, it is one of the cheapest sports betting system available. While I used to pay over a few hundred dollars monthly for statistics sheets and handipcaps, I had to make only onetime payment for SportsBettingChamp. They even give you a testing period of 8 weeks. Plenty of time to verify their system and make money testing it. It is backed up with a hundred percent money back guarantee from ClickBank. So there is nothing to lose in trying this system, you will definitely make some money in the process! ","torrent":{"xt":"urn:btih:fd1f1f14906f4ede874915607343f11c3fce0ac2","amp;dn":"JOHN+MORRISON+SPORTS+BETTING+CHAMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd1f1f14906f4ede874915607343f11c3fce0ac2","infoHashBuffer":{"type":"Buffer","data":[253,31,31,20,144,111,78,222,135,73,21,96,115,67,241,28,63,206,10,194]},"announce":[],"urlList":[]}}