{"title":"Hitman 2 Silent Assassin by -treck- (compressed)","uid":6978934,"size":501392032,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd76113eefab3a8cf97b84762596b80ca2a086a8&amp;dn=Hitman+2+Silent+Assassin+by+-treck-+%28compressed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"-treck-","files":1,"time":1327337492,"description":"Agent 47 has been retired to a church in Sicily to seek peace. During his time in church, he works as a gardener for the priest, Father Vittorio. 47 sees the Father Vittorio as his best friend and mentor, attending regularly to confess their sins. The priest understands that 47 has killed many, but believe you are good at heart.\n\nOne day, after confession, Father Vittorio is kidnapped and a ransom note left for 47, demanding $ 500,000 in two days. 47 decided to return to his old job as a murderer to locate Father Vittorio. He contacts his agency, who thought he was dead, and makes a deal with your contact, Diana. Work for them if the agency can help you locate Father Vittorio. They accept the offer.\n\nDiana informed 47 that the Father Vittorio was kidnapped by a Sicilian Mafia capo named Giuseppe Giuliano. Man is priest prisoner in a cell at his mansion, Villa Borghese. Infiltrates and kills 47 to Giuliano, but can not find his friend. Later he said that a satellite image shows that the Father Vittorio was brought by &quot;types looking uniformed Russians.&quot;\n\n47 working with the Agency to pay its attempt to find Vittorio. After both sides are satisfied that the agreement has been reached, 47 negotiates a raise and still accepting contracts. Travel to different countries, including Russia, Japan, Afghanistan, Malaysia and India, to carry out their missions, killing assigned targets ranging from terrorism and crime bosses general agents and enemies. 47 Finally Vittorio abandons his search, thinking he was dead.\n\n47 finally learns the whole thing was a hoax by a man named Sergei Zavorotko, which is an important figure in Russian organized crime. It also has links with the Russian government and military. Sergei was a client of the agency for which 47 had been working all the time. Sergei had hired 47 to kill all the people who knew everything about a nuclear bomb that had acquired. Sergei was also the brother of Arkadij Jegorov, one of the &quot;five fathers&quot; 47. Sergei believes that 47 told the UN on the device, and organizing a murder. 47 then receives the task of the UN to kill Sergei, but is actually a trap. The customer now is Sergei, and deploy to 17, another clone of 47 to kill him. Kills 47 after 17.\n\nFinally, 47 chases Sergei back in the church in Sicily, where he is terrified hostage Father Vittorio. After a battle with the men of Sergei, Sergei ends up killing 47. Vittorio gives his cross to Agent 47, asking him to follow the right path and find peace in your life according to his inner soul. Agent 47 takes a final look at Father Vittorio and leaves the church, the crucifix hanging on the wooden door of the church. You realize you'll never find peace there, and returns to life as a murderer for hire.\n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nEl Agente 47 se ha retirado a una iglesia en Sicilia a buscar paz. Durante su tiempo en la iglesia, ÃƒÂ©l trabaja como jardinero para el sacerdote, el Padre Vittorio. 47 ve al Padre Vittorio como su mejor amigo y mentor, asistiendo regularmente a confesar sus pecados. El sacerdote entiende que 47 ha matado a muchos, pero cree que es bueno en el corazÃƒÂ³n.\n\nUn dÃƒÂ­a, despuÃƒÂ©s de confesarse, el Padre Vittorio es secuestrado y es dejada una nota de rescate para 47, exigiendo 500.000 dÃƒÂ³lares en dos dÃƒÂ­as. 47 decide volver a su antiguo trabajo como asesino para localizar al Padre Vittorio. Se pone en contacto con su agencia, que lo creÃƒÂ­an muerto, y hace un trato con su contacto, Diana. TrabajarÃƒÂ¡ para ellos si la agencia le puede ayudar a localizar al Padre Vittorio. Ellos aceptan la oferta.\n\nDiana informa a 47 que el Padre Vittorio fue secuestrado por un capo mafioso siciliano llamado Giuseppe Giuliano. El hombre tiene preso al sacerdote en una celda en su mansiÃƒÂ³n, en Villa Borghese. 47 se infiltra y mata a Giuliano, pero no encuentra a su amigo. MÃƒÂ¡s tarde le dicen que una imagen de satÃƒÂ©lite muestra que el Padre Vittorio fue llevado por &quot;tipos uniformados con aspecto de rusos&quot;.\n\n47 trabaja con la Agencia para pagar su intento de encontrar a Vittorio. DespuÃƒÂ©s de que ambas partes estÃƒÂ¡n satisfechas de que el acuerdo ha sido cumplido, 47 negocia un aumento de sueldo y sigue aceptando contratos. Viaja a diferentes paÃƒÂ­ses, incluyendo Rusia, JapÃƒÂ³n, AfganistÃƒÂ¡n, Malasia e India, para llevar a cabo sus misiones, asesinando a los objetivos asignados que van desde terroristas y jefes del crimen a agentes y generales enemigos. Finalmente 47 abandona su bÃƒÂºsqueda de Vittorio, creyendo que estaba muerto.\n\n47 finalmente se entera de que todo el asunto era un engaÃƒÂ±o de un hombre llamado Sergei Zavorotko, que es una figura importante en el crimen organizado ruso. TambiÃƒÂ©n tiene vÃƒÂ­nculos con el gobierno y el ejÃƒÂ©rcito rusos. Sergei era un cliente de la Agencia para los cuales 47 habÃƒÂ­a estado trabajando durante todo el tiempo. Sergei habÃƒÂ­a contratado a 47 para matar a toda la gente que sabÃƒÂ­a todo lo relacionado con una bomba nuclear que habÃƒÂ­a adquirido. Sergei era tambiÃƒÂ©n el hermano de Arkadij Jegorov, uno de los &quot;cinco padres&quot; de 47. Sergei cree que 47 le dijo a la ONU sobre el dispositivo, y organiza un asesinato. 47 entonces recibe la tarea de la ONU de matar a Sergei, pero en realidad es una trampa. El cliente actual es Sergei, e intenta utilizar a 17, otro clon de 47 para matarlo. 47 despuÃƒÂ©s mata a 17.\n\nFinalmente, 47 persigue a Sergei de vuelta en la iglesia de Sicilia, donde tiene como rehÃƒÂ©n al aterrorizado Padre Vittorio. DespuÃƒÂ©s de una batalla con los hombres de Sergei, 47 acaba matando a Sergei. Vittorio le da su crucifijo al Agente 47, para pedirle que siga el camino correcto y encuentre la paz en su vida de acuerdo a su alma interior. El Agente 47 da un ÃƒÂºltimo vistazo al Padre Vittorio y sale de la iglesia, colgando el crucifijo en la puerta de madera de la iglesia. Se da cuenta de que nunca encontrarÃƒÂ¡ la paz allÃƒÂ­, y vuelve a una vida como asesino a sueldo.\n\nMinimum Requirements\n\nPentium III 450MHz\n128MB RAM\n16MB 3D accelerator\n16xCD-ROM\n800MB free disk space\n\nWorks on windows 7 64 bits.\n","torrent":{"xt":"urn:btih:fd76113eefab3a8cf97b84762596b80ca2a086a8","amp;dn":"Hitman+2+Silent+Assassin+by+-treck-+%28compressed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd76113eefab3a8cf97b84762596b80ca2a086a8","infoHashBuffer":{"type":"Buffer","data":[253,118,17,62,239,171,58,140,249,123,132,118,37,150,184,12,162,160,134,168]},"announce":[],"urlList":[]}}