{"title":"WE BOUGHT A ZOO XVID GLOBE","uid":6956102,"size":1156720841,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fee319db5c86a2badb763a61e9d87af9491309c7&amp;dn=WE+BOUGHT+A+ZOO+XVID+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"globeplus","files":-1,"time":1326582948,"description":"* XVID     * 01H58M29S    * ~ 1200 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n* INTRO : \n\n\nWe Bought a Zoo is a 2011 comedy-drama film based on a memoir by Benjamin Mee. The film is directed by Cameron Crowe, and it stars actor Matt Damon as the lead character Benjamin Mee. We Bought a Zoo tells the story of Benjamin Mee and his family who just moved into a dilapidated zoo. They took on the challenge of preparing the zoo for its reopening to the public.\n\nWe Bought a Zoo was released in the US box office on 23 December 2011. The film received a mixed to positive reception from film critics, and grossed a total of $23,399,816 as of 28 December 2011 .\n\n\n* PLOT :\n\n\nFacing his son's expulsion from school, recent widower, Benjamin Mee decides to begin a new life. To escape the sad reminders of his deceased wife, he buys a large house with a zoo in the backyard. Although reluctant to take on the zoo with all its animals - he decides to give it a try. His daughter, 7-year-old Rosie is happy with the decision, while his 14-year-old son Dylan unhappily retreats into his art work. Benjamin meets the zoo staff and they begin their work to have the zoo up and running by summer. Meanwhile, Dylan and 13-year-old Lily begin a friendship, although Dylan is shy and uneasy initially.\n\nThe zoo runs into trouble when Benjamin's bank account runs dry. The morale of the workers starts to dip and they fear Benjamin will sell the property. At the same time, Lily becomes upset with Dylan after he happily receives news his family may be leaving the zoo. However, Benjamin discovers that his late wife has left him an investment account with instruction to use the money wisely while listening to his heart. This discovery lifts the spirits of the zoo's workers. Heartbroken and disappointed about staying at the zoo, Dylan confronts his father and a heated argument ensues. However, they manage to reconcile the next morning. When Dylan admits he misses Lily, Benjamin gives his son advice on reconciling with her.\n\nPrior to the grand opening, the facility passes a very stringent inspection and Dylan, following his father's advice, reconciles with Lily and confesses his love for her.\n\n\n\n* enjoy ...\n\n\n\n\n\n\n* GLOBE FILES 2012 *","torrent":{"xt":"urn:btih:fee319db5c86a2badb763a61e9d87af9491309c7","amp;dn":"WE+BOUGHT+A+ZOO+XVID+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fee319db5c86a2badb763a61e9d87af9491309c7","infoHashBuffer":{"type":"Buffer","data":[254,227,25,219,92,134,162,186,219,118,58,97,233,216,122,249,73,19,9,199]},"announce":[],"urlList":[]}}